{"title":"Shreddage","uid":13258232,"size":4074906009,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0091b9c0d5f120e77a7e9fa927eeb732e8aaafbf&amp;dn=Shreddage&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rimisky","files":152,"time":1453237538,"description":"Shreddage II: Absolute Electric Guitar is our answer to the challenge of total guitar sampling. It is a complete instrument with elegant scripting, intuitive mapping, and incredible depth. This virtual guitar for Kontakt is the ultimate weapon for rock &amp; metal music, built from the ground up for realistic playing in any hi-gain style. All samples were recorded on a 7-string guitar and are provided clean/DI so you can use your own custom amp tone - or use the included Peavey ReValver HPse.\r\nWant to write blazing leads and screaming solos? Crank the pitch bend up, use one of four vibrato modes, and shred to your heart's content. Need some ultra-chunky rhythm chugs? S2 features both single-note and powerchord palm mutes with up to 5 layers and 8 variations each, offering superior realism and maximum options. While it excels at rock &amp; metal playing (both lead and rhythm alike), it is also well-suited for many other genres thanks to its clean tone and huge range.\r\nWith the new Shreddage 2X update released in July 2014, S2 is better than ever. Enjoy a brand-new user interface and totally rewritten engine, with intelligent string / fret selection, new features and options, even more customizable mapping, and new samples like powerchord slides and staccatos. You can also use new built-in effects pedals and save/load your own custom presets to use across multiple projects.\r\nWe couldn't be prouder of this release, and hope that it will bring you inspiration, joy, productivity, and of course, brutal guitar sounds!","torrent":{"xt":"urn:btih:0091b9c0d5f120e77a7e9fa927eeb732e8aaafbf","amp;dn":"Shreddage","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0091b9c0d5f120e77a7e9fa927eeb732e8aaafbf","infoHashBuffer":{"type":"Buffer","data":[0,145,185,192,213,241,32,231,122,126,159,169,39,238,183,50,232,170,175,191]},"announce":[],"urlList":[]}}