{"title":"Corrosion Prevention of Magnesium Alloys","uid":14701970,"size":54998339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00f46c972d23ed3f9097d9e6cb22a0bdb68e7345&amp;dn=Corrosion+Prevention+of+Magnesium+Alloys&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1464311842,"description":"Corrosion Prevention of Magnesium Alloys - Guang-Ling Song (WP, 2013).pdf\r\n\r\nMagnesium (Mg) alloys are receiving increasing attention due to their abundance, light weight, castability, formability, mechanical properties and corrosion performance. By selecting the appropriate combination of materials, coatings and surface modifications, their corrosion resistance can be greatly enhanced. Corrosion prevention of magnesium alloys is a comprehensive guide to the effective prevention of corrosion in these important light metals.\r\n\r\nPart one discusses alloying, inhibition and prevention strategies for magnesium alloys as well as corrosion and prevention principles. Part two reviews surface treatment and conversion. Beginning with an overview of surface cleaning and pre-conditioning, the book goes on to discuss the use of surface processing and alloying, laser treatments, chemical conversion and electrochemical anodization to improve the corrosion resistance of magnesium alloys. Coatings are then the focus of part three, including varied plating techniques, cold spray coatings, gel and electroless electrophoresis coatings. Finally, the book concludes in part four with a selection of case studies investigating the application of preventative techniques for both automotive and medical applications.\r\n\r\nWith its distinguished editor and international team of expert contributors, Corrosion prevention of magnesium alloys is a key reference tool for all those working with magnesium and its alloys, including scientists, engineers, metallurgists, aerospace and automotive professionals, and academics interested in this field.\r\n\r\nChapters provide an overview of surface cleaning and pre-conditioning\r\nExamines processes to improve the corrosion resistance of magnesium alloys, including laser treatments and chemical conversion and electrochemical anodization\r\nDiscusses cold spray, sol-gel and electrophoretic coatings","torrent":{"xt":"urn:btih:00f46c972d23ed3f9097d9e6cb22a0bdb68e7345","amp;dn":"Corrosion+Prevention+of+Magnesium+Alloys","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00f46c972d23ed3f9097d9e6cb22a0bdb68e7345","infoHashBuffer":{"type":"Buffer","data":[0,244,108,151,45,35,237,63,144,151,217,230,203,34,160,189,182,142,115,69]},"announce":[],"urlList":[]}}