{"title":"Roberto.Carlos.Detalhes.2015.1080p..mkv","uid":13353185,"size":4026750181,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:016a96e884c249f598bfe55badaa10a10a4c9976&amp;dn=Roberto.Carlos.Detalhes.2015.1080p..mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ney10","files":1,"time":1454102170,"description":"dedicado à Jovem Guarda, tem início o especial Roberto Carlos, Detalhes. O show do cantor, que tradicionalmente faz parte da programação de fim de ano da Globo, é exibido nesta quarta-feira (23/12), \r\n\r\nOs arranjos para as músicas da primeira parte do show foram feitos pela banda Jota Quest. Os músicos do grupo se juntam a Paulo Ricardo e Carlinhos Brown, formando a Star Band, que acompanha Roberto Carlos neste trecho do especial.\r\n\r\nMúsicas como Calhambeque, Namoradinha de Um Amigo Meu e Eu Sou Terrível estão no repertório deste bloco, que é uma homenagem aos 50 anos da Jovem Guarda, celebrados em 2015. Com Wanderlea, Roberto Carlos canta Eu te Darei o Céu. Em Pode Vir Quente que Estou Fervendo, o anfitrião divide os vocais com Erasmo Carlos.\r\n\r\nA segunda banda a acompanhar Roberto Carlos é a do estúdio Abbey Road, da Inglaterra, onde ele gravou Primeira Fila, disco mais recente do artista brasileiro. O grupo é composto por músicos como Albert Menendez (teclado), Grecco Buratto (guitarra) e Richard Bravo (percussão). Eu te Amo, te Amo, te Amo e As Curvas da Estrada de Santos entraram neste bloco.\r\n\r\nO terceiro trecho do especial tem sucessos como Além do Horizonte e Emoções. Roberto Carlos estava acompanhado pela banda R9, que trabalha com ele há anos.\r\n\r\nOs outros convidados do cantor em 2015 são Ludmilla e Thiaguinho.\r\n\r\nO show foi gravado no Theatro Municipal do Rio de Janeiro, com direção geral de L.P. Simonetti. A direção musical é de Guto Graça Mello, maestro Eduardo Lages e Torcuato Mariano","torrent":{"xt":"urn:btih:016a96e884c249f598bfe55badaa10a10a4c9976","amp;dn":"Roberto.Carlos.Detalhes.2015.1080p..mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"016a96e884c249f598bfe55badaa10a10a4c9976","infoHashBuffer":{"type":"Buffer","data":[1,106,150,232,132,194,73,245,152,191,229,91,173,170,16,161,10,76,153,118]},"announce":[],"urlList":[]}}