{"title":"Ace Academy Black Flight 1.0.5 (mod money) apk + data","uid":13107331,"size":167778616,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0178c35e44fb5a277f3ee6494cf2981d110b9f03&amp;dn=Ace+Academy+Black+Flight+1.0.5+%28mod+money%29+apk+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1451344264,"description":"A MUST HAVE for casual gamers, aviation enthusiasts and any action-adventure fan.\r\n\r\nAce Academy: Black Flight will pin you to your seat as you experience WWI dogfighting like never before.\r\n\r\nEpic aerial combat in stunning visual environments\r\n\r\nFully customizeable aircraft, including enhanced performance, weaponry and paint schemes\r\n\r\nNarrative-driven experience with accurate historical timelines and worlds to explore\r\n\r\nExperience unmatched gameplay, graphics and narrative as you climb into the cockpit of the most aggressive WWI dogfighting game on mobile. You will fly with real squadrons, over actual historical locations, as you ascend the ranks to become a World War One Ace. You will fight for King and Country from the shores of England and Belgium to Flanders and the Western Front.\r\n\r\nUnlock, upgrade and customize the leading aircraft of WWI as you attack airships, rail lines, convoys, and enemy bombers. Test your abilities as you go head to head with top German Jastas in Fokker and Albatross fighters.\r\nExperience a rich historical narrative, based on accurate WWI people, locations and events. Discover the major battles and theatres that made WWI one of the most gruelling wars ever fought!\r\n\r\nAce Academy: Black Flight was developed in partnership with the Canada Aviation and Space Museum, which helped curate and craft the rich narrative and historical timeline. The game features images of outstanding artifacts and stunning photography, immersing you in the realities of the time. The result is one of the most historically accurate games available for your mobile device.\r\n\r\nJoin the ranks of Black Flight, explore the world of 100 years ago, and earn your place in history.\r\n\r\nWhat's New:\r\n- Bug fixes\r\n- Improved audio\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play. \r\nRequirements: Android 2.3 +","torrent":{"xt":"urn:btih:0178c35e44fb5a277f3ee6494cf2981d110b9f03","amp;dn":"Ace+Academy+Black+Flight+1.0.5+%28mod+money%29+apk+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0178c35e44fb5a277f3ee6494cf2981d110b9f03","infoHashBuffer":{"type":"Buffer","data":[1,120,195,94,68,251,90,39,127,62,230,73,76,242,152,29,17,11,159,3]},"announce":[],"urlList":[]}}