{"title":"TruckSimulation 16 v1.0.1.6958","uid":13428975,"size":363734936,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0191365d7765ef04580ed6bd1f39d02ddfd2a286&amp;dn=TruckSimulation+16+v1.0.1.6958&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":2,"time":1454616392,"description":"Let it snow! Thanks to the latest update, TruckSimulation 16 presents itself in a wintry look. Enjoy the white winter wonderland for a short time only!\r\nIn TruckSimulation 16 you will take true-to-life control of one of seven real trucks. \r\n\r\nStart out with a rickety old clunker and earn your first coins in a variety of supply contracts across a large road network in Western and Central Europe. Use the money you earn to purchase better trucks, such as five faithfully reproduced MAN tractor units!\r\n\r\nDiverse mission types, from standard orders to the transportation of hazardous goods, provide plenty of variety. Select the right trailer for one of eight different categories of goods – transport bulky goods using the wood semitrailer or groceries with the frozen trunk-semitrailer.\r\n\r\nThe road network covers vast parts of Central and Western Europe and, with more than 20 cities complete with realistic landmarks, it provides unlimited driving pleasure along familiar highways.\r\n\r\nIf you undertake your journeys carefully and punctually, you will receive bonuses that you can invest into your company – in the management menu you can employ new workers, who will be able to undertake journeys and bring in money for new vehicles and trailers.\r\n\r\nHave you amassed a small fortune? Then treat yourself to the faithfully-reproduced racing truck by Team Hahn, the several-time European champions, and hurtle along Europe's highways in a real racing truck.\r\nWill you become the biggest player in European logistics?\r\n\r\nFeatures:\r\n\r\n- 7 realistic trucks \r\n- Faithfully reproduced tractor units licensed by MAN\r\n- Real racing truck by Team Hahn\r\n- 8 different trailers for 8 different categories of goods\r\n- Huge road network realistically modeled on vast parts of Central and Western Europe\r\n- More than 20 cities and their landmarks\r\n- Even more realism, thanks to the cockpit view and faithfully modeled MAN fittings\r\n- Comprehensive management system: hire drivers and build garages in different cities to expand your empire\r\n\r\nThe app supports the following languages: US-EN, DE, FR, ES, IT, TR, PL, BRZ PT, RU, JP\r\n\r\nWhat's new:\r\n\r\nNew content:\r\n\r\n* Japanese and Russian language support enabled\r\n* Winter vegetation added\r\n* Winter terrain texture added\r\n\r\nFixes:\r\n\r\n* Fixed several localization issues\r\n* Updated several UI elements\r\n* Error with the &quot;Bank&quot; button during tutorial fixed\r\n* Cooling truck/trailer sticking bug fixed\r\n* Internal game initialization bug fixed\r\n* Job lightpillar object texture &amp; scaling fixed\r\n* Overall game popup sizes changed to fit new supported languages\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.astragon.trucksim\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.astragon.trucksim' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:0191365d7765ef04580ed6bd1f39d02ddfd2a286","amp;dn":"TruckSimulation+16+v1.0.1.6958","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0191365d7765ef04580ed6bd1f39d02ddfd2a286","infoHashBuffer":{"type":"Buffer","data":[1,145,54,93,119,101,239,4,88,14,214,189,31,57,208,45,223,210,162,134]},"announce":[],"urlList":[]}}