{"title":"Teens Love Anal 2 (Team Skeet) [2016/DVDRip]","uid":14723059,"size":1402732647,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:01cf459bd8b20e3f46cf6eb55a8a2e7dfb5216ee&amp;dn=Teens+Love+Anal+2+%28Team+Skeet%29+%5B2016%2FDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":1,"time":1464528106,"description":"Gallery and Description:\r\n \nhttp://imageview.me/viewer.php?file=902jphjzmg.jpg\r\n \nhttp://imageview.me/viewer.php?file=yd0862prmj.jpg\r\n\r\nProduction year: 2016\r\nCountry: USA\r\nGenre: 18+ Teens, Anal\r\nDuration: 2:28:52\r\nEnglish language\r\nStudio: Team Skeet\r\n\r\nStarring: Alexa Nova, Aubrey Holiday, Cassidy Klein, Kylie Sinner, Miranda Miller.\r\n\r\nDescription: Alexa Nova - Alexa overheard her step-dad and mom arguing because he wants to fuck her in the ass but she would never let him. Alexa dreamed of having her step-dad fuck her ass instead of her mom's! Later, Alexa told him he could have her ass whenever he wants! He could not resist when she spread her ass, revealing her perfect tight butt hole!\r\n\r\nAubrey Holiday - Aubrey was going around the neighborhood preaching about religion. She went to one house and the guy was having none of it. He tells her that she has not lived yet and to touch his dick! She was amazed and after a while he told her about a loophole since she was saving herself for the lord! You're still a virgin if you only take it in the ass!\r\n\r\nCassidy Klein - Cassidy went into her sisters room to look for some money to go shopping with. What she found instead was anal beads! She opened the anal beads and decided to try them on herself and was amazed with how good it felt. Her sisters boyfriend came by, caught her in the act and started telling her about something that feels even better!\r\n\r\nKylie Sinner - Kylie found out her boyfriend has been cheating on her so she decided to make a revenge tape just for him! She called over her neighbor, who her boyfriend hates. He eats her ass before he fills her tight asshole while she moaned and talked shit to the camera the whole time. She even tasted her own ass off his dick!\r\n\r\nMiranda Miller - Miranda always had a crush on Richie. She tells him that she 'a virgin and plans to stay that way - he tells her about a loophole where she can have anal sex and still be a virgin! At first it was tough, but soon she was moaning for more! He pounded into her tight teen ass until she dropped to her knees and swallowed his load!\r\n\r\nVideo Quality: DVDRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 720x404 29.97fps 1115kbps\r\nAudio: AAC 48000Hz stereo 132kbps","torrent":{"xt":"urn:btih:01cf459bd8b20e3f46cf6eb55a8a2e7dfb5216ee","amp;dn":"Teens+Love+Anal+2+%28Team+Skeet%29+%5B2016%2FDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cf459bd8b20e3f46cf6eb55a8a2e7dfb5216ee","infoHashBuffer":{"type":"Buffer","data":[1,207,69,155,216,178,14,63,70,207,110,181,90,138,46,125,251,82,22,238]},"announce":[],"urlList":[]}}