{"title":"Infectious Microecology - Theory and Applications","uid":14914777,"size":4621551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0830cfa91fc2f953108f7a205d27fd9ac9fc95fe&amp;dn=Infectious+Microecology+-+Theory+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1465880824,"description":"Infectious Microecology - Theory and Applications - Lanjuan Li (Springer, 2014).pdf\r\n\r\nISBN 978-3-662-43882-4\r\n\r\n&quot;Infectious Microecology: Theory and Applications&quot; firstly introduces microecology in the study of infection and proposes new anti-infection methods and strategies and then provides a comprehensive and up-to-date overview of research on infectious microecology. It concludes with a new theory for studying infectious diseases. This book presents the basic theories and fundamentals of infectious microecology, covering all the microecological systems relevant to clinical work. It also describes a new strategy and method to combat infectious diseases and provides detailed descriptions of studies and techniques in infectious microecology. The book discusses utilizing 10 years’ worth of research and clinical practice, referring to recent literature on the relationship between infection and microecology and combined with the latest research findings on liver microecology. In addition, it outlines the latest advances in the theory and techniques in the field of infectious microecology.\r\n\r\nIt is intended for doctors, researchers and graduate students in the fields of infectious disease and microecology.\r\n\r\nDr. Lanjuan Li is member of the Chinese Academy of Engineering, she is also a Professor and Chief Physician at Zhejiang University, China","torrent":{"xt":"urn:btih:0830cfa91fc2f953108f7a205d27fd9ac9fc95fe","amp;dn":"Infectious+Microecology+-+Theory+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0830cfa91fc2f953108f7a205d27fd9ac9fc95fe","infoHashBuffer":{"type":"Buffer","data":[8,48,207,169,31,194,249,83,16,143,122,32,93,39,253,154,201,252,149,254]},"announce":[],"urlList":[]}}