{"title":"[Classic]Pruimen Bloesem (International Phone Sex Girls 2) (1982","uid":13094028,"size":945503550,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:08423aecdc4946f0bff23dff72a2b035e1a84732&amp;dn=%5BClassic%5DPruimen+Bloesem+%28International+Phone+Sex+Girls+2%29+%281982&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1451092930,"description":"Country: Netherlands\r\nDirector: Willem van Batenburg\r\nStarring: Diana de Koning, Tanja Overeem, Wilma de Winter, Evert van Lingen, Frank Boogaard, Ivo Verlinden, Richard Wildens, Joost Messing\r\nDescription: Myriam (Diana De Koning) is the nymphomaniac wife of a wealthy older man. Living a life of unlimited luxury in a gorgeous countryside villa (actually the property of a well-known and subsequently seized Dutch criminal), she entertains both men and women with complete disregard for any personal feelings that they might develop for her. Herein lies the problem I've always had with this film. While director and star frequently defended their movie as being more sensitive and &quot;female-friendly&quot; than the average porno, it cannot be denied that this central character though liberated is a particularly unsympathetic and even obnoxious woman. On the other hand, it's somewhat refreshing that she's not punished for being a &quot;bitch&quot;. A former lover attempts to kidnap her but she manages to reason with him, allowing her to return to her private pool for an underwater romp with both of the film's well-endowed male leads, the film's most erotic sex scene. Incidentally, the curly-haired blonde guy (credited as &quot;Richard Wildens&quot; but whose real first name was Sander) was Diana De Koning's real life boyfriend at the time. Her casting in the lead role was a fluke as she just accompanied him to the set with no thoughts of starring in the film herself. A natural actress, she ended up as the movie's most enduring asset. Self-assuredly stomping all over anyone foolish enough to offer her his (or, in one case, her) heart, she imbues Myriam with an ebullient vitality so you begrudgingly admire her to some extent even as you don't really like her. As an ironic footnote, Diana had to split her wages with her boyfriend who received none for his &quot;stud duties&quot; here!\r\n\r\nFile Name : Pruimen Bloesem (1982).avi\r\nFile Size : 957.42 MB\r\nResolution : 640x480\r\nDuration : 01:13:56\r\nVideo : xvid (xvid), 1 541 Kbps, 25.000 fps\r\nAudio : MPEG Audio (MPEG-1 Audio layer 3), 256 Kbps (CBR), 48.0 KHz, 2 channels, 1 stream\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://myimg.info/img-567ddd2647a1e.html \r\n \nhttp://photo-up.info/img-567ddd33a4f8f.html","torrent":{"xt":"urn:btih:08423aecdc4946f0bff23dff72a2b035e1a84732","amp;dn":"%5BClassic%5DPruimen+Bloesem+%28International+Phone+Sex+Girls+2%29+%281982","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08423aecdc4946f0bff23dff72a2b035e1a84732","infoHashBuffer":{"type":"Buffer","data":[8,66,58,236,220,73,70,240,191,242,61,255,114,162,176,53,225,168,71,50]},"announce":[],"urlList":[]}}