{"title":"Spider-Man Unlimited v1.9.0s [Mod]","uid":13091300,"size":16146402,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0a524dbbe5bc19ee845f75c356e65e1c39a6e333&amp;dn=Spider-Man+Unlimited+v1.9.0s+%5BMod%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1451046812,"description":"Swing into a hand-drawn, action-packed arcade adventure game where you’ll unite every Spider-Man and Spider-Woman against the ultimate threat! \r\nExperience a story that feels like it jumped straight from a Marvel comic as you recruit an army of heroes in the Spider-Verse. Combat the new Sinister Six, who have opened a dimensional portal in New York to summon endless versions of themselves! This exponential evil is moving from dimension to dimension, destroying each one. Now ours is fighting to survive!\r\n\r\nTHE GREEN GOBLIN (ISSUE 1), THE VULTURE (ISSUE 2), ELECTRO (ISSUE 3), SANDMAN (ISSUE 4), DOC OCK (ISSUE 5), AND MYSTERIO (ISSUE 6) ARE HERE! What awaits you after the Sinister Six? Stay tuned to find out…\r\n\r\nTHE FIRST FREE SPIDER-MAN GAME!\r\n• Enjoy the thrill of the first amazing Spider-Man arcade web-runner! Swing, run and fight through chaotic NYC in over 7 different environments!\r\n• Go beyond an endless runner game with superior fighting and running gameplay! Combat dimensional super villains, web-swing, go running up walls and perform skydives!\r\n• Play story mode with 5 boss battles to fight and 25 missions per Issue! The action never stops with new daily and weekly events and spectacular rewards in Events Mode! Or run to the top of the leaderboards in Unlimited Mode!\r\n\r\nTHE FIRST NARRATIVE RUNNER!\r\n• A continually running, episodic adventure game: The Sinister Six are moving from dimension to dimension, destroying everything in their path – and our world is next! But this ultimate army of Spideys is fighting to give the Six a run for their money!\r\n• Dive into an extensive Marvel Universe spanning over 50 years of Spider-Man with iconic characters, including dimensional Spider-Men, multiple variations of each villain, as well as Nick Fury, Mary Jane, and Black Cat!\r\n• Written with an experienced Spider-Man comic writer to ensure a faithful recreation of the Spider-Man comics in an arcade running game!\r\n\r\nTHE MOST SPIDEYS IN ONE GAME!\r\n• Summon, collect and play as tons of Spider-Men and Spider-Women featured throughout the Marvel Universe, including Superior Spider-Man, Spider-Gwen, Scarlet Spider, and Ultimate Spider-Man!\r\n• Collect, fuse, and level up your cards to make the ultimate Spidey runner. Each has their own unique super-powers to help fight through Spidey Ops missions around NYC!\r\n• CONSISTENT RELEASE OF NEW SPIDER-MEN AND SPIDER-WOMEN!\r\n\r\nA VISUAL BLAST\r\n• An amazing cel-shaded art style inspired by the Marvel comics.\r\n• Super-smooth graphic animation that brings your runner’s every action to life.\r\nFor fans of arcade games, amazing action, adventure, fast combat, endless running, fighting evil, super hero games, and Marvel comics.\r\n\r\nWhat's New:\r\n• Our most hog-wild hero yet is about to join the fray: Spider-Ham! And he's bringing friends and plenty of villainous swine to Spider-Man: Unlimited.\r\n• SPIDER-HAM: Squeal with joy for the newest hero on the block! Complete a special upcoming event to unlock this hero and discover the story of a humble spider that was bitten by a radioactive pig and now fights the Green Gobbler.\r\n• More INVENTORY SLOTS: Get ready to hire more Spideys for your team!\r\n\r\nHacks:\r\nUnlimited Everything \r\nINFO:\r\n-PLAY OFFLINE ONLY! \r\n\r\nRequirements: Android 4.0+","torrent":{"xt":"urn:btih:0a524dbbe5bc19ee845f75c356e65e1c39a6e333","amp;dn":"Spider-Man+Unlimited+v1.9.0s+%5BMod%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a524dbbe5bc19ee845f75c356e65e1c39a6e333","infoHashBuffer":{"type":"Buffer","data":[10,82,77,187,229,188,25,238,132,95,117,195,86,230,94,28,57,166,227,51]},"announce":[],"urlList":[]}}