{"title":"Hidden Secrets - Part 81 - UFOS Dont Be Deceived","uid":13348084,"size":9586334501,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1201f239124ddfe790df71afdfb5902cb8b685d2&amp;dn=Hidden+Secrets+-+Part+81+-+UFOS+Dont+Be+Deceived&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":67,"time":1454068044,"description":"Best Documentary of UFOs in our Solar System:\r\nUFOS AND THE LAST DAYS DECEPTION:\r\nSpecial Guest Billy Crone presents the NWO's grand deception and the UFO agenda.  Learn what researchers, both secular and biblical, have evidenced along with their interpretations.  What, how and why is this happening? This is a must for all to see.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nUFOs ABOVE TOP SECRET HD - Secrecy, Tesla, Energy, Antigravity &amp; Interstellar Travel:\r\nIn a UFOTV special, this film explores the history of our modern technological age, advances in science, the question of UFOs, and how our world governments have controlled the flow of information to the public regarding the truth about UFOs. Nikola Tesla, Free Energy and Antigravity are also investigated. Includes a fantastic collection of interviews from top scientists and researchers from around the world and incredible photos and video of UFOs in flight. \r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nLA Marzulli The Supernatural and the Alien Gospel:\r\nOnce you dive headfirst into the UFO phenomenon, you come to realize you are dealing with a very dark force, completely unrelated to ET or benevolent aliens. Gary Stearman and L.A. Marzulli discuss this phenomenon and other supernatural elements that the church ignores. \nhttp://www.prophecywatchers.com\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nUFOs and Alien Structures on Mars:\r\nMars has forever been a source of mystery and intrigue for human cultures throughout the millenia. What if an ancient alien civilization existed on the red planet eons before our society evolved? Are there cultural connections between our civilization and theirs?\r\n\r\nFootage includes a comparison between an ancient Earth temple and its martian comparision, numerous UFO sightings on Mars from the NASA Curiosity rover cameras, a cylindrical Mars orbital UFO, as well as the possibility that humans may have already visited Mars.\r\n\r\nMars is our compatriot planet. Its past, present, and future, will necessarily be intertwined with ours. How has that future played out to date? What information has been overlooked? What conspiracy has been buried? If there is ever to be a human effort into space it will begin with Mars - but what if that effort is ancient history? Or, perhaps more interestingly, what if that effort is currently underway?\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nTom Horn Interviews Dr. Michael Lake On The Shinar Directive:\r\nIn the ancient plains of Shinar, an evil was born: the first world king, the prototype transhuman, the ultimate despot, the Son of Perdition—Nimrod. In Babylon, the Son of Perdition devised the Shinar Directive: the enslaving of humanity and the war against the God of Heaven. God’s intervention at the Tower of Babel only delayed Nimrod’s hellish plans. As the powers of Mystery Babylon gather to create the new Tower of Babel and to prepare for the Son of Perdition’s return, Heaven is issuing a clarion call to the Remnant: Know the strategies of the enemy, untangle yourself from them, and become the victorious Church!\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\n7-9-2014 Trans-humanism, artificial intelligence, bionic super humans:\r\nLearn how these topics our threatening our world today.  No longer are they simply found in science fiction writings, Not at all.  Instead, they are quickly entering our reality with a political and life-changing agenda.  Please inform yourselves as this will become widespread in our near future.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nHearing Vioces - SkyWatchTV Science - 1-26-15:\r\nSkyWatch TV Science Editor Sharon K. Gilbert looks at a new report about people who hear voices, a possible biological discovery in the stratosphere, and how immersive augmented reality might figure into end times prophecy.\r\n-----------------------------------------------------------------------------------------------------------\r\n\r\nRavenous Wolves, Witchcraft and Rescuing The Scattered Sheep:\r\nA disturbing yet mind-opening presentation of frequent encounters (right in front of our eyes)","torrent":{"xt":"urn:btih:1201f239124ddfe790df71afdfb5902cb8b685d2","amp;dn":"Hidden+Secrets+-+Part+81+-+UFOS+Dont+Be+Deceived","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1201f239124ddfe790df71afdfb5902cb8b685d2","infoHashBuffer":{"type":"Buffer","data":[18,1,242,57,18,77,223,231,144,223,113,175,223,181,144,44,184,182,133,210]},"announce":[],"urlList":[]}}