{"title":"Rigmar Radio Karaoke Collection 38100","uid":13383483,"size":1743150595,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:141def3179a569f2979d39543d1086d2c13f6df8&amp;dn=Rigmar+Radio+Karaoke+Collection+38100&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":602,"time":1454285272,"description":"300 more classic Karaoke tracks in CDG+MP3 format from the Rigmar Collection.  Please download in a timely manner.  It is not fair on the seeds who stay behind to take days to download 1.6GB of data, which at my upload speed a single peer should be able to download in under an hour.\r\n\r\nImprove your download speeds by just running this download and no more than one seeding torrent.  Check your ports are open (network adviser is on the Bottom right hand corner of the Micro Torrent main window and should be green.\r\n\r\nVuze will inform you you have a NAT problem.   To fix blocked ports in your router try this site: http://www.http://setuprouter.com/\r\n\r\nBlocked ports mean you can not communicate with fellow peers in the swarm very well and as you can only really leech from the seeds in any swarm you kill the torrent average speeds for everyone in the swarm.\r\n\r\nI use super seeding for the first few hours and if you have blocked ports you can not download from me as you can not hear me announce the bit I wish to give to you.  You can only talk, not listen.\r\n\r\nSure most seeds will download to you, but a lot less peers will download to you as you can not communicate both ways.  In any large swarm with only 1 seed you really loose out as there are way more peers than seeds.\r\n\r\nYou will often see a half dozen similar peers all stuck on a low percentage of the download, while 3 or 4 peers streak away downloading from me at normal speeds.\r\n\r\nRigmar Radio - Attempting to help educate bit torrent users since 2003","torrent":{"xt":"urn:btih:141def3179a569f2979d39543d1086d2c13f6df8","amp;dn":"Rigmar+Radio+Karaoke+Collection+38100","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"141def3179a569f2979d39543d1086d2c13f6df8","infoHashBuffer":{"type":"Buffer","data":[20,29,239,49,121,165,105,242,151,157,57,84,61,16,134,210,193,63,109,248]},"announce":[],"urlList":[]}}