{"title":"Star Wars: Episode I - Shadow of the Sith (L8wrtr Fanedit)","uid":13151139,"size":23189163958,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:146906733909424dd85acf70c4a7e8a3db637922&amp;dn=Star+Wars%3A+Episode+I+-+Shadow+of+the+Sith+%28L8wrtr+Fanedit%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BmanInBed","files":12,"time":1452058061,"description":"Star Wars: Episode I - Shadow of the Sith (2010)\r\n\r\nFaneditor Name: L8wrtr\r\nTagline: He is the Chosen One...\r\nOriginal Movie Title: Star Wars: Episode I - The Phantom Menace\r\nGenre: Science Fiction\r\nFranchise: Star Wars\r\nFanedit Type: FanFix\r\nOriginal Release Date: 1999\r\nOriginal Running Time: 136\r\nFanedit Release Date: July 2010\r\nFanedit Running Time: 96\r\nTime Cut: 41\r\n\r\nFanedit Information\r\n\r\nBrief Synopsis:\r\nThe first fanedit in the L8wrtr Star Wars Prequel Trilogy, Shadow of the Sith both radically improves The Phantom Manace as well as sets the tone for the entire re-edited prequel universe. With a focus on quality characters, improved pacing and relentless removal of childish humor and redundant story-telling, this edit bends Episode I back into the direction of the Original Trilogy, respecting concepts established\r\n\r\nIntention:\r\nAs is the case for many fans of Star Wars, The Phantom Edit went a long way toward rescuing the original Phantom Menace for me. For a long time both it and his follow-up edit of Episode II were my ‘definitive’ versions of the films. \r\n\r\nWith Nichols choosing to never release an edit of Episode III I began playing around with the idea of editing it myself. I'd never edited anything before and my first attempts were crude at best, but over time I refined my ideas on how the PT could be concluded with a stronger, more compelling final chapter. Technical/quality issues with my early drafts led me to fanedit.org where I found the expertise and assistance needed to resolve the challenges I was facing. \r\n\r\nBy that time however I'd come to understand just how much could be achieved with fanediting. No longer could I be satisfied Mike Nichols' releases. I realized that these movies could be cut deeper, that more nuance could be applied within scenes to change tone and improve dialog, which improves character and audience reaction. With that in mind, and with a clear end-point of how the entire Prequel Trilogy would be concluded, I postponed re-working my Episode III edit and turned my eye to the full Trilogy. \r\n\r\nWith this new purpose I sat down and created three overal priorities or goals for each edit.\r\n1) Improve the story told within the film itself as much as possible, making the characters more likable/interesting, and making the plot more engaging and enjoyable.\r\n2) Manipulate character improvements so as to create a more fertile backdrop for Episode III. With improvements that I had planned for Episode III I realized that I could maximize their impact by altering the audience's perceptions fo the characters, so Shadow of the Sith and The Republic Divided both seek help the audience invest in the characters so that the dramatic events of the final chapter are more meaningful, and then carry more importance when watching the Original Trilogy\r\n3) Modify/remove aspects introduced in the Prequels that I don't feel match with the Original Trilogy. In the L8wrtr trilogy there are no midichlorians, Darth is not a Sith title and will not be heard until Vader is Knighted in Episode III, and R2 never, ever flies.\r\n\r\nThis edit was originally released in July 2010 in standard definition using Adywan's color corrected theatrical construction as the foundation. In 2012, armed with the BluRay saga I completely re-edited Shadow of the Sith from the ground-up. This new version allowed me to fix several audio problems from the original release (the LFE channel didn't work properly) as well as apply more refined editing techniques that I have learned along the way, as well as make massive improvements on the quality of the deleted scenes used (though they still stand-out against the theatrical footage)\r\n\r\nSpecial Thanks:\r\nSpecial thanks for invaluable help with the initial release: Hebrides helped color correct the deleted footage to match Adywan's work as much as possible, TV's Frink provided excellent guidance and ideas which helped refine/focus my approach to my first edit, Remixed by Jorge unwittingly became a first-class mentor and technical guru and lastly, a huge thank you to The Man Behind the Mask for rejecting my first submission. His detailed notes and made this a better fanedit, and made me a better faneditor.\r\n\r\nWith the 2012 remaster, special thanks to Q2 for guidance on working in HD and up-converting standard def material, and NJVC for graciously volunteering to create the beautiful menus for the BD disks, which then became the basis for the standard def releases as well.\r\n\r\nRelease Information\r\n* NTSC DVD-5\r\n* NTSC DVD-9\r\n* AVCHD (DVD-9)\r\n* Blu-Ray (BD-25)\r\n\r\nSpecial Features\r\n* Deleted Scenes - BD &amp; DVD9\r\n* Commentary track - All formats\r\n* Alternate Audio track (Traditional ending music) - All formats\r\n \nhttp://fanedit.org/ifdb/component/content/article/79-fanedit-listings/fanfix/74-sots","torrent":{"xt":"urn:btih:146906733909424dd85acf70c4a7e8a3db637922","amp;dn":"Star+Wars%3A+Episode+I+-+Shadow+of+the+Sith+%28L8wrtr+Fanedit%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"146906733909424dd85acf70c4a7e8a3db637922","infoHashBuffer":{"type":"Buffer","data":[20,105,6,115,57,9,66,77,216,90,207,112,196,167,232,163,219,99,121,34]},"announce":[],"urlList":[]}}