{"title":"Cristoforo Colombo S01e01-26 Webrip completa -","uid":13189126,"size":3659567832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:161b5405e4b3a80a95b46d70ed1f1fc4dade6716&amp;dn=Cristoforo+Colombo+S01e01-26+Webrip+completa+-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"foll01","files":26,"time":1452419383,"description":"Cristoforo Colombo S01e01-26, [H264 - Ita Aac] Webrip completa -master- canale ufficiale mondo tv-\r\n\r\n\r\nTRAMA\r\n\r\nIl giovane Cristoforo Colombo ha un sogno, andare per mare con una nave, ma il padre Domenico ostacola il progetto del figlio, perché vuole che il ragazzo prosegua il suo lavoro di tessitore, per prendere un giorno il suo posto. Ma Cristoforo, con la sua determinazione, riuscirà a convincere il padre che, alla fine, lascerà che il figlio segua la strada che desidera.\r\n\r\n\r\n\r\nIniziano qui le avventure per mare di Cristoforo, che s'imbarca su varie navi, viene assalito dai corsari e fa naufragio al largo del Portogallo. Dopo questa disavventura, Colombo decide d'imparare il più possibile sull'arte della navigazione, e va a Lisbona ad aiutare il fratello minore Bartolomeo, che si guadagna da vivere come cartografo, e a frequentare la locale Scuola di Navigazione.\r\n\r\nFinalmente al ragazzo viene offerto il posto di primo ufficiale, su una nave diretta in Groenlandia. Qui Colombo sente per la prima volta la leggenda di un'antica nave vichinga, che aveva raggiunto una terra lontana. Questo è l'embrione del pensiero che, in seguito, spingerà Colombo a presentare, senza successo, al re del Portogallo il progetto di un viaggio per raggiungere le Indie da occidente.\r\n\r\nIn seguito, ripresenterà il progetto ai reali di Spagna, che, dopo lunghe consultazioni con gli esperti, decideranno di finanziare la spedizione. Colombo, quindi, riuscirà ad ottenere le navi per intraprendere il suo lungo viaggio verso quella scoperta che avrebbe cambiato il mondo per sempre \r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=391194","torrent":{"xt":"urn:btih:161b5405e4b3a80a95b46d70ed1f1fc4dade6716","amp;dn":"Cristoforo+Colombo+S01e01-26+Webrip+completa+-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"161b5405e4b3a80a95b46d70ed1f1fc4dade6716","infoHashBuffer":{"type":"Buffer","data":[22,27,84,5,228,179,168,10,149,180,109,112,237,31,31,196,218,222,103,22]},"announce":[],"urlList":[]}}