{"title":"Git and GitHub LiveLessons (Workshop) [FLV]","uid":13354922,"size":2879161188,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:175a8497a17f4ca8070be51a4642bf31a43f3ab5&amp;dn=Git+and+GitHub+LiveLessons+%28Workshop%29+%5BFLV%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"bey0nd","files":81,"time":1454110647,"description":"Git and GitHub LiveLessons (Workshop) is a fast-paced, engaging video course that teaches developers the essentials of Git and GitHub. You will learn the key commands to quickly become productive using Git and best practices for using GitHub to collaborate with your team.\r\n\r\nDescription\r\n\r\nFeaturing live, step-by-step demonstrations, the lessons in this workshop cover:\r\n\r\n    Concise configurations-configuring just what you need to get the best out of Git\r\n    Your first repo-initializing a repo, three stage thinking, working with the staging area\r\n    Sharing your work-creating and configuring a GitHub repository\r\n    Additional activities-moving, deleting and ignoring files with Git\r\n    Building with branches-how to use feature branches effectively to work on projects. Includes merge types, merge conflicts and rebasing before merging\r\n    GitHub workflows-using clones, forks, feature branches and pull requests to collaborate effectively via GitHub\r\n    Releasing software-release tags, release branches and release workflows\r\n    How to undo anything-learn a range of powerful techniques, from git commit -amend through revert, reset, rebase -interactive and the famed reflog!\r\n\r\nAbout the Instructor\r\n\r\nPeter Bell is a contract member of the GitHub training team and presents internationally on using Git and GitHub effectively. He's also the co-founder of CTO School and the startup CTO Summit and is the author of Git Distilled, to be published by Pearson in late 2014.\r\n\r\nSkill Level\r\n\r\n    Beginner\r\n    Intermediate\r\n\r\nWhat You Will Learn\r\n\r\n    Starting with creating your first Git repository and committing code, you learn the key concepts and features that will allow you to quickly set up and use Git for your own projects\r\n    You are introduced to branching and learn how to merge a branch, create a fast forward merge, and use recursive merges\r\n    You also learn how to collaborate via GitHub by cloning a repository, forking a repository, or contributing to a project via a pull request from a fork\r\n    In addition, you are introduced to the basics of Git internals to get a sense for how Git works under the hood.\r\n\r\nCourse Requirements\r\n\r\n    You will need to have an up-to-date version of Git installed on your computer and have a GitHub user account and password.\r\n    You should also be comfortable using a terminal window/command line.\r\n \nhttp://www.informit.com/store/git-and-github-livelessons-workshop-9780133991772","torrent":{"xt":"urn:btih:175a8497a17f4ca8070be51a4642bf31a43f3ab5","amp;dn":"Git+and+GitHub+LiveLessons+%28Workshop%29+%5BFLV%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175a8497a17f4ca8070be51a4642bf31a43f3ab5","infoHashBuffer":{"type":"Buffer","data":[23,90,132,151,161,127,76,168,7,11,229,26,70,66,191,49,164,63,58,181]},"announce":[],"urlList":[]}}