{"title":"Jogando com Prazer - Spread 2009","uid":13362442,"size":217355916,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d7ec869a9eab06db8066a54b23cd108519c73ca&amp;dn=Jogando+com+Prazer+-+Spread+2009+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Wagner_Smile","files":23,"time":1454139829,"description":"Para Nikki (Ashton Kutcher) a vida é um jogo bem simples: ou você é a caça ou o caçador. \r\nEle se considera um cara muito esperto e sabe que a beleza e juventude são suas melhores cartas. \r\nFreqüentando grandes festas nos melhores clubes e nas maiores mansões de Los Angeles, ele passa os dias e as noites aproveitando o melhor que a vida pode dar. \r\nCom Samantha (Anne Heche), sua última conquista, ele ganhou tudo que sempre sonhou. Porém, ao encontrar Heather (Margarita Levieva), uma sedutora garçonete, ele descobre que as regras do jogo acabaram de mudar e agora ele vai ter que decidir se vai querer continuar jogando.\r\n\r\nSet in modern day Los Angeles, Spread is a hard biting story about a high-end lothario, Nikki (Ashton Kutcher), who has slept his way into a life of privilege. He shares his secrets with us as he hosts parties and beds scores of women, all while living it up at the Hollywood Hills home of a middle-aged female attorney, Samantha (Anne Heche). Everything is going swimmingly until Nikki meets a gorgeous waitress named Heather (Margarita Levieva), who, unbeknownst to him, is playing the same game that he is. As the truth of their life unravels, they find themselves sexually charged by a game of one-upmanship that has them dining at fine restaurants and crashing posh parties, until the truth of their lives forces them to choose between love and money.\r\n\r\n\r\nTrilha sonora/Soundtrack\r\n\r\nJogando com prazer\r\nSpread 2009\r\n\r\nThe Duke Spirit - This ship was built to last\r\nAM - Mainstay (unsettled mix)\r\nBroken West - Down to the valley\r\nBumblebeez - DR. Love\r\nUnlão - Been so long\r\nThe Wings - Hot Bed\r\nKurt Hagardorn - Internation Travel Advisory\r\nKurt Hagardorn - Last Time Rewind*\r\nInvaudio - First Time*\r\nIsa &amp; The Filthy Tonguess - Big Star\r\nThe Wings - Right Hand On My Heart\r\nRumspringa - Shake'em loose tonight\r\nCarney - Think of you\r\nSwimmer One - But my heart is broken\r\nThe silver seas - MS. November\r\nSea Wolf - The garden that you planted\r\nThe Raveonettes - Ode To La\r\n\r\n*Músicas não encontradas até o presente momento (30~01~2016)\r\n*Songs not found to the present moment \r\n\r\nAos fãs dessa incrivel trilha sonora desse ótimo filme, vamos semear :)\r\nTo the fans os this aamzing sound trackof great movie, we will seed :)","torrent":{"xt":"urn:btih:1d7ec869a9eab06db8066a54b23cd108519c73ca","amp;dn":"Jogando+com+Prazer+-+Spread+2009+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7ec869a9eab06db8066a54b23cd108519c73ca","infoHashBuffer":{"type":"Buffer","data":[29,126,200,105,169,234,176,109,184,6,106,84,178,60,209,8,81,156,115,202]},"announce":[],"urlList":[]}}