{"title":"Sentinels of the Multiverse v1.6.2","uid":13184208,"size":336173807,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:1ebc0f7dd76b570c2ab84a6f742d0437bf841d51&amp;dn=Sentinels+of+the+Multiverse+v1.6.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":2,"time":1452358342,"description":"Calling all Sentinels! Do you have what it takes to defend the Multiverse? Compose a team of comic book heroes, each with their own playstyles, backstories, and grudges. Pit them against a variety of maniacal and formidable villains. Defeat your enemies and save the Multiverse!\r\n\r\nSentinels of the Multiverse is the award-winning game in which players join forces as heroes to combat a dastardly villain in a dynamic environment.\r\n\r\nThe digital version of Sentinels of the Multiverse plays like a comic book come to life! Control an entire team of heroes in single player, or head online and join heroes from around the globe in multiplayer. This is cooperative card-battle like you’ve never played before!\r\n\r\nThe rules of the game are deceptively simple: Play a Card, Use a Power, and Draw a Card. What makes Sentinels of the Multiverse unique is that each card has special abilities that can create powerful combos or even change the rules of the game!\r\n\r\nThis digital version includes all content from the Sentinels of the Multiverse core game:\r\n• 10 Heroes: Absolute Zero, Bunker, Fanatic, Haka, Legacy, Ra, Tachyon, Tempest, The Visionary, &amp; The Wraith\r\n• 4 Villains: Baron Blade, Citizen Dawn, Grand Warlord Voss, &amp; Omnitron\r\n• 4 Environments: Insula Primalis, Megalopolis, Ruins of Atlantis, &amp; Wagner Mars Base\r\n\r\nIt also includes several unlockable variant cards:\r\n• 9 variant heroes with alternate powers and backstory\r\n• 2 variant villains for an all new twist on the battle\r\n• Variants are unlockable via secret Sentinels storyline-based challenges!\r\n\r\nExpansion packs are available via In App Purchase:\r\n• Expansion Season Pass 1 includes the first 4 expansions and 3 mini-packs as they become available. Save money and get all the content!\r\n• Mini-Pack 1: Unity, Ambuscade, and Silver Gulch, 1883\r\n• Rook City: Expatriette, Mr. Fixer, The Chairman, The Matriarch, Plague Rat, Spite, Pike Industrial Complex, and Rook City\r\n• Infernal Relics: The Argent Adept, NightMist, Akash'Bhuta, Apostate, The Ennead, GloomWeaver, Realm of Discord, and Tomb of Anubis\r\n• Mini-Pack 2: The Scholar, Miss Information, and The Final Wasteland.\r\n• Unlock more variants for expansion pack content!\r\n\r\nEvery rule &amp; interaction in the game has been carefully adapted and thoroughly tested by expert Sentinels players, as well as the designer himself. If you’re wondering how a certain situation works in SotM, this game is the ultimate rules lawyer!\r\n\r\nFeatures:\r\n• Original music brings the Multiverse to life like you’ve never heard before. Rock out to the official Sentinels Theme Song, ambient tracks for each environment, and ending themes for each villain.\r\n• Beautifully rendered environment backdrops put you right in the action.\r\n• Brand new artwork for every Hero and Villain in the game, created by SotM artist Adam Rebottaro himself.\r\n• Over 9,000 different potential battles to choose from.\r\n• Play a solo game with 3 to 5 heroes or pass &amp; play with your friends.\r\n• Cross-platform online multiplayer with friends and others from around the world.\r\n\r\nSotM is compatible with Android tablets with NEON CPU support. Older tablets with Tegra 2 CPUs are not compatible.\r\n\r\nWhat's New:\r\n\r\nBuild a prized collection of Sentinel Comics by participating in the Weekly One-Shot! A new scenario will be posted once a week. Watch out for thematic storyline battles, diabolical challenges, or just plain interesting teamups.\r\nThis hotfix update fixes some issues with Weekly One-Shot multiplayer game setup.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.handelabra.Sentinels\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.handelabra.Sentinels' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:1ebc0f7dd76b570c2ab84a6f742d0437bf841d51","amp;dn":"Sentinels+of+the+Multiverse+v1.6.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ebc0f7dd76b570c2ab84a6f742d0437bf841d51","infoHashBuffer":{"type":"Buffer","data":[30,188,15,125,215,107,87,12,42,184,74,111,116,45,4,55,191,132,29,81]},"announce":[],"urlList":[]}}