{"title":"The Incredible Adventures of Van Helsing Final Cut V2 - CorePack","uid":14963271,"size":8352670621,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:21e0af2e38a39ffd722856b45852f0d7d8e2c41f&amp;dn=The+Incredible+Adventures+of+Van+Helsing+Final+Cut+V2+-+CorePack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Palash995","files":6,"time":1466166846,"description":"[center][b][img]http://cdn.akamai.steamstatic.com/steam/apps/400170/ss_5fd20851cf21b8813c03ebf4fb050cec81b88a96.600x338.jpg[/img]\r\n\r\n[color=red][i]The Incredible Adventures of Van Helsing: Final Cut V2[/i][/color]\r\n\r\n[i][color=purple]Without Any reason..Don't Dislike the torrent.....please check and then give your feedback. [/color][/i]\r\n\r\n[img]https://i.imgur.com/DN9Qt3Q.png[/img]\r\n\r\n[color=green]Grab your weapons and embark on an incredible adventure in the gothic-noir world of Borgovia, where mad science threatens the peace between monsters and mortals. Save the day with your charming companion, Lady Katarina (who happens to be a ghost). Explore the wilderness and the grim districts of a metropolis twisted by weird science, and don’t forget: you might never know who the real monsters are! The Incredible Adventures of Van Helsing: Final Cut is the definite collection of three stand-alone episodes told as one continuous story, with six playable classes and a new endgame mode with a huge variety of open missions! \r\n\r\nMain features \r\n\r\nEnter a memorable gothic-noir universe – Explore Borgovia, the land of monsters, magic and weird science. \r\nOver 50 hours gameplay in the campaign – Play through a refreshingly unique story, spiced up with wry humor and snappy dialogue. \r\nSpecialists needed! – Choose from six playable classes, each of them a specialist of the monster-hunting profession. Defeat your foes with steel and gun, master the art of weird science or take control over the forces of magic and shadows. \r\nHuge variety of skills – The huge and complex skill tree, unique to each class, gives you a vast range of opportunities to make good use of your chosen class. \r\nAction-packed adventures – Fight fierce battles against supernatural foes with diverse skills and abilities. \r\nRage system – You can charge up to three skill modifiers called PowerUps by spending Rage points collected from impressive feats. \r\nLady Katarina – Use the special abilities and tailor the skills of your remarkable follower. \r\nHunter’s Lair – Build and develop your hideout to stash collected loot, trade with non-playable characters, teleport between locations and forge new items. \r\nTower defense mini-game – With enemies invading in waves, you have the opportunity to defend your Lair and other strategic locations with deployable traps and several upgradable functions to ward off evil. \r\nNew level cap – Reach level 100 and evolve further in the endgame featuring a Glory system, rare items and two types of unique endgame currency. \r\nScenarios – Play scenario maps with randomly generated terrains, monsters, objectives and special conditions. \r\nNever a dull day in Borgovia – Try the daily quests, challenges and weekly events that will give you new missions and long hours of entertainment after the campaign. \r\nMultiplayer – Become the greatest monster slayer of all time while playing in one of the cooperative or PvP multiplayer modes (4-player co-op mode, Touchdown, Arena or Battle Royal).\r\n\r\nMINIMUM: \r\nOS: Windows XP SP3, Windows 7, Windows 8 \r\nProcessor: Dual Core CPU 2.0 GHz \r\nMemory: 2 GB RAM \r\nGraphics: GeForce 8800, Radeon HD4000, Intel HD4000 (min. 512 MB VRAM) \r\nDirectX: Version 9.0 \r\nNetwork: Broadband Internet connection \r\nStorage: 40 GB available space \r\nSound Card: DirectX 9.0c compatible sound card.[/color]\r\n\r\n[img]http://i1231.photobucket.com/albums/ee501/Indo_Hd/bcedgfhk.gif[/img]\r\n\r\n[i][b][color=orange]Screenshots-:[/color][/b][/i]\r\n\r\n[img]http://cdn.akamai.steamstatic.com/steam/apps/400170/ss_5fd20851cf21b8813c03ebf4fb050cec81b88a96.600x338.jpg[/img]\r\n\r\n[img]http://cdn.akamai.steamstatic.com/steam/apps/400170/ss_0a0a208cb385d4bd5649586fffba52ee4856ea82.600x338.jpg[/img]\r\n\r\n[img]http://i1231.photobucket.com/albums/ee501/Indo_Hd/bcedgfhk.gif[/img]\r\n\r\n[img]http://i.imgur.com/DgpeTWf.gif[/img]\r\n[color=blue][b]Release Notes:- I aM trying to do MY best... so If you want to thank ME..Just Seed MY torrents and do comments on MY uploads...[/b].[/color]\r\n[img]http://i.imgur.com/DgpeTWf.gif[/img]\r\n\r\n[img]http://yuq.me/users/22/474/5Ue4vgtzn2.png[/img]\r\n\r\n[img]http://i.imgur.com/W3abX.gif[/img]\r\n\r\n[img]http://img607.imageshack.us/img607/8831/q9e4.png[/img]\r\n\r\n[img]http://img163.imageshack.us/img163/2315/zfx.gif[/img][/b][/center]","torrent":{"xt":"urn:btih:21e0af2e38a39ffd722856b45852f0d7d8e2c41f","amp;dn":"The+Incredible+Adventures+of+Van+Helsing+Final+Cut+V2+-+CorePack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e0af2e38a39ffd722856b45852f0d7d8e2c41f","infoHashBuffer":{"type":"Buffer","data":[33,224,175,46,56,163,159,253,114,40,86,180,88,82,240,215,216,226,196,31]},"announce":[],"urlList":[]}}