{"title":"Windows.Firewall.Control.4.7.4.0","uid":14728130,"size":460060,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:25e52fcac2ea3e7a4c4d4d34550d280cf793c014&amp;dn=Windows.Firewall.Control.4.7.4.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":5,"time":1464568404,"description":"https://extraimago.com/images/2016/05/29/lnMaIQLcF3.png\r\n\r\nWindows.Firewall.Control.4.7.4.0\r\n\r\nWindows Firewall Control – is a nifty little application which extends the functionality of the Windows Firewall and provides quick access to the most frequent options of Windows Firewall. It runs in the system tray and allows user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click. It is free to use, registered users will get the advantage of learning mode which provides notifications for outgoing blocked connections. This is the best tool to manage the native firewall from Windows 8, Windows 7 and Windows Vista. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click.\r\n\r\nLow Filtering – Outgoing connections that do not match a rule are allowed. You can block the programs you do not want to initiate outgoing connections.\r\nMedium Filtering – Outgoing connections that do not match a rule are blocked. Only programs you allow can initiate outgoing connections.\r\nHigh Filtering – All outgoing connections are blocked. This setting blocks all attempts to connect to and from your computer.\r\nNo Filtering – Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer.\r\n\r\nFeatures\r\n• Just one small executable file. All features are packed in the same file.\r\n• Full support for executing tasks from standard user accounts.\r\n• Intuitive and easy accessible interface in the system tray.\r\n• Allow or block a program to connect to the internet with just one mouse click.\r\n• Shell integration into the right click context menu of the executable files.\r\n• Search for invalid rules with the possibility to delete them.\r\n• Quick access to edit Windows Firewall rules directly from the program interface.\r\n• Choose if you want the program to start at user logon.\r\n• Import and export the policy of the program.\r\n• Protection to unauthorized uninstallation.\r\n• Possibility to restore previous settings at uninstallation.\r\n• Check for a new version from the program interface.\r\n• And many more… Just give it a try.\r\n\r\nRegistered Users Features:\r\n• Learning Mode which provides notifications for blocked outgoing connections.\r\n• Search for executable files in a user defined folder and create new rules for the selected ones from the result list","torrent":{"xt":"urn:btih:25e52fcac2ea3e7a4c4d4d34550d280cf793c014","amp;dn":"Windows.Firewall.Control.4.7.4.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25e52fcac2ea3e7a4c4d4d34550d280cf793c014","infoHashBuffer":{"type":"Buffer","data":[37,229,47,202,194,234,62,122,76,77,77,52,85,13,40,12,247,147,192,20]},"announce":[],"urlList":[]}}