{"title":"Castle Wolfenstein with all modes","uid":13191530,"size":2797727744,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:261fe4c3a2f86cde2e42a04eb9fac2abff619f0e&amp;dn=+Castle+Wolfenstein+with+all+modes+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kris3000","files":1,"time":1452443318,"description":"'Return To Castle Wolfenstein' - The Nazis aspire to rule over the world with the help of occult sciences and inhuman attempts by doctors killers. You, the American Ranger. Stay task before you return to the castle and interrupt the treacherous plans of the Nazis led by Hitler Reichsfuehrer. Destroy evil. The failure of the operation is inadmissible. If Hitler's plan succeeds, the war for the Allies ended the war ended ... and the whole world. \r\n\r\n\r\n'Operation Trondheim 1 - Special Forces' - the first part of the trilogy Operation Trondheim. German troops occupied Norway Trondheim port where located very important military object - radar that covers the northern seas ... So allied forces found themselves without help from the north: the Germans are destroyed all convoys with reinforcements . Your task is to destroy at any cost radar and wait until the sending of the main forces of the Allies. The failure of the operation is inadmissible! \r\n\r\n\r\n'Operation Trondheim 2 - Red alert' - this time you play you are going to face a Soviet soldier of the Soviet troops, who sent in Trondheim port for receiving a particularly important source ... Who would have guessed that in this group there a man who will change the course of the war, and most importantly that this man is Russian, most ordinary kolkhoz, which was implemented in the intelligence of the USSR. Go through the 10 cards in the fascinating history of the young scout turned everything upside down! \r\n\r\n\r\n'Operation Trondheim 3 - Iron Cross' - June 23, 1941 the Norwegian coast was sent to the English invasion, the purpose of which is to take over the port Trondheim - strategic object crucial available. The value of the port is a locator, thanks to which the German counter-intelligence intercepts all traffic to the Allies in the North Sea. The situation is exacerbated in the evening of June 24 when about gate appeared unexpected guests: spec-troops of the Soviet Army, a small squad of thugs with only task-find code-ciphers at any cost even if their way stand allies. The growing conflict between the three forces-Russians, Germans and British single ever in the history of World War II! This is the concluding third part of the trilogy Operation Trondheim! Play and enjoy the game from the face of Adam Steck, who played a crucial role in fighting for the port Trondheim! \r\n\r\n\r\n'Return To Castle Wolfenstein - Project 51'- officially addition to everyone's favorite Castle Wolfenstein Estonian team of developers from MapCenter! During World War II, German engineers developed a new weapon that can radically alter the course of the war. British intelligence decided to send a saboteur with the task to terminate the plans of the Germans ... \r\n\r\n\r\n'Return To Castle Wolfenstein - Time Gate' - Secret trials esmints Eldridge in 1944-it was not the last. Similar tests for moving the army in time and space, conducting and German command in the old catacombs Castle Wolfenstein. In 1945, scientists of Nazi Germany managed to force the door of time to work and started intensive secret trials. Hitler received confirmation that he is able to transfer forces in time and space in order to change the course of the war. You accidentally witnessing these events. You now have only one choice, to stay alive, picking his way up arms towards the door in an unequal battle with the wars of SS. This is an excellent continuation of the legendary game Return to Castle Wolfenstein - prepare yourselves for a real war! \r\n\r\n'Return To Castle Wolfenstein - Stalingrad' - the battle for Stalingrad appears to be one of the most complex and bloody during World War II. You alone must complete several missions to help protect the city and closer to victory over Fascist Germany. \r\n\r\n\r\nSystem Requirements:OS Windows 98SE/2000/XP;Pentium III 750Mhz;256 Mb;32Mb DirectX8-video card.;DirectX8-sound card","torrent":{"xt":"urn:btih:261fe4c3a2f86cde2e42a04eb9fac2abff619f0e","amp;dn":"+Castle+Wolfenstein+with+all+modes+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"261fe4c3a2f86cde2e42a04eb9fac2abff619f0e","infoHashBuffer":{"type":"Buffer","data":[38,31,228,195,162,248,108,222,46,66,160,78,185,250,194,171,255,97,159,14]},"announce":[],"urlList":[]}}