{"title":"The Taiwan Crisis - A Showcase of the Global Arsenic Problem","uid":15103343,"size":6839738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2649e38a3d7a2a6300d47e164c1cabfcddf59fca&amp;dn=The+Taiwan+Crisis+-+A+Showcase+of+the+Global+Arsenic+Problem&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1466970176,"description":"The Taiwan Crisis - A Showcase of the Global Arsenic Problem - J.S. Jean et al. (CRC, 2010).pdf\r\n\r\nISBN 978-0-415-58510-1\r\n\r\nIn the 1950s, the residents of the southwestern coastal areas of Taiwan suffered greatly from Blackfoot disease (BFD) due to the consumption of arsenic-contaminated groundwater. Groundwater with high levels of arsenic in southwestern and northeastern Taiwan received much attention. After arsenic-safe tap water was utilized for drinking instead of groundwater in the 1970s, BFD cases decreased greatly. After 1990, no new BFD cases were reported, and as a consequence, BFD problems disregarded. However, arsenic is still present in the groundwater.\r\nThis book will improve the knowledge and understanding of the occurrence and genesis of arsenic-rich groundwaters in Taiwan. It deals with constraints on the mobility of arsenic in groundwater, its uptake from soil and water by plants, arsenic-propagation through the food chain, human health impacts, and arsenic-removal technologies. Taiwan case experiences are described in this book and can be applied worldwide.\r\n\r\nThis book is a state-of-the-art overview of research on arsenic in Taiwan and is designed to:\r\n\r\ncreate interest in regions within Taiwan that are affected by the presence of arseniferous aquifers;\r\ndraw attention from the international scientific community;\r\nincrease awareness among researchers, administrators, policy makers, and company executives;\r\nimprove the international cooperation on arsenic problems worldwide","torrent":{"xt":"urn:btih:2649e38a3d7a2a6300d47e164c1cabfcddf59fca","amp;dn":"The+Taiwan+Crisis+-+A+Showcase+of+the+Global+Arsenic+Problem","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2649e38a3d7a2a6300d47e164c1cabfcddf59fca","infoHashBuffer":{"type":"Buffer","data":[38,73,227,138,61,122,42,99,0,212,126,22,76,28,171,252,221,245,159,202]},"announce":[],"urlList":[]}}