{"title":"Young And Corrupt 2 (Brazzers) [2015 y., DVDRip]","uid":13378413,"size":1874223464,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2738f22900f9f1946429bd4f6c642eda56b0f0ae&amp;dn=Young+And+Corrupt+2+%28Brazzers%29+%5B2015+y.%2C+DVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1454241646,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/FbF\r\n \nhttp://imgsnaps.com/image/FbG\r\n\r\n\r\nPlot:\r\n\r\nYear: 2015\r\nCountry: USA\r\nGenre: 18+ Teens, All Sex, Big Dicks\r\nDuration: 2:59:42\r\nEnglish language\r\nStudio: Brazzers\r\n\r\nCast: August Ames, Chloe Addison, Gianna Nicole, Marina Visconti, Scarlet Red, Teanna Trump.\r\n\r\nDescription:\r\n\r\nCrime Pays In Pussy\r\n\r\nScarlet Red is a bratty teen slut who has no respect for her cop father. When he gets a call from dispatch, he heads off to find the crook in question leaving her all by herself with the car. The criminal Johnny Sins finds Scarlet before her cop dad finds him and that teen slut has always been a sucker for dangerous men.\r\n\r\nSucked Straight\r\n\r\nAugust Ames is a troubled teen and her parents have just about had it with her slutty shenanigans. They decided to send her to a scared straight program to try and get her to shape up, but as soon as August lays eyes on the big bulge in inmate Keiran Lee's prison blues, it's clear that they've made a huge cock-shaped mistake .\r\n\r\nStudy, Suck, Fuck\r\n\r\nChloe Addison was studying in the library when she was struck by a serious big cock craving, until she got to Jessy Jones, that is. As soon as she felt the size of that cock hidden underneath his jeans, she knew that he had the big dick she had been waiting for.\r\n\r\nCock-Sticks\r\n\r\nGianna Nicole is a bratty teen slut whose parents have been trying to get her to apply herself to something for ages. They hire Johnny Sins, a private tutor to help Gianna learn piano. As soon as Johnny gets there, Gianna takes one look at that fat dick and snaps to attention, stroking, sucking, and fucking.\r\n\r\nVlogging and Flogging\r\n\r\nDanny D's sister has a Russian exchange student at their place, a busty babe named Marina Visconti, and Danny is determined to use this chance to test out his theory that all foreign girls are wild about dick. She heads down to Danny's room in the basement and straight up tells him that she wants his dick!","torrent":{"xt":"urn:btih:2738f22900f9f1946429bd4f6c642eda56b0f0ae","amp;dn":"Young+And+Corrupt+2+%28Brazzers%29+%5B2015+y.%2C+DVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2738f22900f9f1946429bd4f6c642eda56b0f0ae","infoHashBuffer":{"type":"Buffer","data":[39,56,242,41,0,249,241,148,100,41,189,79,108,100,46,218,86,176,240,174]},"announce":[],"urlList":[]}}