{"title":"Reactions and Mechanisms in Thermal Analysis of Advanced Materia","uid":15084922,"size":38723978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:278c43f4aa7528e9e5aabdd469ab8476929275bc&amp;dn=Reactions+and+Mechanisms+in+Thermal+Analysis+of+Advanced+Materia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1466877959,"description":"Reactions and Mechanisms in Thermal Analysis of Advanced Materials - Atul Tiwari, Baldev Raj (Wiley-Scrivener, 2015).pdf\r\n\r\nISBN 978-1-119-11757-5\r\n\r\nStrong bonds form stronger materials. For this reason, the investigation on thermal degradation of materials is a significantly important area in research and development activities. The analysis of thermal stability can be used to assess the behavior of materials in the aggressive environmental conditions, which in turn provides valuable information about the service life span of the materiel.\r\n\r\nUnlike other books published so far that have focused on either the fundamentals of thermal analysis or the degradation pattern of the materials, this book is specifically on the mechanism of degradation of materials.\r\n\r\nThe mechanism of rapturing of chemical bonds as a result of exposure to high-temperature environment is difficult to study and resulting mechanistic pathway hard to establish. Limited information is available on this subject in the published literatures and difficult to excavate.\r\n\r\nChapters in this book are contributed by the experts working on thermal degradation and analysis of the wide variety of advanced and traditional materials. Each chapter discusses the material, its possible application, behavior of chemical entities when exposed to high-temperature environment and mode and the mechanistic route of its decomposition. Such information is crucial while selecting the chemical ingredients during the synthesis or development of new materials technology","torrent":{"xt":"urn:btih:278c43f4aa7528e9e5aabdd469ab8476929275bc","amp;dn":"Reactions+and+Mechanisms+in+Thermal+Analysis+of+Advanced+Materia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"278c43f4aa7528e9e5aabdd469ab8476929275bc","infoHashBuffer":{"type":"Buffer","data":[39,140,67,244,170,117,40,233,229,170,189,212,105,171,132,118,146,146,117,188]},"announce":[],"urlList":[]}}