{"title":"Inherent Safety at Chemical Sites","uid":14714258,"size":4665371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2acb90382540e51887f9c797b5852a1557dce99f&amp;dn=Inherent+Safety+at+Chemical+Sites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1464446642,"description":"Inherent Safety at Chemical Sites - Paul T. Anastas, David G. Hammond (Elsevier, 2016).pdf\r\n\r\nISBN 978-0-12-804190-1\r\n\r\nInherent Safety at Chemical Sites: Reducing Vulnerability to Accidents and Terrorism Through Green Chemistry highlights the use of green chemistry principles to identify and address serious threats and potential consequences caused by accidental and deliberate industrial chemical releases. Through valuable case studies, the book suggests wholesale replacements of hazardous chemicals with benign and inherently safer, or &quot;greener,&quot; materials. More than physical security barriers and plans, such preventative measures better guarantee the safety of industrial employees and nearby residents.\r\n\r\nThis valuable primer begins with an introduction to the concepts of green chemistry and outlines the various ways that a green approach to chemical design, production, and management is not only good for the planet, but also serves to protect people and infrastructure from terrorist acts. Specific examples and case studies are cited to illustrate what has been done to advance this cause, and offer guidance to those decision-makers who similarly aspire to greater safety and security for the people and resources they manage.\r\n\r\n\r\nAddresses security at chemical plants, manufacturers, water utilities and other facilities utilizing and storing hazardous chemical\r\nProvides practical suggestions and insightful case studies for green chemistry innovations from replacement processes and new technologies\r\nCovers multiple important chemicals and categories, including: Chlorine, Hydrogen cyanide, Hydrogen fluoride (hydrofluoric acid), Phosgene, Sulfur Dioxide, Sulfuric Acid, Ammonia, Benzene, Pesticides, and cleaning technologies","torrent":{"xt":"urn:btih:2acb90382540e51887f9c797b5852a1557dce99f","amp;dn":"Inherent+Safety+at+Chemical+Sites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2acb90382540e51887f9c797b5852a1557dce99f","infoHashBuffer":{"type":"Buffer","data":[42,203,144,56,37,64,229,24,135,249,199,151,181,133,42,21,87,220,233,159]},"announce":[],"urlList":[]}}