{"title":"Dragons Dogma Dark Arisen RePack by SEYTER","uid":13186530,"size":6263153977,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2db4f61cd2f9b15a4a38c99ed5e45ab1bf1915df&amp;dn=Dragons+Dogma+Dark+Arisen+RePack+by+SEYTER&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mercs215","files":10,"time":1452386210,"description":"Install instructions:\r\n- Run &quot;setup.exe&quot; \r\n- Play\r\n\r\nTitle: Dragon's Dogma: Dark Arisen\r\nGenre: Action, Adventure, RPG\r\nDeveloper: Capcom \r\nPublisher: Capcom\t\r\nRelease Date: Jan 15, 2016\r\n\r\nAbout This Game:\r\nSet in a huge open world, Dragon’s Dogma: Dark Arisen presents a rewarding action combat experience. Players embark on an epic adventure in a rich, living world with three AI companions, known as Pawns. These partners fight independently, demonstrating prowess and ability that they have developed based on traits learned from each player. PC users can share these Pawns online and reap rewards of treasure, tips and strategy hints for taking down the terrifying enemies. Pawns can also be borrowed when specific skills are needed to complete various challenging quests.\r\n\r\nFeatures\r\nDynamic combat experience – Cut off the four heads of a Hydra, climb atop griffins and fight airborne, or defeat dragons and other creatures by finding out their weaknesses. \r\nTons of content – Includes all previously released DLCs, pre-order bonuses, retailer-exclusives, and the Dark Arisen expansion content. Features the highly praised combat experience and rich customization, plus a huge underground realm to explore with terrifying monsters. \r\nCustomization options galore – Nine different vocations for players to choose from with a variety of skill options for each, armor that can be upgraded and enhanced, plus Pawn companions that can be trained to fit your desired combat style. \r\nStunning visuals – Beautiful high res graphics with increased fidelity. \r\nFull Steam platform support – Includes Steam Achievements, Steam Cloud Save, Trading Cards, Leaderboards, Big Picture Mode support \r\nExpanded controller support – In addition to supporting the traditional keyboard and mouse control scheme, the game natively supports Xbox 360, Xbox One, Steam Controller, and other DirectInput-based game pads such as the DualShock controller. \r\nNew Achievements - 9 brand new Achievements for both new and returning Dragon’s Dogma fans! Get ready to delve deep into Bitterblack Isle…\r\n\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Windows Vista or newer \r\nProcessor: Intel Core i5 660 CPU or equivalent \r\nMemory: 4 GB RAM \r\nGraphics: Radeon HD 5870 or equivalent \r\nDirectX: Version 9.0c \r\nNetwork: Broadband Internet connection \r\nStorage: 20 GB available space \r\n\r\nRECOMMENDED: \r\nOS: Windows Vista or newer \r\nProcessor: Intel Core i7-4770K or equivalent \r\nMemory: 8 GB RAM \r\nGraphics: NVIDIA GeForce GTX 760 or equivalent \r\nDirectX: Version 9.0c \r\nNetwork: Broadband Internet connection \r\nStorage: 20 GB available space","torrent":{"xt":"urn:btih:2db4f61cd2f9b15a4a38c99ed5e45ab1bf1915df","amp;dn":"Dragons+Dogma+Dark+Arisen+RePack+by+SEYTER","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db4f61cd2f9b15a4a38c99ed5e45ab1bf1915df","infoHashBuffer":{"type":"Buffer","data":[45,180,246,28,210,249,177,90,74,56,201,158,213,228,90,177,191,25,21,223]},"announce":[],"urlList":[]}}