{"title":"Wax Deposition - H. Scott Fogler et al.","uid":14717753,"size":6731848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e3217cb6b4424170928d65256bcac8e19d7945f&amp;dn=Wax+Deposition+-+H.+Scott+Fogler+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1464483655,"description":"Wax Deposition - H. Scott Fogler et al. (CRC, 2015).pdf\r\n\r\nISBN 978-1-4665-6767-2\r\n\r\nWax Deposition: Experimental Characterizations, Theoretical Modeling, and Field Practices covers the entire spectrum of knowledge on wax deposition. The book delivers a detailed description of the thermodynamic and transport theories for wax deposition modeling as well as a comprehensive review of laboratory testing for the establishment of appropriate field control strategies.\r\n\r\nOffering valuable insight from academic research and the flow assurance industry, this balanced text:\r\n\r\nDiscusses the background of wax deposition, including the cause of the phenomenon, the magnitude of the problem, and its impact on petroleum production\r\nIntroduces laboratory techniques and theoretical models to measure and predict key parameters of wax precipitation, such as the wax appearance temperature and the wax precipitation curve\r\nExplains how to conduct and interpret laboratory experiments to benchmark different wax deposition models, to better understand wax deposition behaviors, and to predict wax deposit growth for the field\r\nPresents various models for wax deposition, analyzing the advantages and disadvantages of each and evaluating the differences between the assumptions used\r\nProvides numerous examples of how field management strategies for wax deposition can be established based on laboratory testing and modeling work\r\n\r\nWax Deposition: Experimental Characterizations, Theoretical Modeling, and Field aids flow assurance engineers in identifying the severity and controlling the problem of wax deposition. The book also shows students and researchers how fundamental principles of thermodynamics, heat, and mass transfer can be applied to solve a problem common to the petroleum industry","torrent":{"xt":"urn:btih:2e3217cb6b4424170928d65256bcac8e19d7945f","amp;dn":"Wax+Deposition+-+H.+Scott+Fogler+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e3217cb6b4424170928d65256bcac8e19d7945f","infoHashBuffer":{"type":"Buffer","data":[46,50,23,203,107,68,36,23,9,40,214,82,86,188,172,142,25,215,148,95]},"announce":[],"urlList":[]}}