{"title":"Diabolical Women - Season 1","uid":13254056,"size":1004922130,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2e47b9940970294fc31d2ba8f29b8cf72c73458a&amp;dn=Diabolical+Women+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bullrout","files":3,"time":1453205897,"description":"Diabolical Women - Season 1\r\n\r\nFrom the producers of Deadly Wives comes a new series that will take us into the minds of deviously clever women who used their smarts to devise elaborate schemes of crime and murder. Diabolical Women will explore the twisted ingenuity of these women, who might have put their efforts into running a business, but instead methodically planned out extraordinary crimes in order to get what they wanted--power, control, money, etc.--no matter what--or who--they had to do away with to make it happen, including their feminine wiles. The series will also track the persistent and superior detective work it took to finally bring women--women who thought their cunning could outsmart the law--to justice. Told using cinematic recreations and first-person testimony, this series will interweave two roller-coaster stories of cunning and skill, simultaneously from the perspective of the mastermind murderess and the investigators.. And during our investigative journey, we'll explore the psychology of motive for a woman to pursue a mission of crime. Because it's easy to be deadly, but it takes skill to be diabolical","torrent":{"xt":"urn:btih:2e47b9940970294fc31d2ba8f29b8cf72c73458a","amp;dn":"Diabolical+Women+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e47b9940970294fc31d2ba8f29b8cf72c73458a","infoHashBuffer":{"type":"Buffer","data":[46,71,185,148,9,112,41,79,195,29,43,168,242,155,140,247,44,115,69,138]},"announce":[],"urlList":[]}}