{"title":"SubbyHubby - Maid To Order 1-7 720p 1080p","uid":13096558,"size":5346998168,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2eb28ee37200e782e42fe89b013cca13b7930078&amp;dn=SubbyHubby+-+Maid+To+Order+1-7+720p+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":7,"time":1451134050,"description":"\nRequested by @barrett799\r\n\r\nEnjoy :D\r\n\r\nSubby Hubby - Maid To Order Parts 1-7 Complete\r\n\r\n\r\n4x 1080p MP4s and 3x 720p MP4s.\r\n\r\n\r\nMaid To Order (Pt 1 Cuckolding)\r\n\r\n1080p MP4\r\n\r\nToby's parents have left for the weekend and ordered two Latin maids to take care of their obnoxious want to be rapper son. The maids are dressed in sexy skimpy uniforms and don't even speak English. He tells his friend Cameron he needs to come to his house cause there are two hot maids to take care of the house for the weekend and that they look like hookers. The maids will do everything he tells them to. The friend cannot believe it and jumps in his car and rushes over as fast as he can. As soon as Cameron arrives he snaps his fingers and the two maids enter the room. He instructs them to give him a massage which they do. Then he tells the two ladies to start kissing and make out with one another. They say, &quot;yes Mr. Toby&quot;. Girls start kissing and licking each other's breasts. The boys cannot believe their eyes and think what a weekend they're going to have. The ladies convince the boys to show them what equipment they're working with and talk them into dropping their pants revealing their tiny 2 inch dicks. The ladies begin to laugh. Toby gets extremely embarrassed and says &quot;it's cold in here, you ladies couldn't even handle this.&quot; Both ladies continue to laugh at their small penises.\r\n\r\nMaid To Order (Pt 2 Forced Bi BJ)\r\n\r\n1080p MP4\r\n\r\nNow that the maids have turned the tables on these boys and now have gained control they convince Toby and Cameron to suck each others cocks, telling them that this is what turns them on and if they want to have fun this weekend that they will have to get kinky so both boys blow each other than give each other hand jobs, Cameron can't control his cum and shoots a huge white milky load into Tobys hand the Sexy Maides tell Toby to eat it So he Does as the girls kiss and fondle each other...  \r\n\r\n\r\nMaid To Order (Pt 3 Dance Off)\r\n\r\n1080p MP4\r\n\r\nThe Maids have totally taken control over these pathetic young Sissy Sluts and now have the Boys crossdressed and wearing bright pink lipstick and then challenge them to see who has the better moves Mc toby breaks out some of his sissy boy dance moves and then Cameron feels he can do better and dies a few moves of his own then the sissy's have a dance off as the Maids continue to laugh at how sad and pathetic these losers really are after about 5 min of this the sexy maids tell them it's a tie and that they both have won a double headed dildo shoved right up their man pussy's So Bend over!\r\n\r\n\r\nScreens \nhttp://s18.postimg.org/xa89vj3cp/s6711_7maidtoordersmallpenis_mp4_thumbs_2015_12.jpg \nhttp://s18.postimg.org/gu4epjjjt/S6712_7maidtoorderforcedbj_mp4_thumbs_2015_12_2.jpg \nhttp://s18.postimg.org/hxoj1i46x/s6713_7maidtoorderdanceoff_mp4_thumbs_2015_12_2.jpg \nhttp://s18.postimg.org/nbnb91tx5/s6714_7maidtoorderbggdildo_mp4_thumbs_2015_12_2.jpg \nhttp://s18.postimg.org/l9mtusvy1/s6715_7maidtoordertsbj_mp4_thumbs_2015_12_26_12.jpg \nhttp://s18.postimg.org/5kbouleih/s6716_7maidtoorderinstruction_mp4_thumbs_2015_1.jpg \nhttp://s18.postimg.org/motggn3cp/s6717_7maidtoorderstraponanal_mp4_thumbs_2015_1.jpg\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:2eb28ee37200e782e42fe89b013cca13b7930078","amp;dn":"SubbyHubby+-+Maid+To+Order+1-7+720p+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eb28ee37200e782e42fe89b013cca13b7930078","infoHashBuffer":{"type":"Buffer","data":[46,178,142,227,114,0,231,130,228,47,232,155,1,60,202,19,183,147,0,120]},"announce":[],"urlList":[]}}