{"title":"Greg Iles - Turning Angel (Penn Cage #2)","uid":13142311,"size":673525282,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:317461baf27f37561e28e8f73a5479c18207a161&amp;dn=Greg+Iles+-+Turning+Angel+%28Penn+Cage+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":46,"time":1451995987,"description":"\nAs two of the most prominent citizens of Natchez, Drew and Penn sit on the school board of their alma mater, St. Stephen's Prep. When the nude body of a young female student is found near the Mississippi River, the entire community is shocked - but no one more than Penn, who discovers that his best friend was entangled in a passionate relationship with the girl and may be accused of her murder.\r\n\r\nOn the surface, Kate Townsend seems the most unlikely murder victim imaginable. A star student and athlete, she'd been accepted to Harvard and carried the hope and pride of the town on her shoulders. But like her school and her town, Kate also had a secret life - one about which her adult lover knew little.\r\n\r\nWhen Drew begs Penn to defend him, Penn allows his sense of obligation to override his instinct and agrees. Yet before he can begin, both men are drawn into a dangerous web of blackmail and violence. Penn finds himself doubting his friend's motives and searching for a path out of harm's way.\r\n\r\nMore dangerous yet is Shad Johnson, the black district attorney whose dream is to send a rich white man to death row in Mississippi. At Shad's order, Drew is jailed, the police cease hunting Kate's killer, and Penn realizes that only by finding Kate's murderer himself can he save his friend's life.\r\n\r\nWith his daughter's babysitter as his guide, Penn penetrates the secret world of St. Stephen's, a place that parents never see, where reality veers so radically from appearance that Penn risks losing his own moral compass. St. Stephen's is a dark mirror of the adult world, one populated by steroid-crazed jocks, girls desperate for attention, and jaded teens flirting with nihilism. And hidden among them all is one true psychopath.\r\n\r\n\r\n\r\n\r\nRead by Dick Hill\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:317461baf27f37561e28e8f73a5479c18207a161","amp;dn":"Greg+Iles+-+Turning+Angel+%28Penn+Cage+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"317461baf27f37561e28e8f73a5479c18207a161","infoHashBuffer":{"type":"Buffer","data":[49,116,97,186,242,127,55,86,30,40,232,247,58,84,121,193,130,7,161,97]},"announce":[],"urlList":[]}}