{"title":"FIFA 16 Ultimate Team Mod (Patched) -XpoZ","uid":14947750,"size":1437216290,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:31f45ba25d7ec29dd1bcf3746171dd50721b351a&amp;dn=FIFA+16+Ultimate+Team+Mod+%28Patched%29+-XpoZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaigege1","files":4,"time":1466071104,"description":"FIFA 16 Ultimate Team Mod (Patched) and Cheats\r\n\r\n\r\n\r\nFIFA 16 Ultimate Team v3.2.113645 Mod (Patched) [Apk+Obb]-XpoZ\r\n\r\n| Category:Sports | | Requires :Android 4.4 and up |\r\n\r\n\r\nw9Juob1y2R.png\r\n\r\n\r\nReady to play the beautiful game, wherever you are? Get FIFA 16 Ultimate Team now!\r\n\r\n\r\n4/5 · Google Play\r\nFIFA 16 is an association football simulation video game developed by EA Canada and published by EA Sports for Microsoft Windows, PlayStation 3, PlayStation 4, Xbox 360, Xbox One, Android and iOS.\r\n\r\nWhat is the Mod:\r\n\r\n#Patched--(Tested-Working On All Device)\r\n\r\nNote:-In First Time You Need Net To Play\r\n\r\n\r\nWhat is in this version :\r\n\r\n&gt;Few off-the-pitch enhancements to improve your gameplay experience.\r\n\r\n\r\nGame Review:\r\n\r\nPlay beautiful with a newer, better, and faster FIFA experience on mobile! FIFA 16 Ultimate Team lets you celebrate every awesome attack, nail-biting goal, and powerful win like never before with console-like graphics. Experience the most realistic set of football features on Google Play.\r\n\r\n** This is a highly detailed game of superior quality. Please make sure you have at least 1.4GB of free space on your device. FIFA 16 Ultimate Team works best on Motorola Nexus 6, HTC Nexus 9, HTC M8, Asus Nexus 7 2nd Gen, Samsung Galaxy S6, Samsung Galaxy S6 edge, Samsung Galaxy S5, Samsung Galaxy Alpha, Samsung Galaxy Note Edge, Sony Ericsson Xperia Z2 Tablet, Sony Ericsson Xperia Z3, Samsung Galaxy S4, HTC Nexus 4, LG G2. **\r\n\r\nALL-NEW ENGINE\r\nGet ready for better skill moves, more exciting goals, more responsive controls, smarter teammates, and improved animations as you play the match. Plus, now itâ™s even easier to play like a pro with Enhanced Hybrid Controls that let you use Gestures or Buttons to control the ball. Gain improved offside awareness and more with Attacking Intelligence, then blow past defenders with ease. Alternatively choose to simulate matches, taking the manager position on the side of the pitch. Also, for the first time on mobile, you can trigger unique player celebrations on the pitch after you score!\r\n\r\nBUILD AND MANAGE YOUR ULTIMATE TEAM\r\nEarn, trade, and transfer superstars like Lionel Messi, Jordan Henderson, and Juan Cuadrado to create your own fantasy team. Choose your play style, formation, kits, and more, then balance player chemistry for the strongest squad compositions.\r\n\r\nFDwrNhC6Oz.jpgSqcLte6nw3.jpgLGjY8eZMsi.jpggy8mtjYNh5.jpgDSrgJ1kdau.jpg\r\n\r\nCHALLENGING SKILL GAMES\r\nWant to show off your skills on the pitch like never before? Choose your daily challenge – from shooting, ground passing, and dribbling to crossing, penalties, and more. Then, pick the right player and beat the challenge to earn rewards!\r\n\r\nREAL WORLD FOOTBALL\r\nChoose from over 10,000 players from over 500 licensed teams and go to battle against other players from real leagues in real arenas from around the world. Recreate challenges from current live-event football matches, too, with Dynamic Accomplishments.\r\n\r\nPLAYER EXCHANGE\r\nNow trade players and items you no longer need for a chance of unlocking something better. The higher value items or players you trade, the better the upgrades youâ™ll get back!\r\n\r\n\r\n\r\nMore At GooglePlay:-FIFA 16 Ultimate Team\r\n\r\nHigh Quality Movies in Ultra compressed size\r\n\r\n\r\nwithout loss in Quality.\r\n\r\n&amp;&amp;&amp;\r\n\r\nFull Android Games &amp; App","torrent":{"xt":"urn:btih:31f45ba25d7ec29dd1bcf3746171dd50721b351a","amp;dn":"FIFA+16+Ultimate+Team+Mod+%28Patched%29+-XpoZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f45ba25d7ec29dd1bcf3746171dd50721b351a","infoHashBuffer":{"type":"Buffer","data":[49,244,91,162,93,126,194,157,209,188,243,116,97,113,221,80,114,27,53,26]},"announce":[],"urlList":[]}}