{"title":"Clay Swelling and Colloid Stability - Martin Smalley","uid":14916393,"size":6304644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3303d89eacb2d71e04da2b010637161dac56bd9f&amp;dn=Clay+Swelling+and+Colloid+Stability+-+Martin+Smalley&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1465897139,"description":"Clay Swelling and Colloid Stability - Martin Smalley (CRC, 2006).pdf\r\n\r\nISBN 0-8493-8079-0\r\n\r\nIn a rare, over-the-shoulder perspective of a leading scientist’s own breakthroughs, Clay Swelling and Colloid Stability puts emphasis on two significant paradigm shifts in colloid science that explain particle interactions for charged plates, stacks, suspensions, and pastes as well as spherical colloids.\r\n\r\nMartin Smalley first discusses the replacement of the DLVO theory with the Coulombic Attraction Theory to explain the existence, extent, and properties of the two-phase region of colloid stability. Using the n-butylammonium vermiculite system as his model clay system, the author clarifies the flaws of conventional theories and presents the experimental details that form the basis of his new theories. He provides rigorous derivations that place the new electrical theory for charged colloids on a firm foundation in statistical mechanics. The author illustrates why a new, quantitative bridging flocculation model for polymer-stabilized colloids must replace the depletion flocculation model. Smalley also examines the discovery of the &quot;dressed macroion&quot; structure of clay plates in solution, the structure of a bridging polymer, and the distribution of polymer segments, counterions, and water molecules in the interlayer region.\r\n\r\nBased on the author’s own research and 36 publications in the field, Clay Swelling and Colloid Stability is a self-contained and intellectually satisfying account of the revolutionary process leading to a universally sound, and increasingly applicable, theory of colloid stability","torrent":{"xt":"urn:btih:3303d89eacb2d71e04da2b010637161dac56bd9f","amp;dn":"Clay+Swelling+and+Colloid+Stability+-+Martin+Smalley","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3303d89eacb2d71e04da2b010637161dac56bd9f","infoHashBuffer":{"type":"Buffer","data":[51,3,216,158,172,178,215,30,4,218,43,1,6,55,22,29,172,86,189,159]},"announce":[],"urlList":[]}}