{"title":"Nubiles-Porn - Aaliyah Love, Violet (Teachers Assignment)","uid":13070668,"size":598459997,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:34c52a343bfb2df751e5cb564e015c2d4a347eed&amp;dn=Nubiles-Porn+-+Aaliyah+Love%2C+Violet+%28Teachers+Assignment%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1450793969,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/L5\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Aaliyah Love, Violet\r\nName movie: Teachers Assignment\r\nNPP site and the site: Nubiles-Porn.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Blonde, Short hair, Long hair, Hardcore, High Heels, Petite, Stockings, Girl-Girl-Boy, Blowjob, Facial, Deep Throat, Pussy Licking\r\nDuration: 00:26:15\r\n\r\nAaliyah Love confronts Bambino when she finds him playing basketball instead of working on his project. He remains unable to concentrate since he's had the hots for his teacher for a while, and once Aaliyah realizes it she's like butter in his hands. She's on her knees giving Bambino a lusty blowjob when Violet walks in and finds them and agrees to help Aaliyah suck him off.\r\n\r\nAfter helping Violet out of her clothes, Aaliyah gets her blonde student onto the ground to work on sucking Bambino's cock together. When he's been deemed nice and hard, Aaliyah instructs Violet to bend over the desk and let Bambino slide his dick into her tight little twat until she cums. Aaliyah is happy to wait her turn until Violet has had a few quick climaxes. Then she lays down on the couch and lets Bambino go to town on her landing strip fuck hole. She's even happy to let Violet plant her pussy on her mouth to muffle her screams.\r\n\r\nViolet gets another round of booty popping fucking when she sits down on Bambino's cock, but Aaliyah is not quite satisfied by what she sees. She orders Violet onto the desk, and then leans forward to eat her out while Bambino slides home into her twat. When Aaliyah has had her fill of being fucked, she gives Violet one more chance to get her pussy pounded before heading into the home stretch.\r\n\r\nDropping to her knees, Aaliyah uses every bit of skill she possesses to wrap her lips around Bambino's member while he alternates between fucking her mouth and Violet's twat. When he's finally ready, he pulls out and covers both Violet's bare snatch and Aaliyah's waiting mouth with his jizz to leave both girls totally satisfied.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 640x360 29.97fps 1535kbps\r\nAudio: AAC 44100Hz stereo 96kbps","torrent":{"xt":"urn:btih:34c52a343bfb2df751e5cb564e015c2d4a347eed","amp;dn":"Nubiles-Porn+-+Aaliyah+Love%2C+Violet+%28Teachers+Assignment%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34c52a343bfb2df751e5cb564e015c2d4a347eed","infoHashBuffer":{"type":"Buffer","data":[52,197,42,52,59,251,45,247,81,229,203,86,78,1,92,45,74,52,126,237]},"announce":[],"urlList":[]}}