{"title":"Sokoban Land Premium v1.0.2","uid":13260316,"size":38740564,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:34fdaaefbae67afb953f0f104bb8d71faa8f124f&amp;dn=Sokoban+Land+Premium+v1.0.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":1,"time":1453262915,"description":"Sokoban Land is a game where you need to push boxes to the right places on the scene, so you unlock the way to continue your adventure through several levels in various worlds and scenarios full of color and charisma.\r\n\r\nIf you've never played Sokoban before or never had much affinity with this kind of game, don't worry. The first levels were made especially for you. \r\n\r\nThere, you'll learn everything you will need to go on this adventure. In addition, within &quot;configurations&quot; and &quot;pause&quot; menu, you can access the &quot;How to play&quot; which will give you a hand with the basics of the game ;)\r\n\r\nSo if you are already a &quot;Sokoban savvy player&quot;, the first levels may not be a big challenge for you, but the more advanced ones, must quench the thirst of &quot;puzzle pioneers adventurers&quot;.\r\n\r\nYou will be challenged to use your reasoning skills to solve puzzles involving movement and space. Thus, you'll be able to place each box in place and may continue your journey organizing things to get further and further away and visit new challenges and places where only the great &quot;organizers of things&quot; can get! =D\r\n\r\nWith visual and game mechanical mixing elements of classic games mainly 16bits era with latest 2D styles and sounds, the Sokoban Land was built to please new players and also the old school ones :D\r\n\r\nMain characteristics:\r\n\r\n+ Easy to play and learn how to play;\r\n+ Helps to develop your reasoning skills;\r\n+ Visuals and style that blend nostalgia and modernity;\r\n+ Varied soundtrack;\r\n+ New levels and worlds will be included in new updates every month up to 100 levels! Perhaps even to exceed this number.. =D (Initially there are the first full world with 20 levels);\r\n+ Works great on Xperia Play and Ípega PG-9701 (other devices with native controller, like Nvidia Shield, should work fine too, but not yet tested);\r\n+ English and portuguese language supported;\r\n+ This version (Sokoban Land Premium) is totally free of ads and advertisements.\r\n\r\nWhat's New:\r\n\r\n+ Added all &quot;World 3 Part 2&quot; Levels;\r\n+ Added all &quot;World 3 Part 1&quot; Levels;\r\n+ Minor visual improvements.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.mypocketadventure.sokobanlandpremium","torrent":{"xt":"urn:btih:34fdaaefbae67afb953f0f104bb8d71faa8f124f","amp;dn":"Sokoban+Land+Premium+v1.0.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34fdaaefbae67afb953f0f104bb8d71faa8f124f","infoHashBuffer":{"type":"Buffer","data":[52,253,170,239,186,230,122,251,149,63,15,16,75,184,215,31,170,143,18,79]},"announce":[],"urlList":[]}}