{"title":"Resident Evil 6 Update 6 (ver 1.6) PERFECTION (Mercs Freeze Fix)","uid":13128043,"size":266981660,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3569737766c7f87ed3ba041ff02a9ec987cce358&amp;dn=Resident+Evil+6+Update+6+%28ver+1.6%29+PERFECTION+%28Mercs+Freeze+Fix%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JOESWAN","files":1,"time":1451807141,"description":"RE6 Update 6 Perfection Edition.\r\nBased on Reloaded Update 6 and ALI213's crack\r\nAlso includes up-to-date s1216Soft.arc from Christsnatcher\r\n\r\nCopy the contents of UPDATE+CRACK into the game directory.\r\n\r\nThe included ALI213 crack fixes the Mercs mode soft freezing after every round, a problem that afflicts most other cracks. This package is primarily useful for people with older repacks, or the original RELOADED release. It is not intended for netplay over Tunggle, but if you want to go down that road, best of luck.\r\n\r\nPlease consider buying this game. It frequently goes on sale for $10 or less on Steam. Resident Evil 6 is a remarkable game, and every sale gives Capcom more incentive to make more games like it.\r\n\r\nHelpful Stuff:\r\nResident Evil 6 Web Manual is an important read since the game lacks tutorials - http://game.capcom.com/manual/bio6/en/\r\n\r\nRE6's FOV is adjustable under Options &gt; Camera from the Main Menu.\r\n\r\n\tDefault Camera Field of View. Recommended = 15.\r\n\tField of View When Aiming. Recommended = 10\r\n\r\n&quot;Adjust Screen Brightness&quot; is misleading. The correct setting lies between 24-30 depending on taste and monitor. Attempting to follow the instructions &quot;so that that number 6 is barely visible&quot; will result in an excessively dark image.\r\n\r\nThe &quot;Auto Action Button&quot; setting can be found under Options &gt; Game Settings. AAB makes many &quot;instant death&quot; Quick Time Events impossible to fail. Typical examples include being struck by trains. AAB is highly recommended for a more enjoyable game experience.\r\n\r\n&quot;Aiming Reticle&quot; under Options &gt; Controls offers both crosshairs (Default) and a laser sight (Classic). Using the laser sight option is generally recommended.\r\n\r\nUnfortunately, saves from one crack are generally not compatible with saves from another crack. So you'll very likely have to start a new game. On the positive side, RE6 now has Mercs unlocked from the beginning, so you won't have to replay the entire game to get it if you don't want to.\r\n\r\nPlease ensure you give BH6.exe administrative permissions, otherwise the game will likely not save. On modern Windows, this is Right Click, Properties, Compatibility, Run this program as an administrator. Also, you should probably firewall the exe using whatever means you find convenient","torrent":{"xt":"urn:btih:3569737766c7f87ed3ba041ff02a9ec987cce358","amp;dn":"Resident+Evil+6+Update+6+%28ver+1.6%29+PERFECTION+%28Mercs+Freeze+Fix%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3569737766c7f87ed3ba041ff02a9ec987cce358","infoHashBuffer":{"type":"Buffer","data":[53,105,115,119,102,199,248,126,211,186,4,31,240,42,158,201,135,204,227,88]},"announce":[],"urlList":[]}}