{"title":"PascalsSubSluts - Amber West (Daddy Can't Save You Now) HD","uid":13098409,"size":786379637,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:35da77dc24140a2c3bf3cb2dedda3f4eca137559&amp;dn=PascalsSubSluts+-+Amber+West+%28Daddy+Can%27t+Save+You+Now%29+HD+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1451173910,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rmDsN \nhttp://imgkiss.com/image/rmKkF \nhttp://imgkiss.com/image/rmTJ5 \nhttp://imgkiss.com/image/rm2Wg\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nWhere would porn be without Daddy's girls? It's a question raised by Amber West after she freely admits to being one herself, even at the age of 30. Expecting her interview to be a suitably moronic Q&amp;A about her favourite positions and the size of her tits, she's a little taken aback by the glare of Andy's questioning but she warms quickly to her interrogation and chats openly about her longstanding relationship with her, er, father figure. So much so that by the end, after saying that she's a mature student studying Forensic Psychology in Scotland, she's rather regretting her candour for fear of being outed as the porn slut she is back home. Too late, girl. All that stuff about being piss-play, being given enemas in the bath, and sharking for innocent young flesh in nightclubs to take back to Daddy -- it's all out there now, darling. And like all good girls, Amber does rather cherish a damned good spanking. So that's exactly what she gets in her scene, after we've shot a little tease vid with her and she's obediently pissed all over the hallway floor. Plot-wise we figured we had so much fun with that first scene we shot with Anita, the one in which her landlord's sent her round to us to shoot some filth with us in exchange for her late rent, that we'd go back to it again. So Amber finds herself in the same sticky situation, only this time the landlord wants us to throw in more punishment and have her look at the camcorder and let him know that her &quot;pain is your pleasure&quot; from time to time. Can't say fairer than that. Cue a whole load of spanking to kick things off with at the start of the scene (and at intervals thereafter) and some damn fine fucking and sucking and suitably demeaning treatment as best befits such a cheap and easy trollop. The bitch's bottom is left nicely marked and she won't have been sitting on it for a good couple of days afterwards.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:35da77dc24140a2c3bf3cb2dedda3f4eca137559","amp;dn":"PascalsSubSluts+-+Amber+West+%28Daddy+Can%27t+Save+You+Now%29+HD+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35da77dc24140a2c3bf3cb2dedda3f4eca137559","infoHashBuffer":{"type":"Buffer","data":[53,218,119,220,36,20,10,44,59,243,203,45,237,218,63,78,202,19,117,89]},"announce":[],"urlList":[]}}