{"title":"BratPrincess - TENS Unit Tested on Cum Recycling Cow 720p","uid":13208572,"size":1755363132,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:378198185b97c4d8156bed6ab46163c4e67c30bd&amp;dn=BratPrincess+-+TENS+Unit+Tested+on+Cum+Recycling+Cow+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1452623518,"description":"BratPrincess - TENS Unit Tested on Cum Recycling Cow 720p\r\n\r\nYear: 2015 \r\n\r\nCast: Amadahy, Lola, Noe \r\n\r\nTags: Milking, Bondage, Female Domination, Domination \r\n\r\nDescription: Amadahy is curious to see if a TENS unit will increase pre-cum production in a cow. Noe suspects it will. The cows testicles have been tied off. They are ready for the pads to be applied. Amadahy applies the pads. Then, she shows new-hire, Noe, how the cows are teased. Amadahy explains that the vials this cow previously produced are not viable. Theres too much cum mixed in with the pre-cum. Its not pure enough for use. Amadahy demonstrates how bad cum is recycled back into the cow. She pinches its nose and forces it to a full vial. The vials werent labeled, so theyre not sure if the cum is this particular cows own. It doesnt matter. Amadahy explains, all cum is recycled. Amadahy further explains to Noe the role of the teaser. She then turns up the TENS unit, which appears to be working. The cow moos to indicate that it is in pain. Noe observes that the s seem to whimper a lot. Amadahy reminds her that these s arent human. The more pre-cum we can get out of them the more money well make and thats all that matters. She states. The cow receives a series of denial shocks to prevent orgasms. Its having a very productive shift. The cow is being constantly edged. It loves Amadahys ass and nearly cums every time she sits on its face. Noe is concerned about how violently the cow shakes when it is shocked. Shes afraid she might get hurt by its thrashing about. Amadahy sends the labs assistant to deliver a pair of worn panties. She gags it with the panties to prevent the from biting its own tongue during the shocks. Amadahy removes the panties briefly to recycle another bad vial. The cow spits it up. Its having a lot of difficulty swallowing the second vial. It gets some of the cum in its eye. Amadahy wipes its face so that she doesnt get any on her. She explains that cows are below even slaves. This one will spend the last of its days inside the warehouse. It will never emerge, but if it behaves it can see a picture of its Princess. The cow loves its Princess. Amadahy says that the one good characteristic of every cow is its unconditional love for its Princess. Theres more unusable pre-cum in the lab. Amadahy sends the assistant after it. The assistant returns with a full test tube. Amadahy smells the tube. It is truly foul. Its from one of the cows on a diet. All three girls force feed the cow the terrible contents of the test tube. The cow nearly aspirates. Amadahy reminds the other girls that they need to keep this one alive for a few more years. It would be a costly mistake to let a fairly young cow aspirate on cum. Amadahy is right and they all laugh. They stuff the nasty panties back into the cows mouth. Its orgasm levels start to drop. Its alive, but no longer functioning properly. No matter how tired or defiant the cow gets, there are too many controls in place to keep it from losing an erection. However, very little pre-cum is being harvested. Amadahy adjusts the TENS unit. Nothing. The cow has reached an exhausted state. Amadahy tries a last-ditch effort with the cows known fetish. It has flat-lined. Amadahy promises the cow a negative report to its Princess. The cow is abandoned. After a few minutes the assistant returns. Shes come to have a heart to heart with the cow. The lab assistant just cant understand why this cow isnt trying harder. She concludes that it must be because the cow is failing at being the lowest lifeform. She leaves the cow with no words of wisdom. \r\nDuration: 00:37:42 \r\n\r\nScreens\r\n  \nhttp://s11.postimg.org/tr1egbsvn/Amadahy_Lola_Noe_TENS_Unit_Tested_on_Cum_wmv.jpg\r\n \nhttp://s14.postimg.org/ldhdm1wht/Amadahy_Lola_Noe_TENS_Unit_Tested_on_Cum_wmv.jpg\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\n Just keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\n Also, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\n Any Questions ?? Read our FAQ!!\r\n  \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n  \nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg\r\n\r\n Cheers :-)","torrent":{"xt":"urn:btih:378198185b97c4d8156bed6ab46163c4e67c30bd","amp;dn":"BratPrincess+-+TENS+Unit+Tested+on+Cum+Recycling+Cow+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"378198185b97c4d8156bed6ab46163c4e67c30bd","infoHashBuffer":{"type":"Buffer","data":[55,129,152,24,91,151,196,216,21,107,237,106,180,97,99,196,230,124,48,189]},"announce":[],"urlList":[]}}