{"title":"Dan T Sehlberg - Mona - svensk","uid":13364292,"size":316981100,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:378ac3d0e6fe01e941b633365741ed74210cbf2f&amp;dn=Dan+T+Sehlberg+-+Mona+-+svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cacutta","files":87,"time":1454157043,"description":"Här kommer rätt bok Mona. \r\n\r\nFörväxlade tyvärr filerna med Sinon som är den fristående uppföljare av av Dan T Sehlberg första bok, Mona.\r\n\r\nHade också problem med uppkopplingen till TPB. Lite nybörjartabbar och en del strul. Hoppas ni har överseende med mina tillkortakommande.\r\n\r\nDan T Sehlberg - Mona\r\n\r\nHanna Söderqvist, en ung och tidigare helt frisk kvinna, hamnar oförklarligt i koma efter en tid av hög feber och fasansfulla hallucinationer. Det liknar en virusinfektion, men kan hon verkligen vara smittad av det datavirus som samtidigt hotar att slå ut Israels och hela västvärldens banksystem? \r\nEric Söderqvist, forskare vid KTH i Stockholm, var på gränsen till ett genombrott för sin banbrytande uppfinning, Mind surf, ett tredimensionellt internet som kontrolleras med tankekraft och som visas direkt i människans hjärna. Den första person han prövade systemet på var hustrun, Hanna. Hans samvetskval är mördande. Datorvirusets skapare är den ende som kan ha ett antivirus. Trots att läkare och vänner försöker stoppa honom så ger sig Eric ut på en desperat och livsfarlig jakt med Mossad, Hizbollah och FBI i hälarna. Men medan Eric jagar upplysningar i Frankrike, Israel och Gaza avlider en smittad person i Stockholm och Hanna blir allt sjukare. \r\nSamir Mustaf, libanes och tidigare datorvirusexpert vid MIT i Cambridge, är mannen bakom Mona, det mest sofistikerade viruset någonsin. En israelisk klusterbomb utplånade hans familj och lämnade honom ensam med en ohygglig sorg och bitterhet - något som Hizbollah och al-Qaida inte tvekar att utnyttja för sina egna syften. \r\nMen under det att Eric jagar Samir, och etablerar kontakt med världens kanske mest eftersökta terrorister, jagas han själv av Rachel Papo, en Mossadagent med många mord på sin meritlista. Hon är en attraktiv men komplicerad kvinna som till sin egen förvåning känner sig attraherad av Eric. Vilken sida ska hon välja?\r\n\r\nSpeltid: 14tim 26min\r\nUppläsare: Martin Wallström","torrent":{"xt":"urn:btih:378ac3d0e6fe01e941b633365741ed74210cbf2f","amp;dn":"Dan+T+Sehlberg+-+Mona+-+svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"378ac3d0e6fe01e941b633365741ed74210cbf2f","infoHashBuffer":{"type":"Buffer","data":[55,138,195,208,230,254,1,233,65,182,51,54,87,65,237,116,33,12,191,47]},"announce":[],"urlList":[]}}