{"title":"Water Gas Shift Reaction - Research Developments and Application","uid":14972908,"size":22183862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37a230daf4a921ebc87cce3159f747401098f7c9&amp;dn=Water+Gas+Shift+Reaction+-+Research+Developments+and+Application&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1466211895,"description":"Water Gas Shift Reaction - Research Developments and Applications - G.K. Reddy, P.G. Smirniotis (Elsevier, 2015).pdf\r\n\r\nISBN 978-0-12-420154-5\r\n\r\nWater Gas Shift Reaction: Research Developments and Applications outlines the importance of hydrogen as a future fuel, along with the various hydrogen production methods. The book explains the development of catalysts for Water Gas Shift (WGS) reaction at different temperatures and steam/CO ratios, and also discussing the effect of different dopants on the WGS activity of iron oxide and the promotion and inhibition roles of the dopants on the WGS activity of iron oxide are explained.\r\n\r\nIn addition, the book describes extensive characterization of modified ferrite catalysts, especially with Mossbauer spectroscopy and its advantage in understanding properties of metal doped ferrite catalysts, the exact dopant location, and its effect on electron hopping capability and WGS activity of Fe redox couple.\r\n\r\n\r\nOutlines the importance of the Water Gas Shift Reaction and its application for hydrogen production\r\nProvides detailed information on potential catalysts, their development, and their pros and cons, giving the reader insights on how modified ferrite catalysts work at different temperatures and different steam to CO ratios\r\nReviews hydrogen technology, its current importance, and production methods\r\nPresents a clear presentation of the topics with many graphics and tables\r\nOffers basic and advanced knowledge of catalysts characterization instrumental techniques","torrent":{"xt":"urn:btih:37a230daf4a921ebc87cce3159f747401098f7c9","amp;dn":"Water+Gas+Shift+Reaction+-+Research+Developments+and+Application","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a230daf4a921ebc87cce3159f747401098f7c9","infoHashBuffer":{"type":"Buffer","data":[55,162,48,218,244,169,33,235,200,124,206,49,89,247,71,64,16,152,247,201]},"announce":[],"urlList":[]}}