{"title":"Rush Limbaugh - June 15, 2016 Full Podcast.mp3","uid":14945164,"size":93813805,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:38868099e992d75a743cde5a3c43ce0e26580a3b&amp;dn=Rush+Limbaugh+-+June+15%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1466040797,"description":"Rush Limbaugh - June 15, 2016 Full Podcast \r\n\r\nSee, I Told You So #1: The Republican Establishment-Boeing-Iran Nuke Deal\r\n\r\nRUSH: Cut to the chase, story today, CNN Money:  &quot;Iran: We've reached a deal to buy planes from Boeing -- Iran says it's reached a deal to buy passenger aircraft from US plane maker Boeing. The announcement came Tuesday from Abbas Akhoundi, the Iranian minister of roads and urban development. He said details on the agreement would be announced in the next few days, according to reports by Iranian news agencies.&quot; Now, I run the risk here in mentioning this as coming off as anti-Boeing. I'm not... We knew last July.  We knew last September.  And I'm just mentioning it 'cause the proof has now come through.  It's taken a while for it all to develop, but that is why.  And it's a microcosm of why the Republican Party is in the position it's in with its voters. \r\n\r\nSee, I Told You So #2: Democrats Hate Us More Than They Hate the Terrorists\r\n\r\nRUSH: See, I Told You So Number Two.  Department of Homeland Security: &quot;Right-Wingers Pose Same Threat As Islamic Extremists.&quot;  I led this program yesterday reminding you yet again of my opinion that I think has been confirmed over and over again, that the American left, the Democrat Party, progressives, liberals, hate us.  And I mean hate.  It isn't dislike.  It is an irrational hate.  They hate us.  By us, I mean Republicans, conservatives, traditionalists, Christians, they hate us.  And the proof is obvious.  This event happens, any event, any terrorist act now, any mass shooting, the first thing they do is try to link us to it, find a way to associate us with it or blame us for it, without fail.  Never, ever, do they make an attempt to actually zero in on who's responsible, even when one of their primary \r\n\r\nMrs. Clinton Is Rattled, Folks\r\n\r\nRUSH: Hillary Clinton is rattled.  Hillary Clinton is now showing up on CNN making a speech on national security.  I'm telling you that, you know, I don't care what you think of the substance of Trump's rallies, because every one of them is different, but it is clear that when he gets out there that Obama and Hillary feel the need to react to it... We are offering a premium, RushLimbaugh.com's bumper sticker promotion, and it is phenomenal... It's &quot;Never Hillary.&quot;  It's her blue color; it's her red arrow -- and we put &quot;Never Hillary.&quot; And these things are flying, figuratively -- we don't have any shelves, really, but they're flying -- off the shelves as people see this and they're becoming subscribers to Rush 24/7.\r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:38868099e992d75a743cde5a3c43ce0e26580a3b","amp;dn":"Rush+Limbaugh+-+June+15%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38868099e992d75a743cde5a3c43ce0e26580a3b","infoHashBuffer":{"type":"Buffer","data":[56,134,128,153,233,146,215,90,116,60,222,90,60,67,206,14,38,88,10,59]},"announce":[],"urlList":[]}}