{"title":"Natural Arsenic in Groundwaters of Latin America","uid":15106732,"size":20644218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a57bf2a7eb2b08667a754588b534290fe9932c4&amp;dn=Natural+Arsenic+in+Groundwaters+of+Latin+America&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1466983470,"description":"Natural Arsenic in Groundwaters of Latin America - J. Bundschuh et al. (CRC, 2009).pdf\r\n\r\nISBN 978-0-415-40771-7\r\n\r\nGroundwater resources naturally contain high levels of arsenic in many parts of the world. Over the last two decades, the As-containing groundwater in South-East Asia has received much attention, but the situation is just as crucial in Latin America, where the number of studies is still relatively low, and the extent and severity of As-exposure in the populations has yet to be fully evaluated. This book aims to promote knowledge of the occurrence and genesis of As-rich groundwater in Latin America. It deals with constraints on the mobility of As in groundwater, As-uptake from soil and water by plants, As-propagation through the food chain, human health impacts, and As-removal technologies. Case studies are presented from Argentina, Bolivia, Chile, Ecuador, El Salvador, Mexico, Nicaragua and Peru, amongst others, and are viewed against the background of experience from other world regions. The book is a state-of-art overview of arsenic research in Latin America. It aims to create interest within the Latin American countries affected by the presence of arseniferous aquifers and to increase awareness among administrators, policy makers and company executives. It will also serve to inform the international scientific community, and improve international cooperation on arsenic in groundwater","torrent":{"xt":"urn:btih:3a57bf2a7eb2b08667a754588b534290fe9932c4","amp;dn":"Natural+Arsenic+in+Groundwaters+of+Latin+America","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a57bf2a7eb2b08667a754588b534290fe9932c4","infoHashBuffer":{"type":"Buffer","data":[58,87,191,42,126,178,176,134,103,167,84,88,139,83,66,144,254,153,50,196]},"announce":[],"urlList":[]}}