{"title":"Girlsway - Phoenix Marie, Jessa Rhodes, Mia Malkova HD 1080p","uid":13349344,"size":1100422594,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3a715cbcacaaf6d6ef82783678f9f35e5cd7d694&amp;dn=Girlsway+-+Phoenix+Marie%2C+Jessa+Rhodes%2C+Mia+Malkova+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ElitePorn","files":1,"time":1454075404,"description":"Girlsway - Phoenix Marie, Jessa Rhodes, Mia Malkova HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nToday, we're on set of the filming of Mia Malkova's upcoming feature film. Such a beauty needs a stunt double for some of the harder scenes. Mia is a perfect beautify with a fragile flexibility to achieve some of the more sensual and subtle aspects of her film, but her hard laced stunt double Jessa Rhodes has the attitude and strength to seamlessly take Mia's soft performance to a new level. Now that the opening drama has been filmed, Director Phoenix Marie must find a way to get the loose cannon Jessa to perform the attack to her best ability.\r\n\r\nAs the clothes fly off, and the actresses show all, Phoenix can't help but wonder what would happen if she takes the script in a new direction. So when it turns out the leading man Riccardo, who's destined to save Mia's life is M.I.A, Phoenix sees a potential opportunity to build the relationship she sees between Mia and Jessa, and takes a chance at filming something no one expected could make the final cut. She has Jessa stand in for Riccardo, and the passion begins to fly!\r\n\r\nAs Jessa lays the first kisses on Mia, Phoenix eggs them on for more and more passion. Jessa breaks character, and needs a talking to. Phoenix puts it plain and simple. Mia's a woman and Jessa's playing a man. There are no lesbians in the house, get it? Phoenix in all her frustration, uses her demanding presence to coach Jessa on how to perform the part. Jessa surely sees this as the opportunity she's been waiting for, and swallows her pride in order to rise to the opportunity she's being handed. Phoenix takes the back seat to see what monsters she's created, and Before long Mia and Jessa are licking one another's pink pussies and sharing their taste with one another. If Phoenix didn't think this was lesbian before, there's no denying that this lesbian love fest was instigated by her, and that her newest lesbian movie will make it into the Hollywood Hall of Lesbian Treasures.\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.asia/soft/GXS\r\n \nhttp://picturescream.asia/soft/GXU\r\n \nhttp://picturescream.asia/soft/GXb\r\n \nhttp://picturescream.asia/soft/GXk\r\n \nhttp://picturescream.asia/soft/GXs\r\n \nhttp://picturescream.asia/soft/GX8\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 1.02 GB\r\nDuration: 32:24 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:3a715cbcacaaf6d6ef82783678f9f35e5cd7d694","amp;dn":"Girlsway+-+Phoenix+Marie%2C+Jessa+Rhodes%2C+Mia+Malkova+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a715cbcacaaf6d6ef82783678f9f35e5cd7d694","infoHashBuffer":{"type":"Buffer","data":[58,113,92,188,172,170,246,214,239,130,120,54,120,249,243,94,92,215,214,148]},"announce":[],"urlList":[]}}