{"title":"XYplorer Pro v16.20.0200","uid":13425128,"size":4138755,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3b184e5db81cc5a64c4a0c06472591069af4cc09&amp;dn=XYplorer+Pro+v16.20.0200&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1454584734,"description":"XYplorer Pro v16.20.0200\r\n\r\n\r\n\r\nVersion 16.20.0200: A new toolbar button allows you to quickly show/hide protected operating system files. And you can assign a keyboard shortcut to the new menu command View | Show Items | Hide Protected Operating System Files.\r\n\r\nTip: To add this button to your toolbar use menu Tools | Customize Toolbar... (Ctrl+Shift+F9).\r\n\r\n\r\n\r\nXYplorer is a file manager for Windows. It features tabbed browsing, a powerful file search, a versatile preview, a highly customizable interface, optional dual pane, and a large array of unique ways to efficiently automate frequently recurring tasks. It’s fast and light, it’s innovative, and it’s portable.\r\n\r\nXYplorer with Tabs, Mini Tree, Tree Path Tracing, Breadcrumb Bar, and Tags and Comments. Floating Preview to the right, with Photo Data.\r\n\r\nIt’s Portable\r\n\r\nXYplorer is a portable file manager. It doesn’t require any installation, stores all configuration data in the application data folder, and running it doesn’t change your system or registry. Take it with you and start it from a USB stick. File management to go.\r\nIt’s Tabbed\r\n\r\nTabs let you switch between folders most easily. Drag them around, hide them, lock them, name them, or drop files onto them. The tabs remember their configuration individually and across sessions. On top of this you get tabsets and dual pane.\r\nIt’s Functional\r\n\r\nXYplorer has been designed to make you faster. Numerous usability enhancements in an attractive interface help to streamline your workflow and increase your efficiency. You will definitely save a lot of time.\r\nIt’s Scriptable\r\n\r\nYes, you can program this app. Individual solutions for individual tasks. No plugins needed, scripts run out-of-the-box. Even beginners can benefit from this feature since many ready-to-use scripts are available in the forum.\r\nIt’s Customizable\r\n\r\nYou can fine-tune the app to look and behave exactly as you want it. This ranges from fonts and colors to custom toolbar buttons and even file icons and program associations. And every bit of it is fully portable.\r\nIt’s Responsive\r\n\r\nYour customer voice is listened to and taken seriously, most of the time you get instant feedback, and your wish might actually get implemented sooner than you’d think","torrent":{"xt":"urn:btih:3b184e5db81cc5a64c4a0c06472591069af4cc09","amp;dn":"XYplorer+Pro+v16.20.0200","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b184e5db81cc5a64c4a0c06472591069af4cc09","infoHashBuffer":{"type":"Buffer","data":[59,24,78,93,184,28,197,166,76,74,12,6,71,37,145,6,154,244,204,9]},"announce":[],"urlList":[]}}