{"title":"Obsessed - R.J. Lewis","uid":13133123,"size":707247,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c038f32e402c8f7bcf9c29fa11b4c5cb072f45f&amp;dn=Obsessed+-+R.J.+Lewis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1451866035,"description":"Elise \r\n\r\nI'm obsessed with Aston. \r\nHe became my addiction the moment I met him at 10 years old. \r\nHe was my best friend from childhood. \r\nHe protected me and guided me. \r\nI loved him fiercely long before I really understood what love was. \r\nWe were inseparable. \r\nHe knew how I felt, and sometimes he would stare at me in ways that made me breathless. \r\n\r\nBut there were boundaries. Lines that couldn't be crossed. Looks that shouldn't be exchanged. Lips that shouldn't be kissed. \r\n\r\nWe weren't supposed to love each other. Not in that way. \r\nBecause, you see, Aston was also my adopted brother...\r\n\r\nAston \r\n\r\nElise was off-limits, a temptation that cursed my existence with this visceral hunger to have her, possess her, and taste her like she was made for me. I was tormented and on the brink of falling. If I stepped over that boundary, if I gave into my want, I wasn’t sure I could survive the disappointment of my adopted parents. We would all be affected. Our lives wouldn’t be the way it was. That change was irreversible, and the damage would be permanent. It was a scary thought, destroying a foundation and rebuilding it without knowing what it might end up looking like. \r\n\r\nBut my want for her…it sat in the core of me, growing and growing. And want is a dangerous fucking thing. It clouds your judgment, it makes you weak, and I knew…I knew without a doubt, it was only a matter of time before I cracked. \r\nObsession was devotion. Obsession was mania and need. It was a compulsive urge to self-gratify by wanting, and wanting, and wanting ‘til it hurt, ‘til you could feel it there in your bones, gnawing its way deeper within you. \r\n\r\nObsession was my craze for Elise. She was my impulse. My…pulse itself. \r\nIt wasn’t healthy. I knew that. \r\nI didn’t fucking care either","torrent":{"xt":"urn:btih:3c038f32e402c8f7bcf9c29fa11b4c5cb072f45f","amp;dn":"Obsessed+-+R.J.+Lewis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c038f32e402c8f7bcf9c29fa11b4c5cb072f45f","infoHashBuffer":{"type":"Buffer","data":[60,3,143,50,228,2,200,247,188,249,194,159,161,27,76,92,176,114,244,95]},"announce":[],"urlList":[]}}