{"title":"Taboo Casting Calls 3 XXX (NEW) DVDRip x264","uid":13262802,"size":1838395288,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:40d6a3f1e35a07b929379020b7fffae0a4018a35&amp;dn=Taboo+Casting+Calls+3+XXX+%28NEW%29+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":2,"time":1453302788,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/Su\r\n \nhttp://imgsnaps.com/image/Sx\r\n\r\nCategory: Blowjobs, Handjobs, Facials, Cumshots, Auditions\r\n\r\nCast: Brooke Benson, Lola Vaughn, Piper Perri, Hope Harper, Maddy Rose, Helena Price, Miranda Mills, Sierra Simmons\r\n\r\n\r\n.:Description:.\r\n8 girls tricked into sucking cock! Brooke Benson - California cutie Brooke Benson came to Florida to start her career. When Brooke came in we had her strip and show off her assets. Brooke had hoped to make some money that day so it was easy to talk her into a challenge. Make our man cum in time and you'll get paid, but if you fail, he comes on your face! Sierra Simmons - 19 yr old ebony beauty Sierra came to us looking for a few new opportunities to make money and advance her career. Since she was pregnant we made sure to get her naked and doing a challenge for a job. Sierra was the easiest interview of the day it's a shame she'll never get paid. But she sure knows how to catch a load! Helena Price - She came in looking for a new job and decided to try porn. When we saw her sitting in the office we could tell she had skill. After getting her to strip we made her an offer. Helena jumped at the opportunity and actually beat the clock exceeding our expectations. Imagine her surprise when all she ended up with was a a massive facial. Piper Perri - Sexy teen Piper Perri was coming out of a store when we caught up to her. After a brief introduction this little teen was raring to go for a challenge. We walked into the bathroom and Piper put her skills to the test. Unfortunately for her she didn't be the clock and wound up taking a massive penalty shot in her tiny mouth","torrent":{"xt":"urn:btih:40d6a3f1e35a07b929379020b7fffae0a4018a35","amp;dn":"Taboo+Casting+Calls+3+XXX+%28NEW%29+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d6a3f1e35a07b929379020b7fffae0a4018a35","infoHashBuffer":{"type":"Buffer","data":[64,214,163,241,227,90,7,185,41,55,144,32,183,255,250,224,164,1,138,53]},"announce":[],"urlList":[]}}