{"title":"StepmomVideos - Jade Nile, Savanah Sage (The Anniversary / BangB","uid":13084554,"size":875018663,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:41e2908284e4bd62bed1c76acd626ed7f1105e68&amp;dn=StepmomVideos+-+Jade+Nile%2C+Savanah+Sage+%28The+Anniversary+%2F+BangB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"codho","files":1,"time":1450953343,"description":"StepmomVideos - Jade Nile, Savanah Sage (The Anniversary / BangBros) 1080p NEW December 24, 2015\r\n\r\n\r\nThis week we have the tale of a young lad named Jake the forgetful. Jake is constantly forgetting to do shit around the house; like throw out the trash, put down the toilet seat, shit this lad even forgets to close the front door! So, when His girlfriend Jade asked him if he remembered to make plans for their anniversary of course he had forgotten. Luckily Jake is quick and devised a plan to put a smile on his girlfriends face, at first Jake's plan was simple; he left random notes scattered around the house for Jade to find. Each note telling her to go to another room where she would find another note and so on. What Jake didn't count on was his step mom showing up and finding these notes before his beloved Jade would. Jake's step mom is somewhat of a nympho and had always wondered how jake would fair in bed. So, upon reading these kinky notes which she thought were intended for her; Jakes stepmom became extremely horny and began the hunt for Jake's cock. At last! Jake's stepmom found him in the study and began to have her way with the young lad. It was all wonderful until jake remembered that Jade was on her way and would find him naked with is stepmom mouth on his cock. The two quickly rushed from room to room as Jade searched the house for more notes. Finally Jade walked in on Jake and his stepmom in the master bedroom, At this point Jake was balls deep, But to his surprise Jade thought that Jake hired a sex therapist to help them improve in the bedroom. Jake being the quick witted guy that is; played along and accidentally got himself into the best threeway any man could ask for! It was glorious! Jade had never been fucked so hard by Jake before. Goes to show that a little help from a season veteran goes a long way!\r\n\r\nScreenshots :\r\n\r\n\r\n \nhttp://imgaah.com/viewer.php?file=71962598675183763583.jpg\r\n \nhttp://imgaah.com/viewer.php?file=67655507195578430844.jpg","torrent":{"xt":"urn:btih:41e2908284e4bd62bed1c76acd626ed7f1105e68","amp;dn":"StepmomVideos+-+Jade+Nile%2C+Savanah+Sage+%28The+Anniversary+%2F+BangB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41e2908284e4bd62bed1c76acd626ed7f1105e68","infoHashBuffer":{"type":"Buffer","data":[65,226,144,130,132,228,189,98,190,209,199,106,205,98,110,215,241,16,94,104]},"announce":[],"urlList":[]}}