{"title":"TeacherFucksTeens - Ariella Ferrera, Aspen Ora (Mischievous Ment","uid":13197461,"size":374048891,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4373dcf605c35119a164873c316b3737f6ed5354&amp;dn=TeacherFucksTeens+-+Ariella+Ferrera%2C+Aspen+Ora+%28Mischievous+Ment&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1452509225,"description":"Aspen Ora and Johnny Castle are at a party with their Spanish teacher, Ariella Ferrera. Ariella tells a scary story about teens that were murdered in the house to lure the group upstairs. When they hear a funny sound, everyone but Aspen and Johnny nopes out of there so that they are alone with Ariella.Sensing an opportunity to play matchmaker, Ariella takes the opportunity to help Johnny seduce Aspen by touching her soft bald pussy beneath her miniskirt and panties. The girls then team up to get Johnny's dick out for a lusty double blowjob That leads the way to Johnny finally getting the chance to sink balls-deep into Aspen's creamy snatch just like he's always dreamed. Things only get better when Ariella gets a turn at having her pussy pounded.That kicks off a lusty threesome where each of the girls get to live out their wildest lusty fantasies with Johnny as their willing stud. By the time they're done, there's only one last thing to do: Let Johnny get off. Laying side by side, Aspen and Ariella open their mouths in preparation to have Johnny cum all over their faces as he releases his orgasmic ecstasy.\r\nTags: Small Boobs, Big Boobs, Masturbation, Hardcore, High Heels, Latina, Girl-Girl-Boy, Blowjob, Facial, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=66322225158469114223.jpg\r\n \nhttp://imgdone.com/viewer.php?file=41234727300642295678.jpg","torrent":{"xt":"urn:btih:4373dcf605c35119a164873c316b3737f6ed5354","amp;dn":"TeacherFucksTeens+-+Ariella+Ferrera%2C+Aspen+Ora+%28Mischievous+Ment","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4373dcf605c35119a164873c316b3737f6ed5354","infoHashBuffer":{"type":"Buffer","data":[67,115,220,246,5,195,81,25,161,100,135,60,49,107,55,55,246,237,83,84]},"announce":[],"urlList":[]}}