{"title":"Beaufort;  A Novel by Ron Leshem Disc1","uid":14687025,"size":51965273,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:440d496003a95b437804ab4a6b1d6b83bb41c64e&amp;dn=Beaufort%3B++A+Novel+by+Ron+Leshem+Disc1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Papi","files":25,"time":1464144002,"description":"[quote]By M. T. Guzman on February 3, 2008\r\nFormat: Hardcover\r\nThere are many books that address what it feels like to be a soldier. I haven't read many about what it feels like to be an Israel Defense Force (IDF) soldier. I did read the excellent &quot;Adjusting Sights&quot; by Haim Sabato, which, like &quot;All Quite on the Western Front&quot; by Erich Remarque&quot; talks about what it's like to be a soldier in an apolitical world. Beaufort, however, markedly deals with what it's like to be an Israeli soldier. This might be disturbing to some based on your own personal politics. For me, it was eye-opening. It contained so much of the emotional side of war from the point of view of platoon leader Lieutenant Liraz &quot;Erez&quot; Liberti. I felt the bravado, the terror, and the love that pervaded the soldiers' souls during their station at Beaufort, an Israeli-occupied outpost in Lebanon.\r\n\r\nI'm not a person who gladly reads war novels. However, I thought I'd give this one a try because I discovered it was about Israel (and not about North or South Carolina as I had previously guessed from its title of &quot;Beaufort&quot;) and, within a few pages of the opening of the book, mentioned Qiryat Shemona, a town in Israel in which I had lived when I was younger.\r\n\r\nA note by the author at the end of the book made it very clear that all of the characters except for one were fictitious. However, they were based on some real stories of IDF (Israel Defense Forces) soldiers. What stood out in my mind was how true the details - the denied fear, the camaraderie, the agony - of their situation seemed. In addition, I entered a world I'd previously denied in my mind - the utterly horrific situations faced by IDF soldiers (and, most likely, soldiers of other countries as well). Whether their own politics beliefs had a role in placing them there or not, they had a job to do. It had to be done well or it ultimately would place their own lives and those of their comrades in jeopardy. While on civilian leave, the ugly truth of their lives as soldiers had be squelched and only its perceived beauty be allowed to shine forth (Think bravery, honor, patriotism, etc.).\r\n\r\nThere is one part of this book I found especially touching. It was the part about Mickey Bayliss, a soldier usually wearing a knitted kippa (skullcap used for religious Jews) who decided to remove it while on base. I could see how this was disheartening to Erez. It was also disheartening to me. It was as if Bayliss were saying that his level of spirituality was decreasing. That was so sad.\r\n\r\nThe story is a brutal but realistic account of the lives of a platoon of soldier. It should be read with the thought how devastating the effects of war are everywhere. It would be wise to note as well that there is ultimately no absolute right or wrong to war. Sadly, war exists and will continue to exist forever.[/quote]\r\n\r\n\r\n[url=http://extraimago.com/image/azP4][img]http://extraimago.com/images/2016/05/25/Folder.jpg[/img][/url]","torrent":{"xt":"urn:btih:440d496003a95b437804ab4a6b1d6b83bb41c64e","amp;dn":"Beaufort%3B++A+Novel+by+Ron+Leshem+Disc1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440d496003a95b437804ab4a6b1d6b83bb41c64e","infoHashBuffer":{"type":"Buffer","data":[68,13,73,96,3,169,91,67,120,4,171,74,107,29,107,131,187,65,198,78]},"announce":[],"urlList":[]}}