{"title":"Rigmar Radio Karaoke Collection 40500","uid":13416850,"size":1950995116,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:45ccf405609486a7580de791851fedf8c38e8bc4&amp;dn=Rigmar+Radio+Karaoke+Collection+40500&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":600,"time":1454505484,"description":"We will soon be on to the letter S and loads, and loads of Spanish Karaoke, but first 300 More classic Karaoke Tracks in CDG+MP3 format from the Rigmar Collection.\r\n\r\nMany, many hours have gone into renaming and re tagging the MP3 and CDG tracks so they conform to best industry practice for the naming of Music Files, so the search and display results give good results when playing back on a PC or MAC which for the vast majority is how things are done professionally in the real world.\r\n\r\nSo every year about this time I re seed the entire collection so you do not have to go through those hundreds of man hours which I have done.\r\n\r\nThere is a small fortune to be made for the first Karaoke company to drop the old fashioned support for CD ROM and Karaoke Machines and release there songs in this format direct to DJ's.  They would gain my custom right away for starters, but so far no one has listened.\r\n\r\nOUT SC1056-1128 Jackson, Alan feat. Alison Krauss - Angel's Cried, The\r\n\r\nIN  Alan Jackson &amp; Alison Krauss - The Angel's Cried [SC Karaoke]\r\n\r\nNot exactly rocket science is it.. duh\r\n\r\nRecord companies can not even agree how to spell Featuring!  IS it ft Ft. feat Feat. or any combination of those which seem to be OK in 2016.  \r\n\r\nTry searching for the song in a collection of over 100 thousand tracks on a PC or Mac and just see what happens Guys.\r\n\r\nStandard file names give DJ's a chance of finding the song in a hurry.\r\n\r\nRigmar Radio - Rockin' the Free World since 1967","torrent":{"xt":"urn:btih:45ccf405609486a7580de791851fedf8c38e8bc4","amp;dn":"Rigmar+Radio+Karaoke+Collection+40500","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45ccf405609486a7580de791851fedf8c38e8bc4","infoHashBuffer":{"type":"Buffer","data":[69,204,244,5,96,148,134,167,88,13,231,145,133,31,237,248,195,142,139,196]},"announce":[],"urlList":[]}}