{"title":"Etaria | Survival Adventure v1.2.1.0","uid":13404838,"size":27060535,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:47b32b827a0ff40ea4ab5fad1b1df20cd6b5eff2&amp;dn=Etaria+%7C+Survival+Adventure+v1.2.1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1454421715,"description":"Etaria is a fictional mystical world in which various animals and beings live.\r\nYou get to this wonderful world and you have only one purpose is to base the people which you will lead to blossoming.\r\n\r\n◄ World of Etaria ►\r\nThe whole world is created in a random way and it completely boundless.\r\nTo you always will than be engaged, the choice remains only for you. To go to chop trees and to collect wood or to descend on fishing? To pick berries or to go shooting? Will move off in searches of new lands or to go down in deep caves?\r\n\r\n◄ Fauna of the world of Etaria ►\r\nTraveling all over the world in Etaria you will meet a great number of various representatives of fauna of this or that district. Little and lovely little squirrels, fluffy and soft lambs, huge and terrible scorpions and many others.\r\n\r\n◄ Sand-box'a Elements ►\r\nAt game there will be Sand-box'a elements, namely editing a landscape and construction of huts and other useful constructions.\r\n\r\n◄ Survival Elements ►\r\nAt game also there will be survival elements. Collect livelihood, beat off from enemies and wild animals and many other things.\r\n\r\n◄ Hunting and fishing ►\r\nBe engaged in hunting for production of food and various useful resources, such as skins, canines, etc.\r\nYou catch fish in reservoirs. Fishing is one of fascinating occupations, after all fish клюёт depending on time of day.\r\n\r\n◄ Inhabitants ►\r\nYou can found the village in which your inhabitants whom you can divide into categories will live and give them various tasks, for example cut firewood, hunt, will go to mine, etc.\r\n\r\n◄ Daily gifts ►\r\nCome into Etaria every day and receive a gift!\r\nYou are waited by resources, the weapon, armor and many other things!\r\n\r\n◄ Features ►\r\n• Completely casual and infinite world.\r\n• Various biomes (Woods, fields, deserts, bogs and many others.)\r\n• Large number of various animals and other beings.\r\n• Different types of pastime: the cabin of a tree, fishing, hunting, descent in dark caves and many other things.\r\n• Tower-Defence elements. Defend the settlement and attack the others.\r\n• Survival elements. Survive in severe conditions\r\n\r\nWhat's New:\r\n\r\nUpgrade now!\r\nVersion 1.2.1.0 has brought the following changes:\r\n-Ability To pick up things from the warehouse.\r\n-Fixed a bug where it was impossible to build a building.\r\n-Reduce The size of APK file.\r\n-Fixed Various errors\r\n-Improved performance\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.buggames.EF","torrent":{"xt":"urn:btih:47b32b827a0ff40ea4ab5fad1b1df20cd6b5eff2","amp;dn":"Etaria+%7C+Survival+Adventure+v1.2.1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47b32b827a0ff40ea4ab5fad1b1df20cd6b5eff2","infoHashBuffer":{"type":"Buffer","data":[71,179,43,130,122,15,244,14,164,171,95,173,27,29,242,12,214,181,239,242]},"announce":[],"urlList":[]}}