{"title":"The Book of Joe abridged audiobook","uid":13125270,"size":294051147,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:48861e15494cc4117d897cb96fff875c6de4d6a1&amp;dn=The+Book+of+Joe+abridged+audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Eobard_Thawne","files":1,"time":1451765476,"description":"The Book of Joe\r\n\r\nWritten by: Jonathan Tropper\r\nNarrated by: Tom Cavanagh\r\n\r\nLength: 4 hrs and 59 mins \r\nAbridged Audiobook\r\n\r\n\r\nIn a novel that is at once wickedly funny and achingly poignant, Jonathan Tropper brings us an unforgettable hero: a young writer named Joe Goffman, whose sizzling first novel savaged everyone in his Connecticut hometown, then became a huge hit movie. Of course, Joe never planned on going home again, until now. In The Book of Joe, Tropper takes this irresistible premise and spins it into a hilarious and moving tale of growing up all over again.\r\n\r\nJoe's father lies in a coma, and Joe must return to the town he turned his back on seventeen years earlier. So with years of emotional baggage packed into the trunk of his shiny new Mercedes, Bush Fall's most notorious prodigal son is coming home.\r\nWithin hours of his arrival, Joe's return ignites a maelstrom of reaction. The basketball coach's wife throws a milkshake in his face. The town book club throws their copies of Joe's book at his house. And a jock-turned-thug threatens to blow up his car, or worse. Everyone's a critic.\r\n\r\nBut while Bush Falls may not be pleased to see Joe, it's becoming clear that Joe needed to see Bush Falls. As he walks the familiar streets of his hometown, Joe revisits the past he thought he'd purged in his book. After seventeen years of hiding from it, Joe is now ready to face his past, and with the help of some old friends, he could actually learn something...if he manages to survive the homecoming","torrent":{"xt":"urn:btih:48861e15494cc4117d897cb96fff875c6de4d6a1","amp;dn":"The+Book+of+Joe+abridged+audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48861e15494cc4117d897cb96fff875c6de4d6a1","infoHashBuffer":{"type":"Buffer","data":[72,134,30,21,73,76,196,17,125,137,124,185,111,255,135,92,109,228,214,161]},"announce":[],"urlList":[]}}