{"title":"Rigmar Radio Karaoke Collection 19600","uid":13092128,"size":1768406675,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4d17df0a056cd4f1b48f001b7a8a10ed7306cc79&amp;dn=Rigmar+Radio+Karaoke+Collection+19600&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":599,"time":1451062391,"description":"Was für ein Spaß! Der Buchstabe G enthält ein paar deutsche Karaoke Alben und dies ist der Beginn dieser Lieder.\r\n\r\nDa ich nicht sprechen oder schreiben Deutsch, haben die Anzahl der Fehler als diesen Spuren zu erhöhen nicht auf Rechtschreibung, Grammatik oder Tag errors prüft worden und die Dateinamen auch eine höhere percentage Fehler enthalten. Aber dies ist eine internationale Sammlung und ich habe deutsche Kunden.\r\n\r\nRigmar-Radio - Rockin die freie Welt seit 1967\r\n\r\nWhat Fun!  The letter G includes a few German Karaoke albums and this is the start of these songs.\r\n\r\nAs I do not speak or write German, the number of errors will increase as these tracks have not been checked for spelling, grammar or tag errors and the file names may also contain a higher percentage of mistakes.   But this is an international collection and I do have German clients.\r\n\r\nRigmar Radio - Rockin' the Free World since 1967\r\n\r\n¡Qué divertido! La letra G incluye algunos álbumes alemán de karaoke y este es el comienzo de estas canciones.\r\n\r\nComo yo no hablo o escribo alemán, el número de errores aumentarán ya que estas pistas no ha verificado su ortografía, gramática o etiqueta errors y los nombres de los archivos también puede contener una mayor porcentaje de errores. Pero esto es una colección internacional y tengo clientes alemanes.\r\n\r\nRigmar Radio - Rockin 'mundo libre desde 1967\r\n\r\nCe que c'est drôle! La lettre G comprend quelques albums allemande karaoké et ceci est le début de ces chansons.\r\n\r\nComme je ne parle pas ou écris allemand, le nombre d'erreurs augmentera à mesure que ces pistes ont pas été vérifiée pour l'orthographe, Grammar ou tag errors et les noms de fichiers peut également contenir un pourcentage plus élevé d'erreurs. Mais cela est une collection internationale et je fais avoir des clients allemands.\r\n\r\nRigmar Radio - Rockin 'le monde libre depuis 1967","torrent":{"xt":"urn:btih:4d17df0a056cd4f1b48f001b7a8a10ed7306cc79","amp;dn":"Rigmar+Radio+Karaoke+Collection+19600","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d17df0a056cd4f1b48f001b7a8a10ed7306cc79","infoHashBuffer":{"type":"Buffer","data":[77,23,223,10,5,108,212,241,180,143,0,27,122,138,16,237,115,6,204,121]},"announce":[],"urlList":[]}}