{"title":"TrickySpa Alyssa Lynn Moms A Pool Boy Addict Part One 1080p","uid":13268088,"size":613824503,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4e575e6b24ca0fe4d60acb0206b2c4957e32f907&amp;dn=TrickySpa+Alyssa+Lynn+Moms+A+Pool+Boy+Addict+Part+One+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1453362899,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/FGu\r\n \nhttp://imgsnaps.com/image/FGx\r\n\r\nDescription:\r\n\r\nWhat starts out to be your typical, normal day for this family, ends in a seductive tale of debauchery. Brad Knight catches his not so sweet and innocent stepmother Alyssa Lynn sucking the pool boy Rusty's cock right in the living room. Brad immediately calls his father to tell him what he just witnessed. The three have a family meeting, ending with Alyssa barely scolded for her slutty ways and unfortunately Brad ended up with the raw end of the deal, stuck with cleaning the pool now that Rusty Nails has been fired. Alyssa got a free pass on this one, even with her fake promises swearing she will never suck any other mans cock again! But brad is determined to make his stepmom pay for what she's done to his dad! After trying to do the pool job, Brad ends up frustrated and decides the only way to make her pay is to pull out a hidden camera, luring Alyssa to massage him, influencing her to follow her habits, knowing she cannot resist the taste of a big new cock in her mouth, especially if it's her stepson's! Without fail she falls for it, and Brad ends up with one of the best blowjobs he's ever had! Alyssa takes out her stepson's massive cock, surprised at what her boy has between the legs, and sucks it like a lollipop on her birthday, before hoping on top of his slick dick to see how it feels deep inside her horny pussy!","torrent":{"xt":"urn:btih:4e575e6b24ca0fe4d60acb0206b2c4957e32f907","amp;dn":"TrickySpa+Alyssa+Lynn+Moms+A+Pool+Boy+Addict+Part+One+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e575e6b24ca0fe4d60acb0206b2c4957e32f907","infoHashBuffer":{"type":"Buffer","data":[78,87,94,107,36,202,15,228,214,10,203,2,6,178,196,149,126,50,249,7]},"announce":[],"urlList":[]}}