{"title":"Sviatoslav Richter. The 100th Anniversary (2015)","uid":13096793,"size":1657887772,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e5e8d7fa6377996844a737f3cc06e7842fe5a89&amp;dn=Sviatoslav+Richter.+The+100th+Anniversary+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":57,"time":1451138733,"description":"Genre: Classical\r\nOrigin: Russia\r\nFormat: FLAC, tracks\r\nTT: 05h52'53&quot;\r\n\r\n01-01 Wolfgang Amadeus Mozart - Piano Concerto No. 27 in B-Flat Major, K. 595 I. Allegro\r\n01-02 Wolfgang Amadeus Mozart - Piano Concerto No. 27 in B-Fat Major, K. 595 II. Larghetto\r\n01-03 Wolfgang Amadeus Mozart - Piano Concerto No. 27 in B-Flat Major, K. 595 III. Allegro\r\n01-04 Wolfgang Amadeus Mozart - Piano Concerto No. 27 in B-Flat Major, K. 595 III. Allegro (Encore) [Live]\r\n01-05 Robert Schumann - Piano Concerto in A Minor, Op. 54 I. Allegro affettuoso\r\n01-06 Robert Schumann - Piano Concerto in A Minor, Op. 54 II. Intermezzo - Andantino grazioso\r\n01-07 Robert Schumann - Piano Concerto in A Minor, Op. 54 III. Allegro vivace\r\n02-01 Ludwig van Beethoven - Piano Sonata No. 18 in E-Flat Major, Op. 31, No. 3 I. Allegro\r\n02-02 Ludwig van Beethoven - Piano Sonata No. 18 in E-Flat Major, Op. 31, No. 3 II. Scherzo - Allegretto vivace\r\n02-03 Ludwig van Beethoven - Piano Sonata No. 18 in E-Flat Major, Op. 31, No. 3 III. Menuetto - Moderato e grazioso\r\n02-04 Ludwig van Beethoven - Piano Sonata No. 18 in E-Flat Major, Op. 31, No. 3 IV. Presto con fuoco\r\n02-05 Frederic Chopin - 12 Etudes, Op. 10 No. 12 in C Minor\r\n02-06 Franz Schubert - Piano Sonata No. 6 in E Minor, D. 566 I. Moderato\r\n02-07 Franz Schubert - Piano Sonata No. 6 in E Minor, D. 566 II. Scherzo - Allegro vivace\r\n02-08 Franz Schubert - Piano Sonata No. 6 in E Minor, D. 566 III. Allegretto\r\n02-09 Franz Liszt - Concerto Pathetique, S. 258\r\n03-01 Ludwig van Beethoven - Piano Sonata No. 32 in C Minor, Op. 111 I. Maestoso Allegro con brio ed appassionato\r\n03-02 Ludwig van Beethoven - Piano Sonata No. 32 in C Minor, Op. 111 II. Arietta - Adagio molto semplice e cantabile\r\n03-03 Ludwig van Beethoven - 6 Bagatelles, Op. 126 No. 1 in G Major (Encore) [Live]\r\n03-04 Frederic Chopin - Nocturnes, Op. 9 No. 3 in B Major\r\n03-05 Richard Wagner - Elegie, WWV 93\r\n03-06 Claude Debussy - Images, Book 1, L. 110 I. Reflets dans l'eau\r\n03-07 Claude Debussy - Images, Book 1, L. 110 II. Hommage a Rameau\r\n03-08 Claude Debussy - Images, Book 1, L. 110 III. Mouvement\r\n03-09 Claude Debussy - Hommage a Joseph Haydn, L. 115 (Encore) [Live]\r\n03-10 Sergey Rachmaninoff - 13 Preludes, Op. 32 No. 1 in C Major\r\n03-11 Sergey Rachmaninoff - 10 Preludes, Op. 23 No. 8 in A-Flat Major\r\n03-12 Sergey Rachmaninoff - 10 Preludes, Op. 23 No. 7 in C Minor\r\n04-01 Ludwig van Beethoven - Piano Sonata No. 1 in F minor, Op. 2, No. 1 I. Allegro\r\n04-02 Ludwig van Beethoven - Piano Sonata No. 1 in F minor, Op. 2, No. 1 II. Adagio\r\n04-03 Ludwig van Beethoven - Piano Sonata No. 1 in F minor, Op. 2, No. 1 III. Menuetto - Allegretto\r\n04-04 Ludwig van Beethoven - Piano Sonata No. 1 in F minor, Op. 2, No. 1 IV. Prestissimo\r\n04-05 Robert Schumann - Faschingsschwank aus Wien, Op. 26 I. Allegro\r\n04-06 Robert Schumann - Faschingsschwank aus Wien, Op. 26 II. Romanze\r\n04-07 Robert Schumann - Faschingsschwank aus Wien, Op. 26 III. Scherzino\r\n04-08 Robert Schumann - Faschingsschwank aus Wien, Op. 26 IV. Intermezzo\r\n04-09 Robert Schumann - Faschingsschwank aus Wien, Op. 26 V. Finale\r\n04-10 Frederic Chopin - Polonaise-Fantaisie in A-Flat Major, Op. 61\r\n04-11 Frederic Chopin - Waltzes, Op. 34 No. 3 in F Major\r\n04-12 Frederic Chopin - Waltzes, Op. 70 No. 3 in D-Flat Major\r\n04-13 Frederic Chopin - Mazurkas, Op. 63 No. 3 in C-Sharp Minor\r\n04-14 Frederic Chopin - Mazurkas, Op. Posth. 67 No. 3 in C Major\r\n04-15 Frederic Chopin - Mazurkas, Op. Posth. 68 No. 3 in F Major\r\n04-16 Frederic Chopin - Mazurka in A Minor, B. 140\r\n05-01 Cesar Franck - Piano Trio in F-Sharp Minor, Op. 1, No. 1, FWV 1 I. Andante con moto\r\n05-02 Cesar Franck - Piano Trio in F-Sharp Minor, Op. 1, No. 1, FWV 1 II. Allegro molto\r\n05-03 Cesar Franck - Piano Trio in F-Sharp Minor, Op. 1, No. 1, FWV 1 III. Finale - Allegro maestoso\r\n05-04 Maurice Ravel - Piano Trio in A Minor, M. 67 I. Modere\r\n05-05 Maurice Ravel - Piano Trio in A Minor, M. 67 II. Pantoum - Assez vif\r\n05-06 Maurice Ravel - Piano Trio in A Minor, M. 67 III. Passacaille - Tres large\r\n05-07 Maurice Ravel - Piano Trio in A Minor, M. 67 IV. Final - Anime\r\n05-08 Maurice Ravel - Piano Trio in A Minor, M. 67 IV. Final - Anime (Encore) [Live]\r\n05-09 Ernest Chausson - 7 Melodies, Op. 2 VII. Le Colibri (Live) [Bonus Track]\r\n05-10 Ernest Chausson - Poeme de l'amour et de la mer, Op. 19 III. Le temps de lilas (Live) [Bonus Track]\r\n05-11 Maurice Ravel - 5 Melodies populaires grecques (Live) [Bonus Track]\r\n\r\nSviatoslav Richter – Piano","torrent":{"xt":"urn:btih:4e5e8d7fa6377996844a737f3cc06e7842fe5a89","amp;dn":"Sviatoslav+Richter.+The+100th+Anniversary+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e5e8d7fa6377996844a737f3cc06e7842fe5a89","infoHashBuffer":{"type":"Buffer","data":[78,94,141,127,166,55,121,150,132,74,115,127,60,192,110,120,66,254,90,137]},"announce":[],"urlList":[]}}