{"title":"Commando Cody (1953) Old Time Serial OTS","uid":13105958,"size":2513169593,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f83727f4267dd757050646e5c5c4c91ee9823e6&amp;dn=Commando+Cody+%281953%29+Old+Time+Serial+OTS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MikeyMoMo","files":13,"time":1451290419,"description":"From 1953, in glorious Black and White comes Commando Cody in 12 episodes.  These are longer than average.  About 30 minutes each.\r\n\r\nIf you like this kind of presentation, then vote for more by SEEDING IT!  Nobody has unlimited bandwidth and we need help keeping it seeded and KEEPING it seeded.  Vote for more by seeding this for ever or at least until the power goes off and/or the earth goes flat.  I will try to keep it available as much as possible but there are so many that I can't do it all.  Over a hundred still to go.  Need help, folks.  Enjoy and keep it active, please.\r\n\r\nAbout the serial...\r\n\r\nIt is the near future as seen from the perspective of the early 1950s. Earth is in radio contact with civilizations on planets in our solar system, as well as planets in other, distant solar systems, and Commando Cody has just built the world's first spaceship.\r\n\r\nCommando Cody: Sky Marshal of the Universe takes place in the near future as seen from the 1950s. Earth is in radio contact with civilizations on the other planets, and Commando Cody has just secretly built the earth's first space ship, but the rest of the world still appears just as you would expect in the early 1950s. In each episode, a human-looking alien named the Ruler tries to take over the earth with a new scheme, each one designed to make the maximum use of Republic Pictures stock footage of various disasters and action longshots. \r\n\r\nThe Commando Cody character had been introduced in the cliffhanger film serial Radar Men from the Moon, to which this TV series is a prequel. The first episode shows Joan and Ted, Cody's established sidekicks in Radar Men, applying for their jobs and meeting Cody for the first time.  Cody also uses the Rocket Man costume from King of the Rocket Men.  Some of the elements were also taken from other Republic serials such as The Purple Monster Strikes.\r\n\r\nWhen not not in the Rocket Man suit, Cody wears a black military tunic with many insignia and a black mask, instead of the business suit from the serial.  (Holdren suspected that the mask was due to the producers not wanting to take the chance that he might walk out after demanding more money, as Clayton Moore had done on The Lone Ranger. The mask would presumably serve to conceal the change of actor if the part had to be recast, although this had not worked in the case of the Lone Ranger.)\r\n\r\nCody and his associates communicate with each other using special badges that conceal two-way radios, presaging similar badges on Star Trek. There are a number of futuristic props and sets, as well as many shots of the intricate model-rocket special effects work of Howard and Theodore Lydecker.  Also, a number of space-concept scenes were filmed that had not been seen before in the Republic serials, including &quot;space walks&quot; for several repair missions; aerial raygun fights between &quot;hero&quot; and &quot;enemy&quot; spaceships; and a black, starry exterior background when Cody's or the villain's ships were shown outside the earth's atmosphere.\r\n\r\nAlthough Commando Cody was originally filmed as a TV series, union contract problems forced Republic to release the twelve 30-minute episodes to theaters in 1953. They did not air on NBC stations until the summer of 1955, with each episode slightly edited to 25 minutes to accommodate commercials.  Like the episodes of a serial, they built on each other, and were intended to be shown in chronological order.  But they lacked the cliffhanger endings which had characterized true serials for several decades, and reference works on serials generally exclude Commando Cody.\r\n\r\nThere was a fairly long break between the filming of the first three and the last nine episodes, during which Republic set about filming Zombies of the Stratosphere, also starring Judd Holdren and Aline Towne. Intended to be another Cody serial, and the direct sequel to Radar Men from the Moon, it was subject to last-minute revisions of principal character names, and Holdren's &quot;Cody&quot; character became &quot;Larry Martin.&quot;  So when the third episode of &quot;Commando Cody&quot; was filmed and it showed the apparent death of the Ruler, there was speculation that Republic may have considered abandoning the remaining nine episodes and instead simply converting the three it had filmed into a feature film.\r\n\r\nOnce they finally resumed work on Commando Cody, Republic had also lost the services of William Schallert as Cody's male colleague. A replacement was found in Richard Crane, a year before his tour of duty as Rocky Jones, Space Ranger. The Ruler also gained a female sidekick, played by Gloria Pall, although she had almost no dialog","torrent":{"xt":"urn:btih:4f83727f4267dd757050646e5c5c4c91ee9823e6","amp;dn":"Commando+Cody+%281953%29+Old+Time+Serial+OTS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f83727f4267dd757050646e5c5c4c91ee9823e6","infoHashBuffer":{"type":"Buffer","data":[79,131,114,127,66,103,221,117,112,80,100,110,92,92,76,145,238,152,35,230]},"announce":[],"urlList":[]}}