{"title":"FakeHospital - Nikky (Nurse watches as sexy couple fuck)","uid":13157196,"size":889309339,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5131f389ec365e161d1c8e1fb9a3a0fddda5c1f2&amp;dn=FakeHospital+-+Nikky+%28Nurse+watches+as+sexy+couple+fuck%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SudoSu","files":1,"time":1452114592,"description":"\nhttp://youpornbook.com\r\n\r\n―――――――――――――――――――――\r\n ... : Screens : ... \r\n――――――――――――――――――――― \nhttp://imgkiss.com/image/tfY9K \nhttp://imgkiss.com/image/tfnEr\r\n\r\n――――――――――――――――――――――\r\n  .... : Info : ....  \r\n――――――――――――――――――――――\r\nI was in a spot of bother here, the stud who I'd been giving a special examination to had just filled my pussy with a big creampie and his girlfriend had just walked in on us. She stormed out of the room and I had to go after her quickly to diffuse the situation. I found her in the waiting room toilets and at first she wouldn’t let me in to talk to her. When she did unlock the door I tried to comfort her, telling her to come back into the office and I would explain everything. When she returned with me I quickly told her that we had been testing her boyfriend to see if it was something he was doing that was causing her pain during intercourse. She was skeptical at first, but when I suggested I examine her like I had her boyfriend, as I had found no fault with him, she agreed. \r\n\r\nI got her to lay on her back as I wanted to test her vagina moistness levels as I believed he was hurting her as she wasn't wet and ready when they would begin to fuck. I gently licked her labia lips and she shuddered with pleasure. I didn't want to push my luck too far with this woman, so I told her I wanted to see how her and her boyfriend had sex to see if I could spot the problem. They were soon fucking in front of me and I could see the problem was that the stud would start off too quickly when she wasn't wet enough and not in a state of euphoria. With my guidance they fucked in several beautiful positions and we solved her problem of feeling pain during intercourse. After she enjoyed her first sex session in a long time, her boyfriend shot his cum all over her mouth as she lay down on the examining table. Another successful cure, I'm relieved I managed to diffuse what could have been a difficult situation. Hope you enjoy watching this sexy couple fuck as much as I did. \r\n\r\nMore exclusive porn at:  https://thepiratebay.ms/user/SudoSu/","torrent":{"xt":"urn:btih:5131f389ec365e161d1c8e1fb9a3a0fddda5c1f2","amp;dn":"FakeHospital+-+Nikky+%28Nurse+watches+as+sexy+couple+fuck%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5131f389ec365e161d1c8e1fb9a3a0fddda5c1f2","infoHashBuffer":{"type":"Buffer","data":[81,49,243,137,236,54,94,22,29,28,142,31,185,163,160,253,221,165,193,242]},"announce":[],"urlList":[]}}