{"title":"BBC Planet Oil 2015 Complete 1080p","uid":14717660,"size":5214152002,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:51cd7b475bfa0292716093fa7a0cf4490b9f61ff&amp;dn=BBC+Planet+Oil+2015+Complete+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"baltic8","files":3,"time":1464483213,"description":"Information\r\n------------------------------\r\nProfessor Iain Stewart explores the importance of oil and how the world has become so reliant on it in little over the span of a human lifetime.\r\n\r\n1)  How Oil Made Us \r\nFrom the moment we first drilled for oil, we opened a Pandora's box that changed the world forever. It transformed the way we lived our lives, spawned foreign wars and turned a simple natural resource into the most powerful political weapon the world has ever known. But when exactly did geology turn into such a high-stakes game? In this series, Professor Iain Stewart visits the places that gave birth to the earth's oil riches, discovers the people who fought over its control and supply, and explores how our insatiable thirst for oil is changing the very planet on which we depend. It's a journey that will help us answer a fundamental question - how did we become so addicted to oil in little more than one human lifetime?\r\n\r\n2)  The Carbon Wars \r\nBy the early 1950s, a holy trinity of oil, plastics and fertilisers had transformed the planet. But as Professor Iain Stewart reveals, when the oil producing countries demanded a greater share in profits from the Western energy companies, the oil and gas fields of the Middle East became a focus for coup d'états and military conflict. In the North Sea, Prof Stewart recalls the race against time to find alternative supplies in the shallow, but turbulent waters both here and in America's Gulf coast. The offshore discoveries in the 1970 proved to be a game changer. It marked an engineering revolution; the moment when 'difficult' oil and gas (previously unviable sources) could be commercially produced from the ocean depths. It was the moment when Western Europe and the US finally unshackled themselves from their 20th century energy security nightmare.\r\n\r\n3)  Climate Wars \r\nAs we entered the 21st century, the world was guzzling oil, coal and gas like never before. Despite fears of 'peak oil', Professor Iain Stewart discovers that while huge technological advances are helping extend the life of existing oilfields, new unconventional oil and gas supplies like shale gas and tar sands are extending the hydrocarbon age well into the 21st century. Given there's plenty of fossil fuels still in the ground, the spectre of climate change has forced many to ask can we really afford to burn what's left? In this concluding episode, Iain Stewart argues we face a stark choice. Do we continue feed our addiction - suck Planet Oil dry - and risk catastrophic climate change, or do we go hell for leather for alternative energy sources; nuclear, renewables, to make the transition from our fossil fuel past to a low carbon future. In which case, how do we make that shift?\r\n\r\n * Video Codec: x264 CABAC    CRF 23 1920x1080\r\n * Audio Codec: AAC-LC Q=0.45 VBR 44.1KHz\r\n * Audio Channels: 2\r\n * Run-Time: 59 mins\r\n * Number of Parts: 3","torrent":{"xt":"urn:btih:51cd7b475bfa0292716093fa7a0cf4490b9f61ff","amp;dn":"BBC+Planet+Oil+2015+Complete+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51cd7b475bfa0292716093fa7a0cf4490b9f61ff","infoHashBuffer":{"type":"Buffer","data":[81,205,123,71,91,250,2,146,113,96,147,250,122,12,244,73,11,159,97,255]},"announce":[],"urlList":[]}}