{"title":"Giga-ROM 2.0 Shareware CD - Classic Mac 1992","uid":13074470,"size":553849600,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:51eaec0b65e267cc9b0c32aff2ef86d706154d1b&amp;dn=Giga-ROM+2.0+Shareware+CD+-+Classic+Mac+1992&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1450824955,"description":"\nCongratulations! The Giga-ROM Archives version 2.0 is the largest collection of Macintosh software ever assembled on a CD-ROM. \r\n\r\nThere are 13,277 archives on this disc representing over 1.7 gigabytes (1,700 megabytes) of Macintosh shareware, freeware and public domain files.\r\n\r\n\r\nUsing Compact Pro \r\n\tMost of the files are archived in Bill GoodmanÕs Compact Pro format. The Compact Pro archiving program is included on the disc in a folder on the root level of the CD-ROM.\r\n\tTake the time to print out the release notes and the user guide, then consider registering your copy of the Compact Pro program. A handy order form is included for your convenience.\r\n\r\nTo de-archive a file, follow these simple instructions:\r\n\r\n1. Install the Compact Pro program on your hard drive.\r\n2. Copy the archived file(s) you wish to open to your hard drive.\r\n3. Double click the archive you wish to open. The Compact Pro \r\n\tprogram will launch automatically, or in some cases, the file \r\n\twill de-archive itself without launching the program.\r\n4. If the file launches Compact Pro, a screen will come up giving you \r\n\ta chance to register your copy of Compact Pro (if you have not \r\n\talready done so). Choose register to enter your name and \r\n\tregistration number. Otherwise, choose the button labeled Not \r\n\tYet. Your archive will appear in a new window showing the \r\n\tfile(s) available to de-archive. Click on (choose) the file(s) you \r\n\twish to remove from the archive. ÒCommand EÓ will extract \r\n\tthe chosen files and allow you to place them somewhere on \r\n\tyour hard disk.\r\n5. To open another archive, choose ÒCommand OÓ (not zero) or look \r\n\tunder the file menu for ÒOpenÓ with your mouse.\r\n\r\n\tCompact Pro is one of the best shareware programs on the market today. We recommend, as the author suggests, that you register your copy after the first 30 days of use. Bill Goodman deserves your support for this excellent program. Your $25 payment will earn you registered user status and will allow Bill to advise you of regular updates","torrent":{"xt":"urn:btih:51eaec0b65e267cc9b0c32aff2ef86d706154d1b","amp;dn":"Giga-ROM+2.0+Shareware+CD+-+Classic+Mac+1992","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51eaec0b65e267cc9b0c32aff2ef86d706154d1b","infoHashBuffer":{"type":"Buffer","data":[81,234,236,11,101,226,103,204,155,12,50,175,242,239,134,215,6,21,77,27]},"announce":[],"urlList":[]}}