{"title":"WinRAR 5.31 (x86/x64) Final [ENG]","uid":13425563,"size":4253719,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:54181ca865208d7c9f1c5d3d60e8546e364de4d2&amp;dn=WinRAR+5.31+%28x86%2Fx64%29+Final+%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":6,"time":1454589092,"description":"WinRAR is a powerful archive manager (Win86/64, Linux, Mac). RAR files can usually compress content by 8 percent to 15 percent more than ZIP files can. WinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives. It can backup your data and reduce size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\r\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well. WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries.\r\n\r\n WinRAR - What's new in the latest version\r\n\r\n\r\n   Version 5.31\r\n\r\n   1. Following issues are corrected in Windows high DPI mode:\r\n\r\n      a) if text size in Windows settings was set to 150% or larger,\r\n         the font size in WinRAR help was not increased accordingly,\r\n         resulting in too small text;\r\n\r\n      b) default columns width in WinRAR file list was less\r\n         than expected for 125% or larger Windows text setting.\r\n\r\n   2. Interface improvements for right to left languages:\r\n\r\n      a) proper text alignment in simple WinRAR prompts, such as\r\n         confirmations to delete archived files or to clear the log file;\r\n\r\n      b) &quot;OK&quot;, &quot;Cancel&quot;, &quot;Help&quot; buttons in multi-page dialogs,\r\n         such as archiving and extraction options or WinRAR settings,\r\n         are aligned correctly and translated to default Windows\r\n         display language.\r\n\r\n   3. Bugs fixed:\r\n\r\n      a) WinRAR SFX module could load DLL libraries from its own executable\r\n         folder as a result of calling some Windows API functions.\r\n         It could lead to security threat if DLL files with malicious code\r\n         were stored in the same folder as SFX archive. Now SFX module\r\n         takes additional steps to prevent such situation in Windows Vista\r\n         and newer.\r\n\r\n         Be aware that users without latest Windows security patches\r\n         installed also as Windows XP users still can be affected,\r\n         so they must be especially careful to run SFX archive from\r\n         a folder without suspicious DLL files;\r\n      \r\n      b) WinRAR 5.30 failed to run .lnk files from file list.\r\n\r\nHome Page www.rarlab.com\r\nInterface: english","torrent":{"xt":"urn:btih:54181ca865208d7c9f1c5d3d60e8546e364de4d2","amp;dn":"WinRAR+5.31+%28x86%2Fx64%29+Final+%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54181ca865208d7c9f1c5d3d60e8546e364de4d2","infoHashBuffer":{"type":"Buffer","data":[84,24,28,168,101,32,141,124,159,28,93,61,96,232,84,110,54,77,228,210]},"announce":[],"urlList":[]}}