{"title":"Talisman The Horus Heresy v1.13 full [apkpita]","uid":15059209,"size":102176888,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5501a8c9a7630f505323dba89325ed74d87343ea&amp;dn=Talisman+The+Horus+Heresy+v1.13+full+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1466748576,"description":"Talisman: The Horus Heresy is a digital board game based on the Talisman rule system and set in the Warhammer 40,000 universe, during the cataclysmic events of the Horus Heresy.\r\n\r\nUp to four players will be able to take control of one or more of the galaxy’s greatest heroes or most notorious villains. Taking the side of either traitor or loyalist, these Warlords will form vast companies of Space Marines, battalions of tanks and battlefleets of Spacecraft. They are the most powerful beings in the Galaxy and their followers are legion.\r\n\r\nThe new combative team play will appeal to fans of Talisman and the Horus Heresy alike. It’s a unique adaptation of Talisman that has been tailored specifically for digital platforms.\r\n\r\nIn Talisman: The Horus Heresy the player’s experience of Talisman is scaled up exponentially, exploring not a kingdom but a whole galaxy in the 31st Millennium. No longer will you be fighting for the Crown of Command, but for the very future of humanity…\r\n\r\n- Command one of the eighteen Space Marine Legions that fought during the Horus Heresy\r\n- Play as one of eight of the galaxy’s greatest heroes or most notorious villains such as Roboute Guilliman or Angron\r\n- Multiplayer for up to 4 players\r\n- Challenge or team-up with your friends locally and online\r\n- Play against AI opponents\r\n\r\n\r\n&quot;This reimagining of the classic Talisman gameplay in the Warhammer 40k universe is one of the most gorgeous digital board games I have ever seen.&quot; - Brad Cummings, Boardgamegeek.com\r\n\r\n\r\nWhat’s new:\r\nThe Isstvan Campaign expansion has been added!\r\nIncludes 7 new playable Warlords, many new Stratagems and Dataslates plus the whole Isstvan System region to explore.\r\nThe new Warlords are -\r\nFulgrim, Perturabo, Armillus Dynat, Ferrus Manus, Nathaniel Garro, Saul Tarvitz and 18 Chaplain variants.\r\nPlus many bug fixes and other improvements including support for Gamer IDs.\r\n\r\nRequirements: Android OS 2.3 and up","torrent":{"xt":"urn:btih:5501a8c9a7630f505323dba89325ed74d87343ea","amp;dn":"Talisman+The+Horus+Heresy+v1.13+full+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5501a8c9a7630f505323dba89325ed74d87343ea","infoHashBuffer":{"type":"Buffer","data":[85,1,168,201,167,99,15,80,83,35,219,168,147,37,237,116,216,115,67,234]},"announce":[],"urlList":[]}}