{"title":"Kenrick Cleveland &quot;Dark Side&quot; (plus)","uid":13073701,"size":3742511543,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:56537b83b19f87bb7720161ebf3c2589461edd49&amp;dn=Kenrick+Cleveland+%26quot%3BDark+Side%26quot%3B+%28plus%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":null,"files":42,"time":1450818685,"description":"This is the Kenrick Cleveland &quot;Dark Side&quot; material.\r\n\r\nKenrick is one of the best NLP teachers out there. Once you learn the difference between dark patterns and the ones used for positive growth you'll understand why he's so good. He is one of the few teachers of these advanced techniques out there that doesn't use dark patterns on his students while he teaches them (see Richard Bandler for a good example of a douche bag NLP master that uses dark patterns while he teaches the material).\r\n\r\nI uploaded this to go along with nutterbutter's Systema torrent Beyond the Physical. Both work along similar concepts, which you could think of as manipulation of source energy and conscious action through applied intent.\r\n\r\nUse these techniques with caution. I share this with you as it was shared with me not so you can use them to mess with people (though with the proper application they make things like job interviews and police encounters alot easier) but so that you can tell when such techniques are used against you in your everyday life. Please be nice when you use these.\r\n\r\nI also included some extra Kenrick Cleveland NLP material (Advanced Hypnosis Training, Unconscious Persuasion, &amp; Advanced Review and Social Influence Skills). You don't have to download those too unless you are really interested in NLP (they are excellent learning tools). It is the Dark Side material that i thought relevant to the discussion and wanted to share with this community.\r\n\r\n:D Viva la Concen","torrent":{"xt":"urn:btih:56537b83b19f87bb7720161ebf3c2589461edd49","amp;dn":"Kenrick+Cleveland+%26quot%3BDark+Side%26quot%3B+%28plus%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56537b83b19f87bb7720161ebf3c2589461edd49","infoHashBuffer":{"type":"Buffer","data":[86,83,123,131,177,159,135,187,119,32,22,30,191,60,37,137,70,30,221,73]},"announce":[],"urlList":[]}}