{"title":"Yappy Hour - Diana Orgain","uid":13350781,"size":1450967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58090c19944175d46f8bd0544aec413ca232f4ad&amp;dn=Yappy+Hour+-+Diana+Orgain&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1454085070,"description":"A rollicking start to a new cozy series from USA Today bestselling author Diana Orgain, featuring a loveable heroine and a colorful band of dog lovers who gather regularly with their pets at their local watering hole\r\n\r\nWith side-splitting humor, an irresistible cast of characters-both human and canine-and an intimate small town setting, Yappy Hour is sure to delight fans of Rita Mae Brown and Diane Kelly. Every Friday night in the idyllic seaside town of Pacific Cove, CA, the Roundup Crew, a group of dog-loving friends, meet at a neighborhood wine bar for Yappy Hour. When Rachel, the owner, mysteriously leaves town and asks her sister, Maggie (who is neither pet friendly nor business savvy), to run the bar in her absence, things get complicated fast. Maggie arrives to open up and finds a body sprawled on the floor, and even worse, an incriminating letter with Rachel's name on it nearby. On impulse, she hides the letter from the hunky detective, Officer Brad Brooks, who's dispatched to the scene.\r\n\r\nWhen Rachel is declared the top suspect by the police, Maggie decides to investigate on her own. She reopens the bar and gets to know the members of the Roundup Crew, including chief organizer Yolanda, who never goes anywhere without her signature strappy stilettos or her Yorkie Beepo. Maggie juggles searching for clues, trying to locate Rachel, and serving up Doggie Daiquiris, Muttguaritas and homemade Arf D'Oeuvres-until another body turns up. The Roundup Crew must step in and save the bar, and it seems the only way to do that will be to solve the mystery and turn Maggie into a dog-lover in this charming, light-hearted cozy","torrent":{"xt":"urn:btih:58090c19944175d46f8bd0544aec413ca232f4ad","amp;dn":"Yappy+Hour+-+Diana+Orgain","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58090c19944175d46f8bd0544aec413ca232f4ad","infoHashBuffer":{"type":"Buffer","data":[88,9,12,25,148,65,117,212,111,139,208,84,74,236,65,60,162,50,244,173]},"announce":[],"urlList":[]}}