{"title":"[NubilesPorn] - Amanda Aims, Ariana Marie [NEW January 29, 2016]","uid":13364941,"size":235606497,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:59bafe8c6414a2bb215d29445d5125747e1c6a6c&amp;dn=%5BNubilesPorn%5D+-+Amanda+Aims%2C+Ariana+Marie+%5BNEW+January+29%2C+2016%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1454159564,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/FxP\r\n \nhttp://imgsnaps.com/image/FxR\r\n \nhttp://imgsnaps.com/image/FxY\r\n\r\n\r\nAmanda Aims and Ariana Marie are just arrived from school and still in their uniforms as they look through Johnny Castleâ™s wallet. He insists on inspecting the girls thoroughly to make sure they havenâ™t stolen anything from him, and when he assures that the girls donâ™t have any of his possessions he bends them over and spanks them. Ariana offers to make it up to Johnny, and when he hesitates, the girls both drop to their knees and offer to suck his cock. Pulling Johnnyâ™s dick from his pants, the two girls work together to lick and suck every inch of his hard shaft. Then they continue their seduction efforts by peeling off each otherâ™s shirts so that they can latch their mouths on to one anotherâ™s tits as Johnny watches the lesbian display. When the girls flip up their miniskirts and lay side by side on the bed with their creamy pussies ready and willing for Johnnyâ™s possession, he finally relents. First Johnny samples each of the girlsâ™ snatches with his fingers as he makes sure theyâ™ve both removed their underwear. Liking what he finds, he pushes his cock deep into first Amandaâ™s tight twat and then Arianaâ™s. When the girls roll onto their knees to offer themselves for a doggy style pussy pounding, Johnny is quick to indulge them in this new position, too. From there, Amanda gets brave enough to climb on to Johnnyâ™s member in a reverse cowgirl stiffie ride that leaves her panting her climax. When Johnny claims to be getting close, Ariana is right there to take his load of cum in her waiting open mouth so that she can snowball the hot jizz with her friend in a long wet kiss","torrent":{"xt":"urn:btih:59bafe8c6414a2bb215d29445d5125747e1c6a6c","amp;dn":"%5BNubilesPorn%5D+-+Amanda+Aims%2C+Ariana+Marie+%5BNEW+January+29%2C+2016%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59bafe8c6414a2bb215d29445d5125747e1c6a6c","infoHashBuffer":{"type":"Buffer","data":[89,186,254,140,100,20,162,187,33,93,41,68,93,81,37,116,126,28,106,108]},"announce":[],"urlList":[]}}