{"title":"Real Truth News Video Collection","uid":14941803,"size":13637696985,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:59c4b87901c4262068b6d20610fa11eaa2a6dc30&amp;dn=Real+Truth+News+Video+Collection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":544,"time":1466024691,"description":"This is an archive containing backups of four highly recommended channels, likely requested from someone living in Europe. The four channels were Face Of A Dying Nation, Death of Nations, This is Europa along with The Horrible Truths We All Need to See.\r\n\r\nThis video collection exposes the damage caused by corrupt officials within the EU and by many nations' treasonous leaders. Make no mistake, it is no Jewish conspiracy orchestrating this deliberate destabilization, however oligarchs like George Soros and his NGOs (such as Amnesty International) are heavily involved. \r\n\r\nThe purpose behind open borders/amnesty is to deliberately destabilize Europe by allowing illegals to flood across the borders, in order to justify a police state, setup some patsies (migrants) to blame for the next financial collapse, as well, to wreck the sovereignty of Europe before the installation of the &quot;New World Order&quot; where national sovereignty is deemed a threat by the criminal elite. \r\n\r\nThis is not about &quot;diversity&quot;, it is about white genocide and the subjugation of Europe by a treasonous parasitic political elite class.\r\n\r\nTrump had to cancel the Chicago rally in the final hour last night and I believe I know why:\r\n\r\nThe same Soros funded rioters that showed up in Ferguson are now being paid to go after Trump. Remember, the mayor of Ferguson clearly stated several times that the rioters were not from Ferguson, and that they had been brought in from somewhere. These are thugs for hire, they stage false flag riots everywhere, will be violent, and were probably beyond a doubt used on Trump last night.\r\n\r\nIt probably was a good idea for Trump to have cancelled the rally, because reports state that several thousand of these violent protesters showed up and that the police figured out they were going to storm the stage. If they did, they would probably have killed Trump. It does not matter if the Soros club crashes Trump's plane via remote, or shoots him in the head with a bullet, or gets him crushed under a paid mob, their mission will be accomplished even if Trump chokes to death on a twinkie.\r\n\r\nNow, Trump has said a few things I do not like, however, there are a couple key things with Trump that make him, in my opinion, the only viable candidate. 1. He is not a member of a secret society. 2. He is honest. The cabal cannot allow an honest man to set foot in the white house for even an hour. If an honest man who actually cares about the country (and Trump does) ever sets foot in the white house, head will roll and the people who have hijacked this country will face dire consequences","torrent":{"xt":"urn:btih:59c4b87901c4262068b6d20610fa11eaa2a6dc30","amp;dn":"Real+Truth+News+Video+Collection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c4b87901c4262068b6d20610fa11eaa2a6dc30","infoHashBuffer":{"type":"Buffer","data":[89,196,184,121,1,196,38,32,104,182,210,6,16,250,17,234,162,166,220,48]},"announce":[],"urlList":[]}}