{"title":"HandsOnHardcore - Kimber Delice ** NEW 11 January 2016 **","uid":13196964,"size":824144143,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5fb6235792143adc4673da6af85ec496810e3b99&amp;dn=HandsOnHardcore+-+Kimber+Delice+%2A%2A+NEW+11+January+2016+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SudoSu","files":1,"time":1452503215,"description":"\nhttp://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――   \nhttp://imgpremium.com/album/oW\r\n\r\nYear: 2016\r\nGenre: Anal creampie, Anal, Cum in mouth, Cum on ass, Facial, Handjob, Hardcore, Group sex, DP, Blowjob\r\nDuration: 00:23:25\r\n\r\nThe young and lovely Kimber Delice is a gorgeous blonde babe from France and seduces her friend David Perry in today's DDF Network firework of hardcore sex. She gets her hot pussy licked while sitting on the kitchen counter and the eclectic panties in black and white provide a gap for her pink pussy lips to pop out. David crams her twat with his tongue before she returns the favor with a handjob and cock sucking. Their two lads Choky Ice and Thomas Stone swing by and are surprised about the couple getting down on the couch, but soon join the two and make your wildest foursome fantasies come true! She gets her tight twat banged doggy style while sucking Choky's dick and massaging her hubby's balls. The scene heats up when they start stuffing her anus with their hard pricks and the teenage looking babe receives some double penetration while sucking the Stone cock. Her fuckholes are crammed with hard meat while the studs lick her hard nipples and play with her beautiful natural 38A tits. After unplugging her derriere, she gives us an ass gape which makes your jaw drop down to your boner! The slim and acrobatic girl gets fucked on that couch and finally receives a big load of cum in her gaping ass before David shoots his cum in her mouth and Choky creates a sperm mess on her twat! This is hardcore adult entertainment at its finest!\r\n\r\nMore exclusive porn at:  https://thepiratebay.ms/user/SudoSu/","torrent":{"xt":"urn:btih:5fb6235792143adc4673da6af85ec496810e3b99","amp;dn":"HandsOnHardcore+-+Kimber+Delice+%2A%2A+NEW+11+January+2016+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fb6235792143adc4673da6af85ec496810e3b99","infoHashBuffer":{"type":"Buffer","data":[95,182,35,87,146,20,58,220,70,115,218,106,248,94,196,150,129,14,59,153]},"announce":[],"urlList":[]}}