{"title":"Hidden Secrets - Part 78 - Scientific Opinion For Sale","uid":13260910,"size":8374295915,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:641f63d2510ad6790fe9d6332d9a11cb3051a90d&amp;dn=Hidden+Secrets+-+Part+78+-+Scientific+Opinion+For+Sale&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":32,"time":1453274324,"description":"\nHidden Secrets - Part 78 - Scientific Opinion For Sale\r\n\r\nScientists Under Attack (2009) FULL Documentary GMO:\r\nJourneyman Pictures presents a documentary on the recent onslaught against scientists who expose the falsehoods promoted as scientific facts for the industrial complex. This expose asks the important question of can we still trust our scientists? This documentary explores how the heavy hand of the agriculture industry is steering ‘science’ towards its own interests, eliminating legitimate research and silencing any critical opinions. Taking a close look at genetic engineering and the powerful vested interests that dominate its research, ‘Scientists Under Attack’ reveals the frightening reality of modern science, as objective investigation is corrupted by corporate money.\r\n----------------------------------------------------------------------------------------------------------\r\n\r\nStephen Crothers Eradicates Nonsense - 2nd Rational Physics Conference:\r\nStephen J. Crothers is an Australian mathematician who presents the case that Black Holes and the Big Bang have been created by theorists and never observed.\r\n----------------------------------------------------------------------------------------------------------\r\n\r\nBBC Horizon 2011 Science Under Attack:\r\nOriginal Broadcast January 24 2011 with Nobel Prize winner Sir Paul Nurse who examines why science appears to be under attack, and why public trust in key scientific theories has been eroded - from the theory that man-made climate change is warming our planet, to the safety of GM food, or that HIV causes AIDS.\r\n\r\nHe interviews scientists and campaigners from both sides of the climate change debate, and travels to New York to meet Tony, who has HIV but doesn't believe that that the virus is responsible for AIDS.\r\n\r\nThis is a passionate defence of the importance of scientific evidence and the power of experiment, and a look at what scientists themselves need to do to earn trust in controversial areas of science in the 21st century.\r\n----------------------------------------------------------------------------------------------------------\r\n\r\nSuppressed Science - Inventing the Impossible:\r\nFrom UFOTV®, accept no imitations. Free Energy, German Anti-Gravity, Wireless Power Transmission, Cold Fusion and Rejuvenation Technology. In the 20th century, while Marconi, Henry Ford, Thomas Edison and George Westinghouse managed to capture most of the attention, others, with technological prowess bordering on the miraculous, have gone unnoticed. Men like Tesla, Moray, Riech, Russell, and Schauberger, largely rejected ridiculed and despised by the scientific establishment of their day, labored in nearly complete obscurity, achieving almost incomprehensible miracle like free energy, anti-gravity, transmutation of elements, physical rejuvenation technologies and more","torrent":{"xt":"urn:btih:641f63d2510ad6790fe9d6332d9a11cb3051a90d","amp;dn":"Hidden+Secrets+-+Part+78+-+Scientific+Opinion+For+Sale","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"641f63d2510ad6790fe9d6332d9a11cb3051a90d","infoHashBuffer":{"type":"Buffer","data":[100,31,99,210,81,10,214,121,15,233,214,51,45,154,17,203,48,81,169,13]},"announce":[],"urlList":[]}}