{"title":"The Who - Quadrophenia","uid":13414024,"size":196680022,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:672303fc984f11e714c7b0f2eda7fdf502ff565c&amp;dn=The+Who+-+Quadrophenia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sergeant9","files":17,"time":1454471331,"description":"Quadrophenia is the sixth studio album by English rock band The Who, released on 26 October 1973 by Track Records. It is a double album and the group's second rock opera. The story follows a young mod named Jimmy and his search for self-worth and importance, set in London and Brighton in 1965. It is the only Who album to be entirely composed by group leader Pete Townshend.\r\n\r\nThe group started work on the album in 1972, trying to follow up Tommy and Who's Next, which had both achieved substantial critical and commercial success. Recording was delayed while bassist John Entwistle and singer Roger Daltrey recorded solo albums and drummer Keith Moon worked on films. Because a new studio was not finished in time, the group had to use Ronnie Lane's Mobile Studio. As well as the group's typical playing styles, especially from Moon, the album makes significant use of Townshend's multi-tracked synthesizers and sound effects, and Entwistle's layered horn parts. Relationships between the group and manager Kit Lambert broke down irretrievably during recording and he had left the band's services by the time the album was released.\r\n\r\nQuadrophenia was released to a positive reception in both the UK and the US, but the resulting tour was marred with problems with backing tapes replacing the additional instruments on the album, and the stage piece was retired in early 1974. It was revived in 1996 with a larger ensemble, and a further tour occurred in 2012. The album made a positive impact on the mod revival movement of the late 1970s, and the resulting film adaptation, released in 1979, was successful. The album has been reissued on compact disc several times, and seen a number of remixes that corrected some perceived flaws in the original.\r\n\r\n\r\nBrought to you by /Sergeant Major","torrent":{"xt":"urn:btih:672303fc984f11e714c7b0f2eda7fdf502ff565c","amp;dn":"The+Who+-+Quadrophenia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"672303fc984f11e714c7b0f2eda7fdf502ff565c","infoHashBuffer":{"type":"Buffer","data":[103,35,3,252,152,79,17,231,20,199,176,242,237,167,253,245,2,255,86,92]},"announce":[],"urlList":[]}}