{"title":"Van Morrison - Astral Weeks (24/96)","uid":13078363,"size":1009001327,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6787c06b88dd8a94bd8a09c0001ef00fd3ef599e&amp;dn=Van+Morrison+-+Astral+Weeks+%2824%2F96%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thee_chista","files":8,"time":1450875965,"description":"Astral Weeks is the second studio album by Northern Irish singer-songwriter Van Morrison. It was recorded at Century Sound Studios in New York City during three sessions in September and October 1968, although most participants and biographers agree that the eight songs were culled from the first and last early evening sessions. Except for John Payne, Morrison and the assembled jazz musicians had never played together before and the recordings commenced without rehearsals or lead sheets handed out.\r\n\r\nThe cover art, music and lyrics of the album portray the symbolism equating earthly love and heaven that would often feature in Morrison's work. When Astral Weeks was released by Warner Bros. Records in November 1968, it did not receive promotion from the label and was not an immediate success with consumers or critics. Blending folk, blues, jazz, and classical music, the album's songs signaled a radical departure from the sound of his previous pop hits, such as &quot;Brown Eyed Girl&quot; (1967).\r\n\r\nAstral Weeks '​ critical standing eventually improved greatly, however, and it has since been viewed as one of rock music's greatest and most important records (a reputation Morrison himself has dismissed). Sometimes referred to as a song cycle or concept album, critics laud the album's arrangements and songwriting; Morrison's lyrics are often described as impressionistic, hypnotic, and modernist. It was placed on numerous widely circulated lists of the best albums of all time and had an enduring impact on both listeners and musicians. Forty years after the album's release, Morrison performed all eight of its songs live for the first time during two Hollywood Bowl concerts in November 2008","torrent":{"xt":"urn:btih:6787c06b88dd8a94bd8a09c0001ef00fd3ef599e","amp;dn":"Van+Morrison+-+Astral+Weeks+%2824%2F96%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6787c06b88dd8a94bd8a09c0001ef00fd3ef599e","infoHashBuffer":{"type":"Buffer","data":[103,135,192,107,136,221,138,148,189,138,9,192,0,30,240,15,211,239,89,158]},"announce":[],"urlList":[]}}