{"title":"A Brief History of the World - Prof Peter N Stearns Educational","uid":14908415,"size":4465152284,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:69b4b79373ed38d7fae4b7f045601bb9b82fbcfc&amp;dn=A+Brief+History+of+the+World+-+Prof+Peter+N+Stearns+Educational&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big-Papi","files":16,"time":1465853320,"description":"This is only the first 12 lectures from the first 2 DVDs.\r\n\r\n\r\n\r\nThink of the construction of the great pyramids of Egypt, or the development of democratic rule in ancient Greece. Recall the innovations of the European Renaissance and Enlightenment—the remarkable flowering of drama and the arts, and revolutionary breakthroughs in science and philosophy. These are intriguing and important episodes, familiar to students of history. But haven't you also wondered: What else was going on in the world?\r\nHide Full Description\r\n\r\nConsider the enthralling tales of Venetian trader Marco Polo. He introduced the Western world to mysterious and exotic Asian cultures never before imagined. Those alien civilizations he visited had existed for centuries, even millennia. What do we know about that part of the story?\r\n\r\nWe know of the glories of ancient Rome, the commanding empire that ruled the known world—but what about the lands that were not &quot;known&quot;? What, for example, of the Han dynasty in China? It existed alongside the Roman Empire but developed a more enduring legacy than that of the emperors of the Eternal City. How does that imperial saga relate to the more familiar story of Roman domination?\r\n\r\nAnd in the Dark Ages that came after the fall of the Roman Empire, we know that the era following Rome's glory days brought great political and social turmoil to the peoples of Europe. But at that time the Muslims of the Middle East and North Africa were experiencing remarkable cultural flourishing that produced innovations in art, medicine, philosophy, and technology—a true golden age for the civilization.\r\n\r\nIf you have wondered about these other histories—of China and Japan, of Russia, India, and the remote territories of Sub-Saharan Africa and South America—you can now discover how these stories fit in with commonly known accounts of Western traditions.\r\n\r\nLearn the Rest of the Story\r\n\r\nIn A Brief History of the World, you'll survey the expanse of human development and civilization across the globe. Over the course of 36 riveting lectures, you'll apprehend &quot;the big picture&quot; of world history from the invention of agriculture in the Neolithic era to the urbanized, technologically sophisticated world of the 21st century.\r\n\r\nIt's a compelling overview of the human experience presented by a pioneering scholar and multi-award-winning teacher in world history, Professor Peter N. Stearns. You'll examine and compare the peoples, cultures, and nations of Europe, Asia, Africa, and the Americas to understand how, throughout history, peoples all over the world have connected and interacted, traded goods and technology, and conquered and learned from each other","torrent":{"xt":"urn:btih:69b4b79373ed38d7fae4b7f045601bb9b82fbcfc","amp;dn":"A+Brief+History+of+the+World+-+Prof+Peter+N+Stearns+Educational","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69b4b79373ed38d7fae4b7f045601bb9b82fbcfc","infoHashBuffer":{"type":"Buffer","data":[105,180,183,147,115,237,56,215,250,228,183,240,69,96,27,185,184,47,188,252]},"announce":[],"urlList":[]}}