{"title":"HyperRogue v8.1d","uid":13199646,"size":49008260,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6ac94745a8fbf9eb13dde02c244cd81628c8cb85&amp;dn=HyperRogue+v8.1d&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1452532975,"description":"You are a lone adventurer in a strange, non-Euclidean world. Gather as much treasure as you can before the nasty monsters get you. Explore several different worlds, each with its own unique treasures, enemies, and terrain obstacles. Your quest is to find the legendary treasure, the Orbs of Yendor. Collect one of them to win! Or just ignore your quest and collect smaller treasures.\r\n\r\nThe twist is the unique, unusual geometry of the world: it is one of just few games which takes place on the hyperbolic plane. Witness a grid composed of hexagons and heptagons, straight lines which seem to be parallel, but then they diverge and never cross, triangles whose angles add up to less than 180 degrees, how extremely unlikely is it to reach the same place twice, and how the world seems to be rotated when you do return. All this matters for the gameplay. The game is inspired by the roguelike genre (although in a very minimalist way), works of M. C. Escher, and by puzzle games such as Deadly Rooms of Death.\r\n\r\nHyperRogue can be played for free from its website. The Steam version adds online achievements, online leaderboards, trading cards, and convenience. Also, as the game is constantly updated, the Steam version includes the newest features, such as new lands with new mechanics, or new game modes -- see Gallery for the current differences","torrent":{"xt":"urn:btih:6ac94745a8fbf9eb13dde02c244cd81628c8cb85","amp;dn":"HyperRogue+v8.1d","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac94745a8fbf9eb13dde02c244cd81628c8cb85","infoHashBuffer":{"type":"Buffer","data":[106,201,71,69,168,251,249,235,19,221,224,44,36,76,216,22,40,200,203,133]},"announce":[],"urlList":[]}}