{"title":"Rigmar Radio Karaoke Collection 25900","uid":13158499,"size":1876946024,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6ad97a9cd053ad27c7aa63aa07cb3d47cf34ab92&amp;dn=Rigmar+Radio+Karaoke+Collection+25900&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rigmar_radio","files":600,"time":1452123672,"description":"PLEASE ONLY DOWNLOAD ONE TORRENT from this series at any one time.   OVERLOADING your bit torrent client KILLS Download speeds.\r\n\r\nI am getting PRETTY FED UP seeing the same IP address on dozens of my torrents and finding out that you can only download the latest torrent AT DIAL UP SPEEDS.\r\n\r\nfor the fastest download speeds from a well seeded torrent ONLY run that single download and at most one seed.   Simple really.\r\n\r\nI will seed this for 8 hours then if you would like to join me in re seeding parts 3250 to 5250 for the late peers who follow in your footsteps that would be very cool.\r\n\r\nOH and fix those blocked ports will you.  If Micro Torrent is giving you an amber ! on the bottom right hand corner, or VUZE tells you that there is a NAT problem, access your router and open the ports.  There are plenty online help sites.\r\n\r\nBlocked ports affect your ability to listen to fellow peers and you in effect become a leech in any swarm, mostly just downloading from the seed or seeds.  Blocked ports also really slow down your download speeds as you can not receive handshakes from anyone.  Any original SEED who uses Initial or Super SEEDING will not connect with you if you have blocked ports as they tell you what bits to download and of course you can not hear them!!! and from what I can see over 40 percent of peers connecting with me do have this problem.\r\n\r\nNext new torrent will follow in 24 hours","torrent":{"xt":"urn:btih:6ad97a9cd053ad27c7aa63aa07cb3d47cf34ab92","amp;dn":"Rigmar+Radio+Karaoke+Collection+25900","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad97a9cd053ad27c7aa63aa07cb3d47cf34ab92","infoHashBuffer":{"type":"Buffer","data":[106,217,122,156,208,83,173,39,199,170,99,170,7,203,61,71,207,52,171,146]},"announce":[],"urlList":[]}}