{"title":"Abelssoft AntiBrowserSpy Pro v2016 Build 168 Retail","uid":13153460,"size":10063616,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6b492a199464a2a3326e56246127c86224c7f508&amp;dn=Abelssoft+AntiBrowserSpy+Pro+v2016+Build+168+Retail&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"menin1","files":1,"time":1452082546,"description":"Abelssoft AntiBrowserSpy Pro v2016 Build 168 Retail [4realtorrentz]\r\n\r\nAntiBrowserSpy protects you from browser espionage\r\n\r\nTurn off the browsers espionage features:\r\nMore and more browser manufacturers are integrating features into their browsers that are sending private data of their users back home. Sometimes, this data consists of a unique ID that allows identifying a user, sometimes it is a URL of a website that you visit. Google Chrome and the new Internet Explorer have been turned into real champions when it gets into collecting those kinds of personal data but even Firefox and Safari are sending out private information. – AntiBrowserSpy is a tool designed for helping users to switch off those spy functionality.\r\n\r\nOne-Click-Protection:\r\nMany espionage features of common web browsers cannot be disabled by PC users – even experts cannot turn off all of them. AntiBrowserSpy makes it very easy to control all browser settings. With one mouse click you can configure the settings of all your browsers and disable even hidden espionage features.\r\n\r\nRemove Internet Traces:\r\nAntiBrowserSpy allows you to remove internet traces easily. This contains the removal of history entries and web cache. Download lists and typed URLs can also be cleaned. Additionaly AntiBrowserSpy contains a cookie manager allowing you to view and protect specific cookies.\r\n\r\nCreate backups of your browser settings:\r\nAntiBrowserSpy can create backups of your browser settings. This allows you to keep your bookmarks and all other data in a save place. You can also take the data with you in order to keep your bookmarks in case that you are moving to a new PC.\r\n\r\nAuto-Cleanup - Schedule cleanups and backups:\r\nAntiBrowserSpy can automate all main functions, too. For example it can clear all cookies on Windows startup. The program offers you a friendly user interface and plenty of detailed information for every function.\r\n\r\nSupports all common browsers:\r\nAntiBrowserSpy supports all common browsers: Mozilla Firefox, Microsoft Internet Explorer (Version 8 and higher), Google Chrome, Apple Safari and Opera (Version 15 and higher).\r\n\r\nWhat's New :\r\nUpdates: official site does not provide any info about changes in this version\r\n\r\nInstructions:\r\n\r\n1. Unpack and install\r\n2. That's it","torrent":{"xt":"urn:btih:6b492a199464a2a3326e56246127c86224c7f508","amp;dn":"Abelssoft+AntiBrowserSpy+Pro+v2016+Build+168+Retail","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b492a199464a2a3326e56246127c86224c7f508","infoHashBuffer":{"type":"Buffer","data":[107,73,42,25,148,100,162,163,50,110,86,36,97,39,200,98,36,199,245,8]},"announce":[],"urlList":[]}}