{"title":"Borates - Handbook of Deposits, Processing, Properties, and Use","uid":14972916,"size":24733708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e3737fe4044c43c87363ca593105d23c2170625&amp;dn=Borates+-+Handbook+of+Deposits%2C+Processing%2C+Properties%2C+and+Use&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1466212075,"description":"Borates - Handbook of Deposits, Processing, Properties, and Use - Donald E. Garrett (AP, 1998).pdf\r\n\r\nISBN 0-12-276060-3\r\n\r\nThis comprehensive reference is the first to cover industrially important borates, from deposits, through chemistry, mining, processing, and applications. The reference work begins with a listing of the 238 currently known borate minerals, their formulas, and properties. It features modern theories on the origin of borate deposits, their molecular structure and detailed descriptions of the world's borate deposits. Garrett describes the fascinating history of the discovery and development of borate deposits with anecdotes of how resourceful operators overcame obstacles in obtaining their minerals. Chapters on mining technology and processing detail the mineral's development from the earliest recorded times up to the sophisticated operations of the present day. The book also contains a comprehensive literature on boron isotope chemistry, their diverse applications, and productions and resource statistics for the world's largest industrial producers.\r\n* Functions as a complete reference for geologists, engineers, and consumers of borate products\r\n* Includes crystallographic descriptions, solution chemistry, isotopic distributions, and other properties of 170 borate minerals\r\n* Provides detailed descriptions of mining and processing methods and economic uses\r\n* Includes statistical data on borate production, consumption, prices, and ore reserves for every country of the world\r\n* Provides an extensive bibliography\r\n* Author is an authority on industrial minerals through many years of consulting and process development work","torrent":{"xt":"urn:btih:6e3737fe4044c43c87363ca593105d23c2170625","amp;dn":"Borates+-+Handbook+of+Deposits%2C+Processing%2C+Properties%2C+and+Use","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3737fe4044c43c87363ca593105d23c2170625","infoHashBuffer":{"type":"Buffer","data":[110,55,55,254,64,68,196,60,135,54,60,165,147,16,93,35,194,23,6,37]},"announce":[],"urlList":[]}}