{"title":"Super Lemonade Factory","uid":13248352,"size":72740196,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f05bf151ab0738395d446ea6582a688b2133410&amp;dn=Super+Lemonade+Factory&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1453144565,"description":"Post World War II, a region in political turmoil. Andre’s father offers to give him his lemonade factory – but on one condition; he and his wife, Liselot, must journey through the entire factory, a task that is easier said than done. Andre and Liselot must combine their unique abilities to make it through each room together. Along the way they’ll meet a cast of characters including the foreman, the chef, a food inspector and a general who wants the factory to supply drinks to the military, now engaged in a new war.\r\n\r\nSINGLE-PLAYER CO-OPERATIVE PLAY Liselot can double jump, push small crates for Andre to climb on and talk to other characters. Andre can smash big crates and carry Liselot. Switch between the two characters to combine their abilities and get both of them to the exit.\r\n\r\nA BUBBLY PLATFORMER WITH SUBTLE FLAVOURS As you talk to each character, their personalities and stories are revealed. Beneath the bubbly and bright surface Super Lemonade Factory touches on mature themes including labour relations and the moral dilemmas of running a business in wartime.\r\n\r\nMAKE YOUR OWN LEVELS Use the same tool and assets as the developer to create brand new levels for Super Lemonade Factory. Import them straight into the game and play your own level.\r\n\r\nJOURNEY THROUGH 72 LEVELS There are three worlds – warehouse, factory and office, each with 12 levels. Unlock hard-core mode and an additional 12 levels per world by collecting all the lemonade bottles.\r\n\r\nRETRO PIXEL ART AND SOUNDTRACK Featuring 8 bit pixel art by Miguelito and an original chip-tune soundtrack by Easyname, Super Lemonade Factory drips with charm.\r\n\r\nONE OR TWO PLAYER Control both Andre and Liselot on your own, or switch to Two Player Mode for local co-op play. Sorry, this is no online multiplayer.\r\n\r\n    Two Player Split Screen for local co-op. There is no online multiplayer.\r\n    Write Your Own Dialog For Your Own custom Levels.\r\n    Powered By Flixel and the Ogmo editor.\r\n    Over 436231 virtual soft drinks served world wide","torrent":{"xt":"urn:btih:6f05bf151ab0738395d446ea6582a688b2133410","amp;dn":"Super+Lemonade+Factory","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f05bf151ab0738395d446ea6582a688b2133410","infoHashBuffer":{"type":"Buffer","data":[111,5,191,21,26,176,115,131,149,212,70,234,101,130,166,136,178,19,52,16]},"announce":[],"urlList":[]}}