{"title":"Guns Across America: Reconciling Gun Rules and Rights","uid":13414869,"size":2952514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f295033b2f8bab7bd6e74466ca92762b9495c33&amp;dn=Guns+Across+America%3A+Reconciling+Gun+Rules+and+Rights&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Orangie2Dope","files":1,"time":1454479507,"description":"English - PDF - 289 pages - 2.8mb\r\n\r\n\r\n\r\n\r\nIn vast swathes of America, the sacredness of the Second Amendment has become a political third rail, never to be questioned. Gun rights supporters wear tri-cornered hats, wave the stars and stripes, and ask what would have happened if the revolutionaries had been unarmed when the British were coming. They have had great success in conflating unfettered gun ownership with the Founding Fathers, the Constitution, and all things American, even in an era of repeated mass shootings. Yet the all-too-familiar narrative of America's gun past, echoed in the Supreme Court's Heller gun rights decision, is not only mythologized, but historically wrong.\r\n\r\nAs Robert J. Spitzer demonstrates in Guns across America, gun ownership is as old as the nation, but so is gun regulation. Drawing on a vast new dataset of early gun laws reflecting every imaginable type of regulation, Spitzer reveals that firearms were actually more strictly regulated in the country's first three centuries than in recent years. The first &quot;gun grabbers&quot; were not 1960's Chablis-drinking liberals, but seventeenth century rum-guzzling pioneers, and their legacy continued through strict gun regulations in the 1920s and beyond. Spitzer examines interpretations of the Second Amendment, the assault weapons controversy, modern &quot;stand your ground&quot; laws, and the so-called &quot;right of rebellion&quot; to show that they play out in America's contemporary political landscape in ways that bear little resemblance to our imagined past. And as gun rights proponents seek to roll back gun laws and press as many guns into as many hands as possible, warning that gun rights are endangered, they sidestep the central question: are stricter gun laws incompatible with robust gun rights? Spitzer answers this question by examining New York State's tough gun laws, where his political analysis is complemented by his own quest for a concealed carry handgun permit and construction of a legal AR-15 assault weapon.\r\n\r\nNot only can gun rights and rules coexist, but they have throughout American history. Guns across America reveals the long-hidden truth: that gun regulations are in fact as American as apple pie","torrent":{"xt":"urn:btih:6f295033b2f8bab7bd6e74466ca92762b9495c33","amp;dn":"Guns+Across+America%3A+Reconciling+Gun+Rules+and+Rights","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f295033b2f8bab7bd6e74466ca92762b9495c33","infoHashBuffer":{"type":"Buffer","data":[111,41,80,51,178,248,186,183,189,110,116,70,108,169,39,98,185,73,92,51]},"announce":[],"urlList":[]}}