{"title":"MomsBangTeens - Alexis Fawx, Sophia Leone (Sneaky Santa) NEW 25","uid":13091096,"size":354673401,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7024a7bc1e209d8c698576ca307afac2df719416&amp;dn=MomsBangTeens+-+Alexis+Fawx%2C+Sophia+Leone+%28Sneaky+Santa%29+NEW+25+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1451043346,"description":"Santa was making his Christmas Eve rounds and showed up to a quaint and cozy home with great decorations and the usual thoughtful treat of Milk and cookies for him. He started eating the cookies and when he went to reach for the milk he spilled the cup on the floor. He knew the noise would awaken the sleepyheads dreaming of sugarplums so he quickly looked for a hiding spot. Sophia Leone woke up her stepmother Alexis Faux who decided to wait for Santa by sleeping in her step daughter's room. They investigated the commotion heard in the living room and discovered the spilled milk. As they cleaned up the mess in their skimpy panties and skin tight, white baby tees Santa couldn't help but whip out his yule log and play with his toy as he ogled the sexy stepmother-stepdaughter duo on all fours. Alexis caught Santa caressing his jingle balls and was understandably shaken and surprised. Santa apologized profusely for his lewd and lascivious behavior but once they both got a good look at Santa's candy cane he had nothing to feel sorry about. They sucked on it in tandem and then Alexis rode it like she was on his sleigh. Sophia joined in on the reindeer games once Santa had her in a doggy style position and put her on his naughty list. Santa ended up busting his egg nog all over their cookies and then dashed away to finish his night before Christmas deliveries with a giant smile on his rosy cheeked face. Mrs. Claus is not going to like this one bit if she somehow gets a hold of this update!\r\nTags: lesbian porn, straight, blonde, brunette, big tits, shaved, skinny, tattoo, latina sex, white, threesome, mature porn, 18 plus teen porn, 2girlbj, blow jobs, deepthroat\r\n \nhttp://imgdone.com/viewer.php?file=45431906972514127523.jpg\r\n \nhttp://imgdone.com/viewer.php?file=36562465764324903979.jpg","torrent":{"xt":"urn:btih:7024a7bc1e209d8c698576ca307afac2df719416","amp;dn":"MomsBangTeens+-+Alexis+Fawx%2C+Sophia+Leone+%28Sneaky+Santa%29+NEW+25+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7024a7bc1e209d8c698576ca307afac2df719416","infoHashBuffer":{"type":"Buffer","data":[112,36,167,188,30,32,157,140,105,133,118,202,48,122,250,194,223,113,148,22]},"announce":[],"urlList":[]}}