{"title":"Stalker nutjob Adam/VenomFrogX/ExtraFrogX's Hypocrisy","uid":15038939,"size":118108,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:705f64764ef3ec16f883544ccd6ec6bc7174119b&amp;dn=Stalker+nutjob+Adam%2FVenomFrogX%2FExtraFrogX%27s+Hypocrisy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Choopps","files":1,"time":1466606043,"description":"ARCHIVED PDF FILE OF A BLOG.\r\n\r\nI first encountered this nutjob stalker named Adam when dealing with another crazy stalker named themeangirl3 who is now dead. Just like the aforementioned nut, this stalker also harassed numerous people and even made two blogs where he wrote walls of texts about the people he obsessed over. \r\n\r\nBeginning with his stalking of a guy named Greener69er (a YouTube troll who simply made insulting comments and masqueraded as a Christian), VenomFrogX made seven blog posts all about this one guy over the comments he had made. In fact in my research I found no interaction made on the part of Greener so Venom was simply stalking a random guy he found on YouTube because his trolling made him butt hurt. Of Greener, Venom says the following of his constant commenting and spamming: \r\n\r\n&quot;What all of this is realy about is Greener's desperation of attention and not about any valid debates. What triggered him to behave in this way is beyond me but something unpleasant may have happened in his past or something. Perhaps when he was a choir boy in his younger years and some priest gave him some candy for something in return. I don't need to say any more if that is the case. Something isn't right. Greener, no good creating more sock accounts because sockpuppetry is for the gutless.&quot; \r\n\r\nPutting Venom's tasteless bizarre pedo fantasy aside, Venom clearly thinks sockpuppetry is a crime despite possessing several sock puppets of his own. Here's a list below: \r\n\r\nVenomFrogX (main account) \r\nExtraFrogX (second main account, later became Dia Beetus and now Utility Bagel) \r\nSeveredFootLoki \r\nArk Hellbrand (VampyreLothos) \r\nGalenth Dysley \r\n\r\nGoing by Venom's own definition, he is a pussy and a hypocrite. \r\n\r\nVenom later writes that Greener69er (whose history of comments can still be viewed on YouTube and show that he was nothing more than a troll, trolling both Christians and atheists) \r\nis a hypocrite and quotes the Bible verse of Matthew 7:1 &quot;Judge not, that ye be not judged&quot; yet despite this, Venom likes to judge a lot of people himself, not just this troll but Antoni (a kid with a mental illness who did nothing but steal YouTube videos from people), Divinesunone (a Christian who made a couple of videos debunking claims made by Venom) and a woman named Judy (a woman who often blocked people for little reason). \r\n\r\nOf Antoni, Venom stalked this kid for many years, writing blog posts with his full named included to harass him and what's more, he encouraged his followers to join in on the harassment too. Antoni stole many Hitler parody videos from many YouTubers and while most ignored him after noting his obvious mental illness, Venom took it upon himself to write not one but two blog posts where he documented his bizarre behavior on YouTube and wrote &quot;I will be keeping a personal eye on him to see if he makes any more slip-ups such as uploading sexual content as a friend of mine on YouTube has pointed out.&quot; What other person would take the time to bother with someone with clear mental difficulties which Venom himself noted? Clearly Venom is an unemployed guy with nothing better to do with his life other than document uninteresting people. I will admit I'm doing that here myself but of to a lesser extent, also, unlike Venom, I am not stalking one individual for years. \r\n\r\nVenom later admits to using his Galenth Dysley account (an account he claims he is a dorment account of his) to bypass a ban Antoni placed on one his many accounts just to continue harassing him. Pretty sad. \r\n\r\n\r\nWhat possesses a man to harass someone with mental illnesses even if that person with a mental illness is doing something wrong? Venom is clearly someone who is not very smart and he clearly is a very vengeful person who takes the internet way too seriously, it's unhealthy and I believe that (if he's not already) he should seek medical treatment himself for his behavior and obsession over people. \r\n\r\nOf Divinesunone, Venom made several blog posts about him accusing him of sockpuppetry but as we have already discussed, Venom himself has five accounts not only making his posts ironic but prove that he's a hypocrite. Venom made this claim of Divinesunone after being unable to formulate an argument in response to the claim that the universe is finely tuned and when the evidence was presented, quickly came up with the sock puppets claim, which even if true, would fail to invalidate the argument of a finely tuned universe, this shows Venom's inability to make any argument so he resorts to ad hominem attacks instead","torrent":{"xt":"urn:btih:705f64764ef3ec16f883544ccd6ec6bc7174119b","amp;dn":"Stalker+nutjob+Adam%2FVenomFrogX%2FExtraFrogX%27s+Hypocrisy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705f64764ef3ec16f883544ccd6ec6bc7174119b","infoHashBuffer":{"type":"Buffer","data":[112,95,100,118,78,243,236,22,248,131,84,76,205,110,198,188,113,116,17,155]},"announce":[],"urlList":[]}}