{"title":"A.D. The Bible Continues","uid":13145682,"size":3669095379,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7090476cff2f80647e0e6fafd82ef5e0bd0e63a6&amp;dn=A.D.+The+Bible+Continues&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"aesycos","files":12,"time":1452023660,"description":"A.D. The Bible Continues (TV Series 2015)\r\n\r\nStoryline\r\n\r\nA.D. picks up where the smash hit, &quot;The Bible,&quot; left off, continuing the greatest story ever told and exploring the exciting and inspiring events that followed the Crucifixion of Christ. As most of the world knows, the Crucifixion was only the beginning of the story. The immediate aftermath of Christ's death had a massive impact on his disciples, his mother Mary, and key political and religious leaders of the era, completely altering the entire world in an instant. Watch as the disciples struggle to survive and share their beliefs, guiding us from the sorrow of Christ's ultimate sacrifice to the awe-inspiring wonder of the Resurrection and beyond. From Executive Producers Roma Downey and Mark Burnett comes an uplifting spiritual journey through the later chapters of biblical history. Written by NBC\r\n\r\nGenres: Drama\r\n\r\nDetails\r\n\r\nOfficial Sites: http://www.imdb.com/offsite/?page-action=offsite-nbc&amp;token=BCYsJacyqvecyQnYKdGDPc_W2oQTb-w9xSbb6rzCRghCkFAURnfpVJdIId3jYFslJm7sdvWXdMc6%0D%0AyaEuT46yAEVljHk54QQiRzpIxE-ydz2SO25IfSmxmqLI4UVfdrw70gVIPXzhUoU1yuOT_Zp65Eim%0D%0AKIwR0Ifg3EjNlnpHfYGa5DOGBb-_-VNrtFCNu2ziU5NKxI9Wgz0Fi0p5tvVPqTOy2w%0D%0A&amp;ref_=tt_pdt_ofs_offsite_0\r\n\r\nCountry: USA\r\nLanguage: English\r\nRelease Date: 5 April 2015 (USA)\r\nAlso Known As: Anno Domini: Biblii ciag dalszy\r\n\r\nCompany Credits\r\n\r\nProduction Co: United Artists Media Group (UAMG), LightWorkers Media\r\n\r\nTechnical Specs\r\n\r\nRuntime: 44 min\r\nSound Mix: Stereo\r\nColor: Color\r\nAspect Ratio: 720x404\r\n\r\nTrivia\r\nJoseph is played by Kevin Doyle (Mosely of Downton Abbey)\r\nConnections\r\nFollows The Bible (2013)\r\n\r\nFull Cast &amp; Crew\r\nSeries Directed by \r\nCiaran Donnelly\t...\t(3 episodes, 2015)\r\nTony Mitchell\t...\t(3 episodes, 2015)\r\nRob Evans\t...\t(2 episodes, 2015)\r\nBrian Kelly\t...\t(2 episodes, 2015)\r\nPaul Wilmshurst\t...\t(2 episodes, 2015) Series Writing Credits  \r\nRachel Anthony\t...\t(1 episode, 2015)\r\nSimon Block\t...\t(3 episodes, 2015)\r\nTom Grieves\t...\t(2 episodes, 2015)\r\nBen Newman\t...\t(3 episodes, 2015)\r\nAndy Rattenbury\t...\t(1 episode, 2015)\r\nDamian Wayling\t...\t(2 episodes, 2015)\r\n\r\nUser Reviews\r\n\r\nHistorical Issues\r\n31 May 2015 | by bwhami-1 (United States)\r\nI wonder at what point the writers and producers decided to toss out the Book of Acts and ignore history.\r\n\r\nSome of the stories are fun to watch, but other stories are just plain wrong. Tiberius and Caligula never visited Jerusalem. Tiberius died on the Island of Capri and Caligula was there to testify of his death. Near the end of his life, after he thought he had turned into a living God, Caligula did order a statue of himself placed in the Jewish Temple at Jerusalem, but before his orders could be carried out he was assassinated. When he first came to power Caligula was very kind and benevolent, but he became ill and when he recovered, he had changed and thought he was now a God. Caligula was not even mentioned in Acts. I have no idea why this made up story of Tiberius and Caligula visiting Jerusalem added to the TV story. The truth is that Pilot died in 36 AD and Caligula did not become Emperor until 37 AD. Pilot was replaced by Festus and so far in the series he has yet to show up in the series.\r\n\r\nI wish the producers had been smart enough to realize that real history can be exciting and dramatic and they did not have to change history to make the story interesting. It is also an insult to the intelligence of those who have studied history and have read the Bible and know the real stories to watch this show and see the drastic changes to the original stories. The Bible series was a bit more true to the Bible when it was on the History Channel, but now it is on a network so maybe NBC caring more about rating than real history wanted them to change history. \r\n\r\nIn the 50's Bible stories had some biblical and historical accuracy, but mostly went for glitz and spectral. More recent movies and TV shows reflected more historical and Biblical accuracy in their stories. Now we have taken a few steps back and have let the truth take a back seat to popular legend and ratings. When Pilate asked Jesus what is truth, He gave no answer. I suppose if Pilate were to ask the producers what is truth, they would say &quot;What ever we want it to be.&quot; That is sad","torrent":{"xt":"urn:btih:7090476cff2f80647e0e6fafd82ef5e0bd0e63a6","amp;dn":"A.D.+The+Bible+Continues","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7090476cff2f80647e0e6fafd82ef5e0bd0e63a6","infoHashBuffer":{"type":"Buffer","data":[112,144,71,108,255,47,128,100,126,14,111,175,216,46,245,224,189,14,99,166]},"announce":[],"urlList":[]}}