{"title":"Rush Limbaugh - June 23, 2016 Full Podcast.mp3","uid":15057700,"size":267612088,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:722a0870820c7a0a9a4376af15f476d80cc67043&amp;dn=Rush+Limbaugh+-+June+23%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1466740412,"description":"Rush Limbaugh - June 23, 2016 Full Podcast \r\nmp3\r\nThe Constitution Is on the Ballot\r\n\r\n\r\nJustice Kennedy: The State Has a Compelling Interest to Discriminate\r\n\r\n\r\nRUSH: If, as this ruling says, there is a compelling interesting in maintaining racial quotas because of the interest we have in obtaining &quot;the educational benefits that flow from student body diversity,&quot; it means that if there are other constitutional rights in conflict, they will always be considered irrelevant or secondary to the compelling interest. The compelling interest permits, if you will, in this case, discrimination against others and their rights, because the state has a compelling interest. Compelling interest. That means, &quot;We have to do this at whatever cost. We have to do it!&quot; And what do we have to do? We have to consider race in college admissions, not to equalize actual admissions.\r\n\r\n\r\nRUSH: The Constitution, as you know it and I know it, is now what's on the ballot in this presidential election in 2016. And of course the answer to this is not &quot;Never Trump.&quot; The answer to this is &quot;Never Hillary.&quot; The answer to this is &quot;Never Tyranny.&quot; The answer to this is &quot;Never Democrats.&quot; That's how perilously close we are here. We cannot afford a Hillary Clinton presidency because that's it. That's the end of the Constitution. \r\n\r\nMarilyn Mosby Embarrassed Again\r\n \nhttp://www.rushlimbaugh.com/\r\n\r\n\r\nHow the Democrats Do It\r\n\r\nRUSH: How they're characterizing this decision is gonna show up all over social media. And a bunch of ill-educated, uneducated Nimrods are gonna see it, and they've a totally skewed notion of what this decision means... Bill Nelson just said, the Florida Senator. He really went on TV and tried to convey that deportation proceedings of children are gonna be starting this afternoon, and it was just sad, just unfortunate, oh, my God, what kind of country are we.  It isn't the case... Immigration, as promoted by the Democrat Party, really is a voter registration drive, pure and simple. It is a desire by the Democrat Party to find another way to remain in perpetual power, by creating as many dependent voters as they can","torrent":{"xt":"urn:btih:722a0870820c7a0a9a4376af15f476d80cc67043","amp;dn":"Rush+Limbaugh+-+June+23%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722a0870820c7a0a9a4376af15f476d80cc67043","infoHashBuffer":{"type":"Buffer","data":[114,42,8,112,130,12,122,10,154,67,118,175,21,244,118,216,12,198,112,67]},"announce":[],"urlList":[]}}