{"title":"Battlefield WW2 Combat data + mod","uid":13176051,"size":451873820,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:746b80a62610e168be816370eb35bbe151f63403&amp;dn=Battlefield+WW2+Combat+data+%2B+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":104,"time":1452291228,"description":"Stalingrad...\r\nWe are seventy years before the events of Battlefield Stalingrad. We are in 1942, and the crucial scenario of the World War II, the bloodiest battle in history, is about to begin. Bombing is destroying the city, and two armies will clash for months. There, a valiant commando, alone with his rifle in the frontline assault, shot and killed more than 200 people using his astonishing sniper skills. His name, Vasily Zaytsev, the gunman.\r\n\r\nCodeLabs proudly presents Battlefield WW2 Combat, a modern combat tribute to the courage of that man and many other heroes. Again, join the Red Army or the Wehrmacht in a fight to control Stalingrad, fighting fiercely against the assault of endless waves of ruthless enemies. In the heat of battle, impersonate a contract killer, a deadly commando, a ruthless sniper assassin, a fierce rifleman or a brave gunman. The call of duty resonates in your ears!\r\n\r\nFeatures:\r\n- New scenarios to continue the epic adventure\r\n- Feel the pressure of a sniper alone facing the enemy\r\n- Endless waves of AI controlled enemies\r\n- Realistic shooting and reloading of the weapon\r\n- 72 different scenarios, carefully designed and tested by our development team\r\n- Real 3D graphics optimized for a wide variety of devices\r\n- Easy to learn, hard to master\r\n- Share with your friends onand get new weapons\r\n- Absolutely FREE TO PLAY, no pay to win\r\n\r\nThe D-Day has come. Will you be up to the challenge in this 3D shooter? The overkill has come. Let the bullets fly!\r\n\r\nDOMINATE ACTION-PACKED CAMPAIGNS\r\nLead your squad to victory through 60 unique missions and 8 elite challenges.\r\n\r\nMORE TO COME! FACE PERILOUS URBAN WARFARE!\r\nShoot your way through 7 destructible battlefields! Take on snipers, heavy weapon specialists, tanks, helicopters, flying drones and more! Maximize your firepower with multiple, upgradable weapon classes including sniper rifles, assault rifles, shotguns and machine guns.\r\n\r\nBATTLE FOR ONLINE SUPREMACY - ASSEMBLE YOUR ELITE SQUAD\r\nThink you have an unstoppable squad? Incoming PvP mode! Betrayed and left for dead, you must build your team of mercenaries and seek revenge against your enemies. Recruit and train soldiers to lead the ultimate team into battle!\r\n\r\nYOUR SQUAD. YOUR WAR.\r\n&quot;Battlefield WW2 has all the requirements of an epic first person shooter&quot; - AlMiSoft Magazine\r\n\r\nWhat's New:\r\nCorrected xp bar at level 40\r\nGreatly reworked GUI!\r\nAdded events in-game for headshots and aim combos!! More xp\r\nAllowed levels over 40\r\nFixed lights in a stage and added 3 new premium weapons\r\nNew premium weapons! Railguns, machineguns and bazookas :)\r\nFixed rare bug which could happen when killing a very near enemy.\r\nImproved performance.\r\nImproved levels.\r\nPlayer vs Player fix.\r\nSmall bugfix\r\nBest modern combat ww2 battle.\r\nEnjoy new features in the frontline of the missions.\r\nNew weapons.\r\nNew levels.\r\n\r\nMod info:\r\n- Unlimited Gold.\r\n- Unlimited Coins.\r\n- Unlimited Diamonds.\r\n- Unlimited Player Points.\r\n- Unlimited Medickits.\r\n- Unlimited XP.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android 2.3 and up","torrent":{"xt":"urn:btih:746b80a62610e168be816370eb35bbe151f63403","amp;dn":"Battlefield+WW2+Combat+data+%2B+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746b80a62610e168be816370eb35bbe151f63403","infoHashBuffer":{"type":"Buffer","data":[116,107,128,166,38,16,225,104,190,129,99,112,235,53,187,225,81,246,52,3]},"announce":[],"urlList":[]}}