{"title":"British &amp; Irish Literature - The Classics","uid":13266393,"size":372528041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c5f58c89f0811a262619ec30ed262a44ef63d9e&amp;dn=British+%26amp%3B+Irish+Literature+-+The+Classics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"whitecat2010","files":804,"time":1453342161,"description":"English (British) and Irish literature: from Beowulf to WW2\r\n===========================================================\r\n\r\nAbout the collection\r\n\r\nThis is my collection of English (British) and Irish literature (so no American authors and no foreign, translated authors)\r\nThis is part one, which includes the classics: from the Middle Ages till the first decades of the 20th century.\r\nPart two will be the more recent authors, and part three science fiction and fantasy. \r\n \r\n\r\nThe books are mainly in .epub and .pdf, because I don't own a Kindle and I dislike the very idea of a proprietary format and ereader which binds you as its slave, in exchange for the low price. I usually go for ereaders which support the greatest number of formats. \r\n\r\nMy naming convention is different than found in collections that come from Calibre. I hate it when the books are by book title and not by author, because I want the books by the same author to be shown together even when they are not grouped in a folder.\r\n\r\nSources\r\n=======\r\n\r\nThese are not my own scans or OCR. They have been collected over many years from the web, either from huge messy book torrents containing a bit of everything or from free download sites such as gutenberg, and a bunch of them came with my e-readers. \r\nMy only merit is organizational, but I assure you that it was quite a bit of work. I picked those which belong to this category from the chaos of most book torrents, or downloaded the free books one by one. Then I renamed them consistently to prune out doubles and make search easy. I’ve taken out meaningless folder numbers , deleted .opf and other useless files. In many cases I’ve added a .txt file with info about authors, added author’s year of birth and death, or found a book cover when there wasn’t any. \r\n\r\nYou might find some books twice: usually because one is a scan of a regular book and the other one with the blown-up font used for e-readers, or sometimes one will include a cover and the other won’t. .. things like that. The collection is not compressed, so if these things don’t matter to you, feel free to skip downloading one of the two","torrent":{"xt":"urn:btih:7c5f58c89f0811a262619ec30ed262a44ef63d9e","amp;dn":"British+%26amp%3B+Irish+Literature+-+The+Classics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5f58c89f0811a262619ec30ed262a44ef63d9e","infoHashBuffer":{"type":"Buffer","data":[124,95,88,200,159,8,17,162,98,97,158,195,14,210,98,164,78,246,61,158]},"announce":[],"urlList":[]}}