{"title":"A Concise History of the United States of America (2012) Gooner","uid":13173231,"size":29367678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84e8f7061d0dedc92ea6fa5aac53deef1ac0e8e0&amp;dn=A+Concise+History+of+the+United+States+of+America+%282012%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452260369,"description":"A Concise History of the United States of America (2012).pdf Gooner\r\n\r\nPublisher: Cambridge University Press (March 5, 2012)\r\nLanguage: English\r\nISBN-10: 0521848253\r\nISBN-13: 978-0521848251\r\n\r\nBorn out of violence and the aspirations of its early settlers, the United States of America has become one of the world's most powerful nations, even as its past continues to inform its present and to mould its very identity as a nation. The search for nationhood and the ambiguities upon which the nation was founded are at the root of this intelligent and forthright book. Taking a broadly chronological approach, it begins in colonial America as the first Europeans arrived, lured by the promise of financial profit, driven by religious piety, and accompanied by the diseases which would ravage and consume the native populations. It explores the tensions inherent in a country built on slave labor in the name of liberty, one forced to assert its unity and reassess its ideals in the face of secession and civil war, and one that struggled to establish moral supremacy, military security, and economic stability during the financial crises and global conflicts of the twentieth century. Woven through this richly crafted study of America's shifting social and political landscapes are the multiple voices of the nation's history: slaves and slave owners, revolutionaries and reformers, soldiers and statesmen, immigrants and refugees. It is their voices, together with those of today's multicultural America, that define the United States at the dawn of a new century","torrent":{"xt":"urn:btih:84e8f7061d0dedc92ea6fa5aac53deef1ac0e8e0","amp;dn":"A+Concise+History+of+the+United+States+of+America+%282012%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e8f7061d0dedc92ea6fa5aac53deef1ac0e8e0","infoHashBuffer":{"type":"Buffer","data":[132,232,247,6,29,13,237,201,46,166,250,90,172,83,222,239,26,192,232,224]},"announce":[],"urlList":[]}}