{"title":"Lotus and Thorn - {CHB Books}","uid":14932161,"size":3029796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:877324d2633d90c65d88f981001198adaafb1700&amp;dn=Lotus+and+Thorn+-+%7BCHB+Books%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":4,"time":1465964888,"description":"Author: Sara Wilson Etienne\r\nHardcover: 464 pages\r\nPublisher: G.P. Putnam's Sons Books for Young Readers (June 7, 2016)\r\nLanguage: English\r\nISBN-10: 0399256695\r\nISBN-13: 978-0399256691\r\n\r\n\r\n\r\nRavaged by a plague known as Red Death, the planet Gabriel, a former colony of Earth, is a barren wasteland. Since being abandoned by Earth 500 years ago, resources are scarce and life is cheap. To stay alive, the survivors, the Citizens, scavenge the remains of a now dead city, trading for food with the resource-rich Curadores, the only other survivors on Gabriel. Every old computer, every piece of wire, every scrap of metal counts. To steal is the ultimate sin. So when tough-as-nails seventeen-year-old Leica is caught doing just that, she's exiled and left to the mercy of Gabriel's unforgiving desert for the rest of her life. \r\n\r\nWhile in exile, Leica discovers a mysterious shuttle, which may not only lead her home, but even more impossible—reestablish contact with Earth. Then Red Death rears its head again, killing her entire work crew, leaving Leica all alone until a handsome Curador offers her refuge in the Dome—the only place on Gabriel untouched by Red Death, where a decadent and sultry life awaits. But there's a catch: Leica can only enter the Dome as his concubine—his Kisaeng. When a rogue group of Citizens see their chance for revolution in Leica's good fortune, she finds herself unraveling a deadly mystery with chilling answers to the true origin of Red Death and the reason Earth really abandoned them so long ago. \r\n\r\nA richly imagined fantasy in the vein of Tamora Pierce, Lotus and Thorn, is a magnificent, epic adventure","torrent":{"xt":"urn:btih:877324d2633d90c65d88f981001198adaafb1700","amp;dn":"Lotus+and+Thorn+-+%7BCHB+Books%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877324d2633d90c65d88f981001198adaafb1700","infoHashBuffer":{"type":"Buffer","data":[135,115,36,210,99,61,144,198,93,136,249,129,0,17,152,173,170,251,23,0]},"announce":[],"urlList":[]}}