{"title":"Tough.Rides.India.5of6.Madurai.to.Kolkata.720p.BDRip.x264.AAC.MV","uid":13129393,"size":623589886,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:89233a4dcc8b9bc428697bb7d0a56f2456cfaa09&amp;dn=Tough.Rides.India.5of6.Madurai.to.Kolkata.720p.BDRip.x264.AAC.MV&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":1,"time":1451823919,"description":"Tough Rides: India\r\n\r\nTravel Documentary hosted by Colin Pyle and Ryan Pyle, published by Travel Channel UK in 2014 - English narration\r\n \nhttp://docuwiki.net/images/5/53/Tough-Rides-India-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\n\r\nTough Rides: India\r\nAlso known as The India Ride. When Canadian brothers Colin and Ryan Pyle completed their record-breaking circumnavigation of China by motorcycle in 2010, they thought it would be their last great adventure together. In August 2012, they were back on the road again, this time on a journey around India. Fifty-four tough days later, they'd traveled 14,000 km, driven on some of the most dangerous roads in the world across deserts and over mountains, in torrential rainstorms and almost unbearable heat. They'd visited some remarkable places, including the magnificent Golden Temple at Amritsar, the perplexing Karni Mata Temple at Deshnoke, the holy River Ganges, and the site of Buddha's enlightenment at Bodh Gaya. They'd compounded the dangers of the road by paragliding at Manali, made a perfect cup of tea in Darjeeling, met some amazing people, and learned that almost nothing in India is what you expect it to be. In The India Ride, Colin and Ryan take us with them as they push themselves to new limits on a voyage of discovery that most people will only ever dream of making.\r\n\r\n\r\n1)  Delhi to the Himalayan Foothills \r\nColin and Ryan Pyle set off from Delhi on their iconic Indian Royal Enfield bikes for an epic adventure. They will cover 14,000 kilometres over 54 days in a circuit of India. Neither Ryan nor Colin has ever been to India before, much less ridden on crazy roads full of sacred cows and overcrowded cars. Their journey begins by winding their way north up into the foothills of the Himalaya. They navigate over narrow mountain roads to Manali, the extreme sport capital of India, before navigating over a notorious mountain pass, 4000m above sea level, called The Rohtang Pass...\r\n\r\n2)  Pakistan Border to the Great Indian Desert \r\nAfter surviving India's dangerous mountain roads, the Pyle's head to Amritsar, home to the peaceful Sikh Golden Temple and the volatile Indian - Pakistan Border. The daily flag lowering ceremony is a massive carnival, with spectators on either side of the border cheering for their respective side. Heading down from the mountains, they experience the last of the monsoon rains and enter India's Great Indian Desert of Rajasthan.\r\n\r\n3)  Rajasthan to Mumbai \r\nColin and Ryan Pyle are in Rajasthan, famous for brightly painted palace hotels. The first stop in the heat of the Indian desert is the world famous rat temple in Bikaner. Colin doesn't last very long among the rat infestation and soon after is hit with a bad case of &quot;Delhi-belly&quot;. After recovering from food poisoning, they head to south to Mumbai: home of Bollywood and the world's worst traffic jams. Navigating through Mumbai, Ryan has the first crash of the journey.\r\n\r\n4)  Southern India \r\nOn their journey down the Indian south west coast, the Pyle brothers visit Mahindra's mega car factory, and Colin takes the test to become a car factory worker. Ryan recovers from his first fall of the trip, he's not seriously hurt but his bike is in need of repair. After another mechanical failure on Ryan's bike, Colin starts to question Ryan's riding ability. By day 29 they reach India's southernmost point called Cape Comorin or sunset point, where they watch the sun go down on the half-way mark of their epic journey.\r\n\r\n5)  Madurai to Kolkata \r\nMadurai is a 2000 year old city and one of the world's oldest inhabited cities. As the journey continues north up the east coast of India, the carnage on the roads continues. A side trip to an elephant sanctuary in Odisha Province showcases the beauty of India's national parks. Onwards to the Bay of Bengal and Kolkata, where Colin and Ryan Pyle visit a hospital and school for the blind run by the Seva Foundation. The Seva Foundation has restored the eyesight of over 3 million people in Asia and Africa; here the Pyle's witness how quick turnaround cataract surgery can ...\r\n\r\n6)  Darjeeling to Delhi \r\nDarjeeling is the tea capital of India, Ryan and Colin Pyle join an army of tea pluckers whose premium tea, picked under the full moon, fetches over USD$900 per kilo. The last leg of the trip takes them to Bodhgaya, the birthplace of Buddhism, and then it's off for a dip in the Ganges River at Varanasi, before heading to Agra and the iconic Taj Mahal, the world's most famous mausoleum. Finally after 54 days on the road, the Pyle brothers arrive back at the India Gate in Delhi to end their epic tough ride around India.\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/a/a9/Tough-Rides-India-Screen0.jpg  \nhttp://docuwiki.net/images/b/b0/Tough-Rides-India-Screen1.jpg  \nhttp://docuwiki.net/images/3/33/Tough-Rides-India-Screen2.jpg  \nhttp://docuwiki.net/images/5/53/Tough-Rides-India-Screen3.jpg  \nhttp://docuwiki.net/images/d/d1/Tough-Rides-India-Screen4.jpg  \nhttp://docuwiki.net/images/0/05/Tough-Rides-India-Screen5.jpg  \nhttp://docuwiki.net/images/7/77/Tough-Rides-India-Screen6.jpg  \nhttp://docuwiki.net/images/d/d6/Tough-Rides-India-Screen7.jpg  \nhttp://docuwiki.net/images/d/d7/Tough-Rides-India-Screen8.jpg  \nhttp://docuwiki.net/images/1/16/Tough-Rides-India-Screen9.jpg  \nhttp://docuwiki.net/images/d/d8/Tough-Rides-India-Screen10.jpg  \nhttp://docuwiki.net/images/1/15/Tough-Rides-India-Screen11.jpg  \nhttp://docuwiki.net/images/2/28/Tough-Rides-India-Screen12.jpg  \nhttp://docuwiki.net/images/2/20/Tough-Rides-India-Screen13.jpg  \nhttp://docuwiki.net/images/6/6b/Tough-Rides-India-Screen14.jpg  \nhttp://docuwiki.net/images/5/5f/Tough-Rides-India-Screen15.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n\r\n\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: 3203 Kbps\r\n * Video Aspect Ratio: 1280 x 720\r\n * Video Resolution: 1.778 (16:9)\r\n * Audio Codec: AAC LC\r\n * Audio: English\r\n * Audio Bitrate: 160 kb/s VBR 48 KHz\r\n * Audio Channels: Stereo 2\r\n * Run-Time: 27mins\r\n * Framerate: 23.976 fps\r\n * Number of Parts: 6\r\n * Container Mp4\r\n * Part Size: 598 MB\r\n * Source: Blu-ray\r\n * Encoded by: Harry65\r\n\r\n1)  Further Information \r\n * http://www.imdb.com/title/tt2524238/\r\n\r\n2)  Related Documentaries \r\n * http://docuwiki.net/?title=Tough%20Rides%3A%20China%20Series%201","torrent":{"xt":"urn:btih:89233a4dcc8b9bc428697bb7d0a56f2456cfaa09","amp;dn":"Tough.Rides.India.5of6.Madurai.to.Kolkata.720p.BDRip.x264.AAC.MV","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89233a4dcc8b9bc428697bb7d0a56f2456cfaa09","infoHashBuffer":{"type":"Buffer","data":[137,35,58,77,204,139,155,196,40,105,123,183,208,165,111,36,86,207,170,9]},"announce":[],"urlList":[]}}