{"title":"Beam Theory for Subsea Pipelines - Alexander N. Papusha","uid":14971995,"size":11342697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:898f42438575ff9445eb68fcac59df94adce6c4d&amp;dn=Beam+Theory+for+Subsea+Pipelines+-+Alexander+N.+Papusha&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1466208138,"description":"Beam Theory for Subsea Pipelines - Alexander N. Papusha (Wiley-Scrivener, 2015).pdf\r\n\r\nISBN 978-1-119-11756-8\r\n\r\nIntroducing a new practical approach within the field of applied mechanics developed to solve beam strength and bending problems using classical beam theory and beam modeling, this outstanding new volume offers the engineer, scientist, or student a revolutionary new approach to subsea pipeline design. Integrating use of the Mathematica program into these models and designs, the engineer can utilize this unique approach to build stronger, more efficient and less costly subsea pipelines, a very important phase of the world's energy infrastructure. Significant advances have been achieved in implementation of the applied beam theory in various engineering design technologies over the last few decades, and the implementation of this theory also takes an important place within the practical area of re-qualification and reassessment for onshore and offshore pipeline engineering. A general strategy of applying beam theory into the design procedure of subsea pipelines has been developed and already incorporated into the ISO guidelines for reliability-based limit state design of pipelines. This work is founded on these significant advances. The intention of the book is to provide the theory, research, and practical applications that can be used for educational purposes by personnel working in offshore pipeline integrity and engineering students. A must-have for the veteran engineer and student alike, this volume is an important new advancement in the energy industry, a strong link in the chain of the world's energy production","torrent":{"xt":"urn:btih:898f42438575ff9445eb68fcac59df94adce6c4d","amp;dn":"Beam+Theory+for+Subsea+Pipelines+-+Alexander+N.+Papusha","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898f42438575ff9445eb68fcac59df94adce6c4d","infoHashBuffer":{"type":"Buffer","data":[137,143,66,67,133,117,255,148,69,235,104,252,172,89,223,148,173,206,108,77]},"announce":[],"urlList":[]}}