{"title":"All That Glitters Series - K.A. Linde","uid":13132138,"size":3405553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8995fa0060cb4912b923a8476fa75b597cf5afb9&amp;dn=All+That+Glitters+Series+-+K.A.+Linde&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":9,"time":1451851185,"description":"01. Diamonds [All That Glitters, #01] - K.A. Linde\r\n\r\n\r\n\r\n&quot;A darkly glamorous joyride through sin, pleasure, and the finer things in life, no matter the cost. A must read!&quot; - Lauren Blakely, New York Times bestselling author of Seductive Nights\r\n\r\n&quot;A quick, powerful, all-consuming read that had and still has my emotions spinning in a million different directions! K.A. Linde in her finest angst-hour!&quot; -Gail McHugh, New York Times bestselling author of Pulse and Collide**\r\n\r\nBryna feels his eyes on her.\r\n\r\nHot, seductive, enticing.\r\n\r\nHe’s at least ten years older than her seventeen years, and he knows exactly what he’s doing to her with that look.\r\n\r\nWalking away would be the smart thing to do…\r\n\r\nBut she can’t. Not that first night when he takes her home and claims her body. Not when he shows up in her life again with expensive gifts to win her trust. Not even when she’s falling for him, and everything else is falling apart…\r\n\r\n\r\n\r\n02. Gold [All That Glitters, #02] - K.A. Linde\r\n\r\n\r\n\r\n&quot;A darkly glamorous joyride through sin, pleasure, and the finer things in life, no matter the cost. A must read!&quot; -- Lauren Blakely, New York Times bestselling author on Diamonds\r\n\r\nThe prey becomes the predator.\r\n\r\nLove. That cursed four-letter word no longer belongs in Bryna’s vocabulary. The only four-letter word she knows now is gold.\r\n\r\n…and fuck.\r\n\r\nShe’s well acquainted with that one. And that’s exactly what she plans to do. She’s no longer the golden girl, and when she meets a businessman who promises everything she could ever want from the arrangement, she intends to get her money’s worth.\r\n\r\nFollow the conclusion to Bryna’s gold digging story in this scandalizing, duplicitous second book to the USA Today bestselling author K.A. Linde’s All That Glitters series.\r\n\r\n\r\n\r\n03. Emeralds [All That Glitters, #02.5] - K.A. Linde\r\n\r\n\r\n\r\nWalking away from him was easy.\r\n\r\nThe first time at least.\r\n\r\nThen he shows up late one night at Trihn’s ballet company, and all bets are off. Trihn knows that she should be careful. But when it comes to Preston Whitehall, she throws all her carefully constructed reasons for not dating out the window.\r\n\r\nHe’s cunning, charming, and hot as sin. And he knows exactly how to use those qualities to get what he wants. Soon, Trihn is dragged deeper and deeper into his rapidly intensifying whirlwind.\r\n\r\nBut where a storm is brewing…destruction and devastation follow","torrent":{"xt":"urn:btih:8995fa0060cb4912b923a8476fa75b597cf5afb9","amp;dn":"All+That+Glitters+Series+-+K.A.+Linde","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8995fa0060cb4912b923a8476fa75b597cf5afb9","infoHashBuffer":{"type":"Buffer","data":[137,149,250,0,96,203,73,18,185,35,168,71,111,167,91,89,124,245,175,185]},"announce":[],"urlList":[]}}