{"title":"Break Chance Memento","uid":13155709,"size":578533440,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c573ca13ff881b37536b255c37f59455c2601f7&amp;dn=Break+Chance+Memento&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1452099862,"description":"STORY\r\nFour years ago, Shuuki's world was turned upside-down when his twin sister, Fuyuka, died in an accident at just 12 years of age. His parents blamed her death on the negligence of their eldest son, Natsume. The Amamiya family was never the same.\r\n\r\nOne fateful morning, Shuuki stumbles across the gruesome sight of his brother Masaharu's corpse. When all hope is lost and Shuuki must come to terms with the fact that his brother has been murdered, the mysterious Kyousuke appears before him with a proposition:\r\n\r\n&quot;Do you want to bring your brother back? To fix your family's broken relationship? You can…if you learn to travel through time.&quot;\r\n\r\nBefore he knows it, Shuuki is caught in a plot far more sinister than he could have ever imagined. He learns that the key to traveling through time and stopping innocents from being killed lies in mementos: items that are a link between the past, future, and present.\r\n\r\nFEATURES\r\n\r\n    A compelling science fiction story about a dysfunctional family and the youngest child's quest to save not just their lives, but their relationship\r\n    Over 6 hours of visual novel gameplay and exploring the city of Nagasaki, looking for mementos, and time traveling\r\n    8 different endings with 4 pursuable characters and lots of variation in the story based on the 70+ choices presented to the player\r\n    50+ unlockable CGs/images","torrent":{"xt":"urn:btih:8c573ca13ff881b37536b255c37f59455c2601f7","amp;dn":"Break+Chance+Memento","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c573ca13ff881b37536b255c37f59455c2601f7","infoHashBuffer":{"type":"Buffer","data":[140,87,60,161,63,248,129,179,117,54,178,85,195,127,89,69,92,38,1,247]},"announce":[],"urlList":[]}}