{"title":"Paul's Boutique Companion","uid":14689106,"size":11661351028,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8f22b11aa5762ccbf16b88fede4a75fe044cf823&amp;dn=Paul%27s+Boutique+Companion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":349,"time":1464180237,"description":"This is an anthology of material related to the Beastie Boys' Paul's Boutique that was assembled by the guy who did the Prince Homemade Deluxe Editions uploaded earlier. It contains a lot of rare content related to the Paul's Boutique album.\r\n\r\nHere is a list of what is contained in this torrent:\r\n\r\n1) Three high-resolution vinyl rips of the Paul's Boutique album from different official pressings.\r\n\r\n2) A collection of demos and early versions of songs recorded for Paul's Boutique.\r\n\r\n3) Singles, b-sides and rare tracks, many of which are completely out-of-print or have never been officially released.\r\n\r\n4) A complete instrumental version of the album.\r\n\r\n5) A collection of videos related to the album, including footage from the record released party, the Beasties on YO! MTV Raps, live footage and more.\r\n\r\n6) A complete collection of the songs sampled to create Paul's Boutique, in lossless quality.\r\n\r\n7) Rare pictures from the Paul's Boutique era.\r\n\r\n\r\nI hope you like this and please seed it. Also, the guy who created it wants you to buy Paul's Boutique if you like this. You don't have to buy twenty copies or something, just buy it on iTunes or Amazon if you don't already own a copy. The Beasties and all the artists and people involved deserve to make some money off their work","torrent":{"xt":"urn:btih:8f22b11aa5762ccbf16b88fede4a75fe044cf823","amp;dn":"Paul%27s+Boutique+Companion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f22b11aa5762ccbf16b88fede4a75fe044cf823","infoHashBuffer":{"type":"Buffer","data":[143,34,177,26,165,118,44,203,241,107,136,254,222,74,117,254,4,76,248,35]},"announce":[],"urlList":[]}}