{"title":"Coming Home XXX (2007) DVDRip x264","uid":13270128,"size":3050008839,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:904cf86088b24a42c77dfb4e66be69d57a684996&amp;dn=Coming+Home+XXX+%282007%29+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ImgSnaps","files":2,"time":1453390227,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/Fy3\r\n \nhttp://imgsnaps.com/image/Fy6\r\n\r\nCategory: Feature, Couples, Anal, IR, Military\r\n\r\nCast: Kirsten Price, Shyla Stylez, Vanessa Lane, Jada Fire, Brooke Banner, Savannah Stern, Gianna Lynn, Kayla Carrera as Kayla Carerra, Jessica Drake, Mikayla Mendez as Mikayla, Brad Armstrong, Barrett Blade, Charles Dera, Chris Cannon, Christian XXX as Christian, Derrick Pierce, Marcus London, Scott Lyons, Tyler Knight, Randy Spears\r\n\r\n\r\n.:Description:.\r\nComing Home is an epic of love, friendship, war and loss. Helmed by award-winning director Brad Armstrong (who also performs), Coming Home tells the story of a regular Joe who gets called to duty in Iraq and has to leave behind his girlfriend, his best buddy, and his entire life. What ensues is the kind of drama you usually find in legitimate Hollywood efforts, with a big budget and real acting, but Armstrong doesn't skimp on the sizzling sex. Kirsten Price stars, along with stellar performances by Shyla Stylez and Barrett Blade. Also features Gianna Lynn, Brooke Banner, Jada Fire, Vanessa Lane and others.\r\nWhen Brian Parsons (Brad Armstrong), receives a letter calling him to duty in Iraq, his life in a sleepy little town is shaken when the unthinkable becomes reality. Girlfriend Sarah (Kirsten Price), is distraught when she hears the news. In an effort to soothe her, Brian enlists the help of his best friend Jimmy (Barrett Blade) to keep an eye on her while he's away. Multi-award winning writer/director Brad Armstrong brings you this year's most anticipated adult drama. An unforgettable three hour epic ripped from today's headlines, Coming Home is extraordinary moviemaking.\r\nTake a look at screenshots! Enjoy!","torrent":{"xt":"urn:btih:904cf86088b24a42c77dfb4e66be69d57a684996","amp;dn":"Coming+Home+XXX+%282007%29+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"904cf86088b24a42c77dfb4e66be69d57a684996","infoHashBuffer":{"type":"Buffer","data":[144,76,248,96,136,178,74,66,199,125,251,78,102,190,105,213,122,104,73,150]},"announce":[],"urlList":[]}}