{"title":"Cut the Rope 2 v1.6.6 {Mod Money}","uid":13107320,"size":46573503,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9131b25982d7900b35e17c60ff53586520009b58&amp;dn=Cut+the+Rope+2+v1.6.6+%7BMod+Money%7D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":1,"time":1451342704,"description":"PERFECT! The mischief of Om Nom continuing in Cut the Rope 2! With new characters, new gameplay elements and clever quests, devoured sweet was never so fun!\r\n\r\nCut the Rope 2 brings new challenges and unexpected obstacles on the classic, successful physics game that has delighted millions of players around the world! If you like Cut the Rope, you'll love the Cut the Rope 2! \r\nWith new characters, new gameplay elements and, of course Om Nom, devoured sweet was never so fun! Complete quests smart to win medals, go into the game and discover specific levels. Play with your friends to see who achieves the highest score or try the puzzles yourself! \r\n\r\nThe Om Nom gets out of the box and begins an adventure full of surprises. It crosses beautiful forests, bustling cities, scrap yard and underground tunnels always chasing his only goal - THE SWEET! Along the way, you'll meet them Nommies, the most graceful assistants will accompany our favorite green monster in the unstoppable hunt of sweets! \r\n\r\nNEW LOCATION FOR EXPLORATION! Explore an interactive map and cut the rope in new areas filled with delicious sweets.\r\n \r\nMEET NEW CHARACTERS! Meet six new characters, Nommies, which will help you on your adventure. \r\n\r\nSHOW YOUR NEW HATS! Change the look of Om Nom, choose your favorite sweet and traces that leave your fingers on the screen. \r\n\r\nThe OM NOM IN COMPLETELY NEW ADVENTURES! Enjoy updated graphics, sound and gameplay. For the first time, you can move the Om Nom. \r\n\r\nOLOKAINOURIES SHIPPING! Collect all the stars and strategically placed fruit to complete the task at each track. \r\n\r\nMEET THE NOMMIES, THE YOUNG FRIENDS OF OM NOM! \r\n• O Roto can convey the Om Nom in the best spots to catch the sweets \r\n• The Lick can create small bridges with his tongue to help Om Nom reaches the target of \r\n• C Blue can elevate Om Nom in fun new levels \r\n• The Toss can throw objects, and pastries \r\n• The Boo can scare Om Nom to jump higher \r\n• The Snailbrow climbs fearless on walls and ceilings and poking sweet to pass the \r\n• The Ginger can burn obstacles to the Om Nom get sweets \r\nDo not waste time. Exciting surprises await you! Help him to get Om Nom his home ... cross the forest, cross the pond, the mantra with scrap metal and get the city and further! \r\n\r\nWhat’s New:\r\nRoto trained him to be able to lift more weight \r\n\r\nRequirements: 4.0+","torrent":{"xt":"urn:btih:9131b25982d7900b35e17c60ff53586520009b58","amp;dn":"Cut+the+Rope+2+v1.6.6+%7BMod+Money%7D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9131b25982d7900b35e17c60ff53586520009b58","infoHashBuffer":{"type":"Buffer","data":[145,49,178,89,130,215,144,11,53,225,124,96,255,83,88,101,32,0,155,88]},"announce":[],"urlList":[]}}