{"title":"MN: Impossible - Hip Hop Edition (2016)","uid":15032955,"size":825647951,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:937ce88f88cd70dae58744ccc27cc4abc7451836&amp;dn=MN%3A+Impossible+-+Hip+Hop+Edition+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mnimposs","files":15,"time":1466557573,"description":"MN:IMPOSSIBLE - HIP-HOP EDITION RELEASED TO THE RUNNING PUBLIC\r\n\r\n***Start listening to become an IMF Agent stationed in Minnesota - hunted by the Syndicate through a three-and-a-half month fitness program***\r\n\r\nMinneapolis, Minnesota- Legs, lies, and lutefisk. Welcome to the world of IMF Agent Nick Andrews: a spy forced to run for his life after being compromised by the mysterious crime Syndicate. But who ever thought the world's biggest threat would focus on the Land of 10,000 lakes?\r\n\r\nClick here to watch the trailer --&gt;\n\r\nIn &quot;MN:IMPOSSIBLE - Hip-Hop Edition&quot; you become/ the agent. Using the music player of your choice your headphones become the rogue audio-link to your team. In weekly episodes they'll guide you through gargantuan tasks at Minnesota's most recognizable landmarks including the Xcel Energy Center, the Soudan Mine, and the Mall of America.\r\n\r\nOriginally conceived as a way to encourage a close friend in his training for a half marathon, 8.5 hours of content quickly accumulated. This release includes all the weekly episodes that helped motivate that friend to achieve his goal.\r\n\r\nTo use - simply download the podcast and listen while running on the path of your choosing. The idea is to supplement your normal running schedule with one MN:IMPOSSIBLE each week. The program includes eleven 30 min. episodes and three 60 min. episodes - making it the perfect training companion people going out for their first 10k or half-marathon.\r\n\r\nThere's never been a more underground way to get in shape. In the vein of Zine culture and 'What If?' internet arguments, MN:IMPOSSIBLE guides you through the spider-web of Midwestern plot with stunts so big it would cause Agent Ethan Hunt to think twice.\r\n\r\nYour mission, if you choose to accept it, is to start training and become a part of a world unknown by the ever-threatened public. This message with self-destruct in five seconds...\r\n\r\n@mnimpossible","torrent":{"xt":"urn:btih:937ce88f88cd70dae58744ccc27cc4abc7451836","amp;dn":"MN%3A+Impossible+-+Hip+Hop+Edition+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"937ce88f88cd70dae58744ccc27cc4abc7451836","infoHashBuffer":{"type":"Buffer","data":[147,124,232,143,136,205,112,218,229,135,68,204,194,124,196,171,199,69,24,54]},"announce":[],"urlList":[]}}