{"title":"Arrows - Melissa Gorzelanczyk","uid":13351596,"size":1897152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93ee8a7b45341918c0b63e5c94c486d17f2742d0&amp;dn=Arrows+-+Melissa+Gorzelanczyk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454090805,"description":"A modern cupid story set in present-day Wisconsin combining the fantastical elements of Greek mythology with the contemporary drama of MTV's Teen Mom.\r\n\r\nPeople don’t understand love. If they did, they’d get why dance prodigy Karma Clark just can’t say goodbye to her boyfriend, Danny. No matter what he says or does or how he hurts her, she can’t stay angry with him . . . and can’t stop loving him. But there’s a reason why Karma is helpless to break things off: she’s been shot with a love arrow.\r\n\r\nAaryn, son of Cupid, was supposed to shoot both Karma and Danny but found out too late that the other arrow in his pack was useless. And with that, Karma’s life changed forever. One pregnancy confirmed. One ballet scholarship lost. And dream after dream tossed to the wind.\r\n\r\nA clueless Karma doesn’t know that her toxic relationship is Aaryn’s fault . . . but he’s going to get a chance to make things right. He’s here to convince Danny to man up and be there for Karma. But what if this god from Mount Olympus finds himself falling in love with a beautiful dancer from Wisconsin who can never love him in return?\r\n\r\nThis fast-paced debut novel explores the internal &amp; external conflicts of a girl who finds herself inexplicably drawn to a boy who seemingly doesn't reciprocate her  feelings, touching on the issues of love, sex and responsibility, with a heroine struggling to control her destiny--perfect for fans of Katie McGarry's novels and MTV’s 16 and Pregnant","torrent":{"xt":"urn:btih:93ee8a7b45341918c0b63e5c94c486d17f2742d0","amp;dn":"Arrows+-+Melissa+Gorzelanczyk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ee8a7b45341918c0b63e5c94c486d17f2742d0","infoHashBuffer":{"type":"Buffer","data":[147,238,138,123,69,52,25,24,192,182,62,92,148,196,134,209,127,39,66,208]},"announce":[],"urlList":[]}}