{"title":"Escape From Enlightenment: Marley's Journey - Tessa Rose (epub)","uid":13253341,"size":389114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9570ba7ac4f6b8fbbbb8dca83037d3cbce0c2309&amp;dn=Escape+From+Enlightenment%3A+Marley%27s+Journey+-+Tessa+Rose+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Number1SuperGuy","files":1,"time":1453198470,"description":"Have you ever imagined a society in which being gay was normal, and heteros cowered in the closets?\r\n\r\nMarley is a teenage girl in a post-World War III North America, where women have created a new, enlightened society. Boys and fertile breeder males are kept in camps, where their propensity for violence can never again hurt women or start wars. Women go to Reproduction Centers to have their eggs fertilized and brought to term in artificial wombs. Developing babies are hormonally influenced to have the same-sex attraction that keeps everyone content and happy in their segregated society. Heterosexual attraction is the gateway through which men could regain their destructive power, and is now considered an abhorrent lust.\r\nAt fourteen, Marley is worried about her lack of attraction to other girls. Then she meets Maddy, a girl from a barely-tolerated subculture that believes in modest dress, saving sex for marriage, and birthing babies naturally. She may be in love with Maddy. But should she tell Maddy that she secretly looks at boys online, and can’t stop thinking about them?\r\nOr should she follow subversive rumors about an underground network that smuggles heteros away to an island where they are free to love their own way?","torrent":{"xt":"urn:btih:9570ba7ac4f6b8fbbbb8dca83037d3cbce0c2309","amp;dn":"Escape+From+Enlightenment%3A+Marley%27s+Journey+-+Tessa+Rose+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9570ba7ac4f6b8fbbbb8dca83037d3cbce0c2309","infoHashBuffer":{"type":"Buffer","data":[149,112,186,122,196,246,184,251,187,184,220,168,48,55,211,203,206,12,35,9]},"announce":[],"urlList":[]}}