{"title":"Jet Fuel Toxicology - Mark L. Witten et al.","uid":14971484,"size":6564870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9824dda194facf26d0599e721a046a03093fb5a1&amp;dn=Jet+Fuel+Toxicology+-+Mark+L.+Witten+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1466207432,"description":"Jet Fuel Toxicology - Mark L. Witten et al. (CRC, 2011).pdf\r\n\r\nISBN 978-1-4200-8020-9\r\n\r\nCurrently serving as a resource for the National Center for Toxological Research in their work with the Gulf Coast oil spill, this book presents current research conducted primarily by the airforce on the toxic effects of JP-8 jet fuel on the pulmonary, immune, dermal, and nervous systems. In all, the book considers 13 toxicology studies of significance, the results of which are currently shaping US armed services policy. It will enable all of the hydrocarbon industry to make better choices regarding fuel handling.\r\n\r\nDue to its widespread use, jet fuel is thought to be the largest toxicant exposure risk for U.S. Armed Services personnel. Taking a proactive approach to the potential dangers of repeated human exposure to hydrocarbon fuels, the Air Force Office of Scientific Research (AFOSR) sponsored a number of research projects during the last 20 years investigating health effects resulting from specific exposure to JP-8 (Jet Propellant-8).\r\n\r\nJet Fuel Toxicology summarizes the newest and most important results of these extensive research programs carried out by hydrocarbon fuel research groups throughout the U.S. Each book chapter highlights one specific research area from the many topical areas comprising jet fuel toxicology. After examining the contents and general action of JP-8, the book looks at how the fuel affects various body functions highlighted by:\r\n\r\nEffects on daily inhalation on the respiratory system\r\nAcute and long-term neurotoxicological and neurobehavioral effects\r\nBoth local and systemic toxicity following exposure through the skin\r\nImmunotoxicity from pulmonary and dermal exposures\r\nGenetic damage, as evidenced in studies of the blood and bone marrow of mice\r\n\r\nIn all, the book considers 13 major toxicology areas of study, the results of which will enable all of the hydrocarbon industry to make fuel choices that more carefully consider possible human health risks.\r\n\r\nPerhaps even more importantly, the book profoundly demonstrates how unfortunate lessons from the following major chemical exposure scenarios of the past must not be lost in the ongoing protection of both military personnel and civilians:\r\n\r\nAgent Orange exposures during the Vietnam War\r\nMultiple chemical/stressor exposures, including multiple fuels and solvents, during the Persian Gulf Wars\r\nChemical exposures, including Jet-A fuel, during the 9/11 World Trade Center Disaster\r\nHydrocarbon/oil dispersing compound exposures during the Gulf of Mexico Oil Spill Crisis of 2010\r\n\r\nFor example, based on data contained in this book, the Air Force now removes female personnel from any exposure to jet fuel during their pregnancies and has reduced permissible exposure levels to jet fuel for all military and associated civilian staff. Ultimately, this book can serve as a template for managing future toxicological issues for both international armed forces and those corporations willing to learn from these important lessons","torrent":{"xt":"urn:btih:9824dda194facf26d0599e721a046a03093fb5a1","amp;dn":"Jet+Fuel+Toxicology+-+Mark+L.+Witten+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9824dda194facf26d0599e721a046a03093fb5a1","infoHashBuffer":{"type":"Buffer","data":[152,36,221,161,148,250,207,38,208,89,158,114,26,4,106,3,9,63,181,161]},"announce":[],"urlList":[]}}