{"title":"Right Click Enhancer Professional v4.4.0.0","uid":15031800,"size":8381950,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9c289f6c9a1dcf47f525454a7b5cd6f12cfc7dc0&amp;dn=Right+Click+Enhancer+Professional+v4.4.0.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZarkBit","files":1,"time":1466552795,"description":"Right Click Enhancer Professional v4.4.0.0\r\n\r\n...A control panel for your right click menu on windows. Add most used applications and folder shortcuts in your right click menu. Manage these right click shortcuts by creating right click sub menus and putting them into these sub menus. Easily remove or disable right click menu entries added by other applications. Save valuable time by using right click tweaks that provides easy to use quick operations directly in your right click. Save time in copy paste operations by adding new folder shortcuts in send to menu. Add new file types into New menu to ease the operation of creating new files. Add templates files to new menu so you can get preformatted files upon creating new files and start working on it in less time.\r\n \r\nTake control over your right click menu with this tool. Right Click Enhancer Professional comes with following features.\r\n\r\nAdd new and improved functionality to your right-click mouse button\r\nAdd applications, files, and folder shortcuts to your right click context menu\r\nCreate sub-menus to add even more items\r\nAvoid the clutter of putting every single shortcut on your desktop\r\nAccess common file management tasks using your right-click button\r\nRemove or Disable unwanted existing right-click menu entries\r\nAdd new folder shortcuts to send to sub menu to ease the copy operation\r\nAdd new file types to new menu to create new files easily","torrent":{"xt":"urn:btih:9c289f6c9a1dcf47f525454a7b5cd6f12cfc7dc0","amp;dn":"Right+Click+Enhancer+Professional+v4.4.0.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c289f6c9a1dcf47f525454a7b5cd6f12cfc7dc0","infoHashBuffer":{"type":"Buffer","data":[156,40,159,108,154,29,207,71,245,37,69,74,123,92,214,241,44,252,125,192]},"announce":[],"urlList":[]}}