{"title":"Castlevania Symphony Of The Night (iso)","uid":13366477,"size":391780243,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a0c12f2e944282b9fdb098c99bc2a7a1f5b9c78d&amp;dn=Castlevania+Symphony+Of+The+Night+%28iso%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiodosgames","files":1,"time":1454170713,"description":"Castlevania: Symphony of the Night é um jogo de ação-aventura 2D desenvolvido e distrubuído pela Konami em 1997.\r\n\r\nSeu título original em japonês é Akumajo Dracula X: Gekka no Yasokyoku (Akumajo Dorakyura Ekkusu: Gekka no Yasokyoku, &quot;Castelo Demoníaco do Dracula X: Noturno na Luz da Lua&quot;).\r\n\r\nEle é o 13º título da série Castlevania, sendo o primeiro a ser lançado para o console PlayStation e a seqüência direta de Akumajo Dracula X Chi no Rondo.\r\n\r\nSymphony of the Night foi uma obra importante para a série Castlevania. Ele levou a série a um novo patamar, diferente dos jogos de plataforma &quot;estágio-por-estágio&quot; dos títulos anteriores e introduziu um novo estilo de jogabilidade com elementos de jogos de RPG, o que foi simulado por muitos de seus sucessores na série. Uma forma semelhante e mais antiga deste tipo de jogabilidade foi usada em Castlevania II: Simon's Quest.\r\n\r\nO desenvolvimento destas características pode ser atribuído a Koji Igarashi, o diretor do jogo e atualmente o diretor de toda a série. Igarashi, um notável fã de jogos em 2D, foi fundamental em refinar a tabela de controles do jogo. Ele também estabeleceu o jogo como canônico à série Castlevania, em uma tentativa de entrelaçar vários fins de histórias na cronologia da série durante Symphony of the Night.\r\n\r\nPlataforma : PS1\r\n\r\nIdioma : Usa","torrent":{"xt":"urn:btih:a0c12f2e944282b9fdb098c99bc2a7a1f5b9c78d","amp;dn":"Castlevania+Symphony+Of+The+Night+%28iso%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0c12f2e944282b9fdb098c99bc2a7a1f5b9c78d","infoHashBuffer":{"type":"Buffer","data":[160,193,47,46,148,66,130,185,253,176,152,201,155,194,167,161,245,185,199,141]},"announce":[],"urlList":[]}}