{"title":"Top Bike: Racing &amp; Moto Drag v1.01 APK +DATA","uid":13091104,"size":207812832,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a4f1a242eab7af6f7d607d4be8c9b436a87ed2ed&amp;dn=Top+Bike%3A+Racing+%26amp%3B+Moto+Drag+v1.01+APK+%2BDATA&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1451043655,"description":"Top Bike: Racing &amp; Moto Drag v1.01 APK +DATA\r\n\r\nFeatures:\r\n•\t71+ heavily modded bikes to choose from\r\n•\tTune and customize your bike any way you want\r\n•\tEnjoy an epic story of underground rivalry and gang battles\r\n•\tProve yourself against the most brutal kings of the road\r\n•\tExpress yourself through millions of motor customization options\r\n•\tExplore a huge city ruled by dangerous daredevils and hardcore criminals\r\n•\tAvailable in 17 language versions\r\n•\tExtremely smooth graphics on all devices\r\n\r\nRIDE EPIC BIKES\r\nRace on a huge selection of easily customizable motorcycles ranging from badass choppers to fast motocross bikes. All prepped up, loaded with nitro and ready to unleash their full fury on the asphalt below.\r\nThere’s also a treat for all of the dirt fanatics out there - you can drive real quads. Experience speed that cannot be stopped by anything less than a brick wall!\r\n\r\nCHALLENGE THE BIGGEST AND THE BADDEST\r\nFeel the adrenaline overload as you start racing against the biker gangs that rule The City. They are the famous 1%, the outlaw bike racers who thrive on crime and their need for the rush of speed. They believe that all of the best things in the world are for free (when you take them forcibly) and that having fun in life is the only thing that matters. Except for power and money, of course.\r\n\r\nEXPRESS YOURSELF\r\nCustomize your bike with unique tuning - slap some decals and paint it with your favourite color. Go crazy with the combinations, it’s your ride - your rules. In illegal drag racing competitions being creative about your bike is the only way to become known and respected.\r\n\r\nEXPLORE THE URBAN SPRAWL\r\nThe City is split into districts, each run by a different bike gang. You’ll have to beat all of the renegade bikers if you hope to assume direct control over The City. Race in a deep selection of realistic game modes and challenges.\r\n\r\nBECOME A LEGEND OF THE ROAD\r\nThe great highway awaits for those brave enough to compete with the best racing competitors in the world of underground bike community. You have to be hardcore to keep up with the criminal kings of the road - but the prize for the best moto racer is really big. Do you think you can become the new bike gang leader of The City?\r\n\r\nEASY RIDER\r\nThis bike racing game is optimized to work smooth on most devices. Additionally it was translated into 17 languages from all over the world. Nothing can stop you from owning the streets now!\r\nSee you on the road, player!\r\n\r\nBEAT YOUR RIVALS IN THE TOP BIKE RACING GAME\r\nBreak all the rules and experience mindblowing bike racing action set in a huge urban sprawl called The City. Separated into a set of districts, each with its own look and real feel. Prepare for heart-stopping and breathtaking thrills you have never seen in mobile games before. \r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play. \r\nRequired Android O/S : 2","torrent":{"xt":"urn:btih:a4f1a242eab7af6f7d607d4be8c9b436a87ed2ed","amp;dn":"Top+Bike%3A+Racing+%26amp%3B+Moto+Drag+v1.01+APK+%2BDATA","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f1a242eab7af6f7d607d4be8c9b436a87ed2ed","infoHashBuffer":{"type":"Buffer","data":[164,241,162,66,234,183,175,111,125,96,125,75,232,201,180,54,168,126,210,237]},"announce":[],"urlList":[]}}