{"title":"Bleach Brave Souls v2.6.2.rar","uid":14941339,"size":31670445,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a8d20404bd9c6dfd76ec9d870639130fecbfa817&amp;dn=Bleach+Brave+Souls+v2.6.2.rar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"biimmhh","files":1,"time":1466021355,"description":"EXCITING 3D ACTION\r\n3D graphics and simple controls make for free-flowing and fast-paced hack-and-slash action.\r\nEPIC SPECIAL MOVES\r\nUnleash each Bleach character's unique special moves to carve your way to victory. Special moves are fully voiced by the original Japanese anime voice actors.\r\n\r\nTHREE'S COMPANY\r\nCombine your favorite characters into teams of three. You can even make combinations of characters you would never see in the original story. The possibilities are almost limitless!\r\n\r\nRELIVE THE BLEACH STORY\r\nFollow the Bleach story from the moment Rukia and Ichigo first meet. Develop your characters as you complete quests that recreate pivotal scenes from the story.\r\n\r\nBATTLE OTHER PLAYERS\r\nCompete in weekly leagues. Pit your best warriors against other players' teams and vie for the top spot.\r\n\r\nDEVELOP YOUR CHARACTERS\r\nBrave Souls features a highly flexible character improvement system that allows you to create exactly the warriors and the team you want. Enter battle and earn experience to level up characters and improve their base stats, Ascend them to increase their max level, train them on the Soul Tree to further improve specific stats, or link characters together to provide additional support. The choice is yours!\r\n\r\n\r\nWhat’s New: v 2.6.2\r\nFriend Points Display Changed\r\nThe Friend Points display on the Main and Purchase EXP Booster screens will now only show the number of Friend Points you currently have.\r\nAlly Icon Changed\r\nOn the Prepare for Quest screen and during quests, the icon for your Ally will now change to indicate whether the Ally is a Friend or a Guest","torrent":{"xt":"urn:btih:a8d20404bd9c6dfd76ec9d870639130fecbfa817","amp;dn":"Bleach+Brave+Souls+v2.6.2.rar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d20404bd9c6dfd76ec9d870639130fecbfa817","infoHashBuffer":{"type":"Buffer","data":[168,210,4,4,189,156,109,253,118,236,157,135,6,57,19,15,236,191,168,23]},"announce":[],"urlList":[]}}