{"title":"A Million Little Bricks (2012).epub Gooner","uid":13174520,"size":32263695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad690b2b5ed76fd8a32bf98b2b3db552b6be383d&amp;dn=A+Million+Little+Bricks+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452273635,"description":"A Million Little Bricks - The Unofficial Illustrated History of the LEGO Phenomenon (2012).epub Gooner\r\n\r\nPublisher: Skyhorse Publishing; 1 edition (September 26, 2012)\r\nLanguage: English\r\nISBN-10: 1620870541\r\nISBN-13: 978-1620870549\r\n\r\nToy of the Year, Toy of the Century, Greatest Toy of All Time . . . there aren't many titles that haven’t been bestowed on LEGO toys, and it’s not hard to see why. From its inception in the early 1930s right up until today, the LEGO Group’s history is as colorful as the toys it makes. Few other playthings share the LEGO brand’s creative spirit, educative benefits, resilience, quality, and universal appeal. The LEGO name is now synonymous with playtime, but it wasn’t always so. This history charts the birth of the LEGO Group in the workshop of a Danish carpenter and its steady growth as a small, family-run toy manufacturer to its current position as a market-leading, award-winning brand. The company’s ever-increasing catalogof products—including the earliest wooden toys, plastic bricks, play themes, and other building systems such as DUPLO, Technic, and MINDSTORMS—are chronicled in detail, alongside the manufacturing process, LEGOLAND parks, licensed toys, and computer games. Learn all about how LEGO pulled itself out of an economic crisis and embraced technology to make building blocks relevant to twenty-first-century children and discover the vibrant fan community of kids and adults whose conventions, websites, and artwork keep the LEGO spirit alive. As nostalgic as it is contemporary, A Million Little Bricks will have you reminiscing about old Classic Space sets, rummaging through the attic for forgotten Minifigure friends, and playing with whatever LEGO bricks you can get your hands on (even if it means sharing with your kids)","torrent":{"xt":"urn:btih:ad690b2b5ed76fd8a32bf98b2b3db552b6be383d","amp;dn":"A+Million+Little+Bricks+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad690b2b5ed76fd8a32bf98b2b3db552b6be383d","infoHashBuffer":{"type":"Buffer","data":[173,105,11,43,94,215,111,216,163,43,249,139,43,61,181,82,182,190,56,61]},"announce":[],"urlList":[]}}