{"title":"Stossel.2015.12.18.Lessons.From.2015.720p.webrip.mp4","uid":13174095,"size":793514285,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ae2e7744d6c0fbe86bd40b14bf3014d60247a233&amp;dn=Stossel.2015.12.18.Lessons.From.2015.720p.webrip.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BBreach","files":1,"time":1452270243,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nLESSONS FROM 2015\r\n\r\nFriday at 8PM ET on FBN\r\n\r\nHopefully we learned something this year. Here's our show:\r\n\r\nPRESIDENTIAL RACE: Right now these two candidates lead in the polls:\r\n\r\n\r\n\r\nBut if I've learned anything, it's that polls don't mean squat. Election Betting Odds are far more accurate.\r\n\r\nWe ask our panel - Katherine Mangu-Ward of Reason, Dan Mitchell of Cato, and Fox Contributor Deneen Borelli - who they think has the best shot to become our next president.\r\n\r\nTHE TROUBLE WITH TERROR: Islamic terrorism dominated news coverage this year. Our panel debates what America should do about it.\r\n\r\nBLACK LIVES MATTER: We were told that the &quot;election of a black president&quot; would reduce racial conflict in America. That hasn't happened. My panel debates the &quot;Black Lives Matter&quot; movement.\r\n\r\nECONOMIC SUCCESS: This year, Democrats railed against &quot;income inequality&quot; and the &quot;loss of the middle class.&quot; But incomes are up since the 70s: Up 48% among the poorest fifth and up 40% for the middle class.\r\n\r\nP.C. U: One of my social media followers calls 2015 &quot;the year of being offended.&quot; And he's right. From Yale to Princeton to the University of Missouri, college campuses became the headquarters of a new censorship movement. It's gotten so bad that a recent Pew study found 40% of college-aged students are okay with government limiting speech offensive to minorities.\r\n\r\nSTOSSEL'S TAKE: Today's politicians don't think the rules apply to them. Kimberly Strassel's Wall Street Journal column, &quot;No Political Guardrails&quot; is sad, but correct. The President &quot;wants what he wants. If ObamaCare is problematic, he unilaterally alters the law. If the nation won't support laws to fight climate change, he creates one with regulation.&quot; Hillary Clinton is no better. She says if Congress won't approve gun control or higher taxes, she will make it happen without Congress. Now Republicans demand the IRS audit the Clinton Foundation. Where are the guardrails here? &quot;When did conservatives go from wanting to abolish the IRS to wanting to use it to punish rivals?&quot;\r\n\r\nThe more outrageous Trump acts, the more his numbers soar, the more press coverage. More humble candidates-those with modest plans that respect the constitution-get lost in the shouting. That's the bad news this year.\r\n\r\nBut some good news: 7 states passed Education Choice programs. 13 expanded existing ones. Gay marriage became legal. 2 more states legalized marijuana. Finally, amidst this year's depressing coverage of crime and income inequality, crime continues to drop, and the poor keep getting richer If people are left free, good things usually happen.\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2","torrent":{"xt":"urn:btih:ae2e7744d6c0fbe86bd40b14bf3014d60247a233","amp;dn":"Stossel.2015.12.18.Lessons.From.2015.720p.webrip.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2e7744d6c0fbe86bd40b14bf3014d60247a233","infoHashBuffer":{"type":"Buffer","data":[174,46,119,68,214,192,251,232,107,212,11,20,191,48,20,214,2,71,162,51]},"announce":[],"urlList":[]}}