{"title":"Vincent Price Collection Preview [CSA]","uid":15062245,"size":66593030,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b2d1162c3d0538c942e631ac3445962feb78ea00&amp;dn=Vincent+Price+Collection+Preview+%5BCSA%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CS2016","files":3,"time":1466768759,"description":"Welcome to the Vincent Price Collection Preview. Sit back and relax as you enjoy a sample video called &quot;Vincent&quot;. Also included are cover images of additional titles available in the 400 gigabyte mega-torrent &quot;ChristianStuff&quot;. \r\n\r\nOur digital library offers hundreds of files in three categories: Christian, Health and Fiction.\r\n\r\nThe speed at which files can be retrieved depends on patrons making returns to the library by sharing the files they receive. In other words, the success of this archive depends on you!\r\n\r\nTo access the library you'll need to get the torrent file from TorCache or you can use the magnet link (THE LINKS ARE IN THE README).\r\n_____________________________________________________________________________________\r\n\r\nMORE INFO:\r\n\r\nOur extensive 80 gigabyte collection of Vincent Price includes more than 150 animations, movies, television show appearances and commercials, spanning over 50 years of Mr. Price's works.\r\n\r\nFor those of you who may be unfamiliar with him, please allow me to introduce you to Mr. Vincent Leonard Price, Jr., born on May 27, 1911 in St. Louis, Missouri. \r\n\r\nMr. Price was an American actor known for his distinctive voice and performances in horror films. His career spanned other genres, including film noir, drama, mystery, thriller, and comedy. He appeared on stage, television, radio, and in over one hundred films. He earned two stars on the Hollywood Walk of Fame: one for motion pictures, and one for television.\r\n\r\nHe was also an art collector and consultant, with a degree in art history. He founded the Vincent Price Art Museum in California, lectured and wrote books on the subject.\r\n\r\nHe also enjoyed exotic cuisine and was considered to be a noted gourmet cook.\r\n\r\nDuring his life, he was married three times and had two children. He passed away in Los Angeles, California on October 25, 1993, at the age of 82.\r\n_____________________________________________________________________________________\r\n\r\nTITLES:\r\n\r\n1940 The Invisible Man Returns\r\n\r\n1946 Dragonwyck\r\n\r\n1953 House Of Wax\r\n\r\n1958 The Fly\r\n\r\n1956 The Ten Commandments \r\n\r\n1959 House On Haunted Hill\r\n\r\n1960 House Of Usher Cover\r\n\r\n1961 Master Of The World\r\n\r\n1961 Pit And The Pendulum\r\n\r\n1963 The Raven\r\n\r\n1971 The Abominable Dr Phibes\r\n\r\n1990 Edward Scissorhands\r\n\r\n*** MORE ***\r\n_____________________________________________________________________________________\r\n\r\nYou may be wondering why a Christian would have anything to do with an icon of horror and the kingdom of darkness? \r\n\r\nEXCELLENT QUESTION !!! Why do we do what we do ???\r\n\r\nFor all of my brothers and sisters in Christ:\r\nMy prayer is that next Halloween you might think twice!\r\n\r\nWe are to fear the Lord and depart from evil,\r\nBut that's not what's practiced amongst God's people!\r\n\r\nOnce a year we desire to quiver in fright,\r\nAs we celebrate Satan with ghoulish delight.\r\n\r\nHaunted houses with ghosts, goblins and demons,\r\nHorror fills the night with terror and scream'n!\r\n\r\n&quot;But it's just for fun&quot; you might say,\r\nOf that most unholy pagan holiday.\r\n\r\nPlease take a long look in the mirror tonight:\r\nDo you see any resemblance to the late Vincent Price?\r\n_____________________________________________________________________________________\r\n\r\nFor we wrestle not against flesh and blood, \r\nbut against principalities, against powers, \r\nagainst the rulers of the darkness of this world, \r\nagainst spiritual wickedness in high places. \r\nEphesians 6:10-18\r\n\r\nChristianStuff: Health mind, body and soul!","torrent":{"xt":"urn:btih:b2d1162c3d0538c942e631ac3445962feb78ea00","amp;dn":"Vincent+Price+Collection+Preview+%5BCSA%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d1162c3d0538c942e631ac3445962feb78ea00","infoHashBuffer":{"type":"Buffer","data":[178,209,22,44,61,5,56,201,66,230,49,172,52,69,150,47,235,120,234,0]},"announce":[],"urlList":[]}}