{"title":"Blood.And.Water.S01E08.HDTV.Subtitulado.Esp.SC.avi","uid":13088862,"size":181937682,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b539d17e8a355089fb7e3d2123a66e6e546e8c7e&amp;dn=Blood.And.Water.S01E08.HDTV.Subtitulado.Esp.SC.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"psmv","files":1,"time":1450997993,"description":"1x08 - Episode 8 (Season Finale)\r\n\r\nThe one thing Josephine (&quot;Jo&quot;) Bradley (30) knows is that she is a good cop. She's ambitious and tough (or thinks she is) and has just been assigned her first big case as Lead Detective following her recent promotion in Vancouver's Homicide Division. Born in China and abandoned by a family she never knew, Jo was adopted as a toddler and relocated to Vancouver. Raised by a single mother, a Professor of Sinology, Jo wanted for nothing growing up. But, much to her mother's chagrin, Jo chose policing as a career. When Charles Xie, the son of a prominent real estate developer, goes missing and his body is found ritualistically buried, Jo is assigned the case. It happens on one of the worse days of her life following a cancer diagnosis and an imminent and difficult decision about treatment. But Jo will need to put the personal aside when she goes head-to-head with the wealthy and privileged Xie family, led by the tyrannical and powerful patriarch, Li-Rong Xie. Risking her career, Jo will be forced to tear the family apart and reveal long held secrets in order to solve the murder of their troubled middle son. The cat-and-mouse game she plays to fracture the Xie family will also leave Jo broken and searching for her own identity and the meaning of family","torrent":{"xt":"urn:btih:b539d17e8a355089fb7e3d2123a66e6e546e8c7e","amp;dn":"Blood.And.Water.S01E08.HDTV.Subtitulado.Esp.SC.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b539d17e8a355089fb7e3d2123a66e6e546e8c7e","infoHashBuffer":{"type":"Buffer","data":[181,57,209,126,138,53,80,137,251,126,61,33,35,166,110,110,84,110,140,126]},"announce":[],"urlList":[]}}