{"title":"The Star of Bethlehem -  Returned 2015","uid":13082083,"size":1253114029,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5621840ba6c867d1e09657a1a1e44c212f32ec1&amp;dn=The+Star+of+Bethlehem+-++Returned+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":10,"time":1450911604,"description":"POtHS comment. Excellent, this is a MASTERPIECE\r\n\r\n\r\nDescription\r\n\r\n\r\nWow,Wow and WOW. What a Christmas Gift. I have watched this presentation 5 times in the last 2 days. Magnificent this is. This MOVIE will move all that watch. Believers and non-believers alike are in AWH at this presentation. You should watch this Christmas Day and see what the Stars say about December 25. It is not what you think. The Lunar eclipse as we witnessed LAST NIGHT in California is a True sign of The Maker Yahweh. In 2014 and 2015 4 of these happenings occur on Jewish Feast Holidays. If that not a Prophetic sign, NOTHING IS. New software lets you look at the Same Sky the Jesus looked at 2000 years ago. This is Spectacular. This new Software that is included in this Folder.\r\n\r\nYou can see the same skies the Jews gazed at thousands of years ago when the Star of Bethlehem appeared in the Skies to Mark the Birth of Jesus of Nazareth.\r\n\r\n\r\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\r\n\r\nThe Entire Collection of POtHS can be found here: \r\n\r\nJESUS: Believe this about Jesus to move on to Greener Pastures.\r\n\r\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\r\n\r\n\r\nRAPtURE (My transportation outta here).\r\n\r\nThe Blessed Hope.  If you believe in The Rapture you better believe That The Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\r\n\r\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\r\n\r\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\r\n\r\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...\r\n\r\nMay Yahweh Bless You as He has me. Seed Long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \r\n\r\nDo Not believe anything you find here, search the Scriptures daily to determine the tRUtH","torrent":{"xt":"urn:btih:b5621840ba6c867d1e09657a1a1e44c212f32ec1","amp;dn":"The+Star+of+Bethlehem+-++Returned+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5621840ba6c867d1e09657a1a1e44c212f32ec1","infoHashBuffer":{"type":"Buffer","data":[181,98,24,64,186,108,134,125,30,9,101,122,26,30,68,194,18,243,46,193]},"announce":[],"urlList":[]}}