{"title":"Roma 1 XXX (2008) DVDRip x264","uid":13165084,"size":1794991071,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:b6dd3d85f073bc6affb8a979b483903eb3e3f32e&amp;dn=Roma+1+XXX+%282008%29+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":2,"time":1452195842,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/Jb\r\n \nhttp://imgsnaps.com/image/Jc\r\n\r\nCategory: Feature, European, Anal, DP, Couples, Costumes/Uniforms\r\n\r\nCast: Angel Dark, Julia Taylor, Boroka Bolls as Boroka Balls, Claudia Rossi, Daria Glower, Jennifer Love, Lydia St. Martin as Lidia St. Martin, Vanessa Mae, Dora Venter, Cayenne Klein, Giselle Monet as Alexis, Emili Doll as Emily Doll, Lea Lexus, Renata Black, Yasmine Gold, Jennifer Stone, Coreena as Cory Baby, Lily as Milla Pussinova, Alex as Vanilla Ice, Nataly Lancaster, Josette Most, George Uhl, Andrea Moranty as Andrea Moranti, Clarke Kent, Roberto Malone, Franco Roccaforte, Francesco Malcom, Cristian Devil as Cristian, Roberto Maori as Roberto Lyon, Kid Jamaica, Fausto Moreno as Fausto, Jazz Duro, Marco Nero, Kendo\r\n\r\n\r\n.:Description:.\r\nAmbition... Power... Lust...\r\nYear 51 B.C.. After 8 years of war, the Caesar Triumphs in the war against the Gaul. There are celebrations for the victory and the return to Rome. Meanwhile, in the capital of the empire, Pompeo, Senator loved by the people, loses his wife, the first daughter of Caesar.Caesar, informed about a plot from the senate against his downfall, decides to re-enter Rome in full force. The army at the head of which ride centurion Lucio Voreno and Legionary Tito Pullio, arrive in Rome to find an empty city without institutions. This causes the senate to declare Caesar a dictator. Pompeo, in order to avoid the civil war, leaves Rome with his wife and the rebellious senators, and exiles himself in Greece. meanwhile, Lucio returns back home, and realizes that his wife has changed and Tito Pullio and Ottavia uncover a hidden plot...\r\n\r\nHelp us by donating with BitCoin : 16ZqgDUT9nBP698ianQeTrwSMuWVB6FfMp","torrent":{"xt":"urn:btih:b6dd3d85f073bc6affb8a979b483903eb3e3f32e","amp;dn":"Roma+1+XXX+%282008%29+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6dd3d85f073bc6affb8a979b483903eb3e3f32e","infoHashBuffer":{"type":"Buffer","data":[182,221,61,133,240,115,188,106,255,184,169,121,180,131,144,62,179,227,243,46]},"announce":[],"urlList":[]}}