{"title":"IndigoByte Dr.Explain Ultima v5.2.1018","uid":13417265,"size":46741910,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b7a6bb28e8a048be3f3a51ef761e546590a06def&amp;dn=IndigoByte+Dr.Explain+Ultima+v5.2.1018&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZarkBit","files":1,"time":1454508393,"description":"IndigoByte Dr.Explain Ultima v5.2.1018\r\n\r\nDr.Explain captures application screens or web pages and documents them automatically!\r\n\r\nDr.Explain is based on a unique interface analysis and screen capture system. Thanks to this system, Dr.Explain can automatically analyze an application’s user interface, take screenshots of all controls and elements, and then add explanatory callouts to all images in the draft help system. After that, all one needs to do is add descriptions to the callouts, and save the result in the HTML, CHM, RTF, or PDF format. \r\n\r\n\r\nMake help files and online manuals for Windows software, Web sites, Java and Flash applications\r\n\r\nThe Dr.Explain will analyze the structure of your software interface and will generate help topic drafts for it automatically. If you are a Web developer, then the HTML parsing capabilities will help you quickly document all significant parts of your Web site as well. It doesn't matter what technology or tools you used to design your software GUI. The Dr.Explain can make help documentation for any solution.\r\n\r\n\r\nAutomatically create annotations for your screenshots based on window or Web form structure\r\n\r\nThe Dr.Explain tool is exceptionally useful for authoring help files with many screenshots and technical illustrations. The built-in capturing tool analyzes internal structure of captured windows or web forms and automatically creates numbered annotations for all significant GUI elements: buttons, fields, options, menus, toolbars, and so on. You must just add some descriptive text to complete the topic. With other help authoring tools those operations would take hours while with the Dr.Explain you can accomplish it in minutes.\r\n\r\n\r\nCreate help manuals in different formats from a single source\r\n\r\nWith the Dr.Explain you can easily generate a complete array of end user help in various formats from a single source file. The Dr.Explain can make CHM help files, create online help manuals and prepare printable manuals in RTF and PDF formats. Electronically distribute your help file with application; put it on your product website; or deliver it as a printed manual within the box.\r\n\r\n\r\nEasily invoke your help files from any programming language\r\n\r\nMany software vendors have already appreciated the simplicity of the Dr.Explain help file maker. The produced help files and online manuals can be easily built in any solution and invoked from any programming language. The common use cases include but are not limited to the following technologies: C, C++ (MFC &amp; WTL), Visual Basic, C#, VB.NET, ASP.NET, WinForms, WPF, Delphi &amp; Object Pascal, Clarion, FoxPro, PHP, Perl, HTML, JavaScript, and many more.\r\n\r\n\r\nGet the professional help authoring tool at affordable price\r\n\r\nThe Dr.Explain is a professional level help file authoring tool with many features at affordable price of $190(US) per license. The tool will pay for itself on the first project because it's a great time and money saver. The Dr.Explain is a good choice for any software vendor, from micro ISV and freelancers, to big software development companies and studios","torrent":{"xt":"urn:btih:b7a6bb28e8a048be3f3a51ef761e546590a06def","amp;dn":"IndigoByte+Dr.Explain+Ultima+v5.2.1018","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7a6bb28e8a048be3f3a51ef761e546590a06def","infoHashBuffer":{"type":"Buffer","data":[183,166,187,40,232,160,72,190,63,58,81,239,118,30,84,101,144,160,109,239]},"announce":[],"urlList":[]}}