{"title":"Stossel.2015.12.11.Security.Vs.Liberty.720p.webrip","uid":13129874,"size":792168903,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8206000bcae6d13ce417b5e6428a69b73900996&amp;dn=Stossel.2015.12.11.Security.Vs.Liberty.720p.webrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BBreach","files":1,"time":1451829662,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nSECURITY VS. LIBERTY\r\n\r\nFriday at 8PM on FBN\r\n\r\nCLASH OF CIVILIZATIONS: Donald Trump says we should ban all Muslims from coming to America. Does he go too far? &quot;Lights Out&quot; author Mark Steyn says we should at least talk about that. We cannot coexist with Islam, says Steyn. Our values are too different.\r\n\r\nNSA SPYING: Government has stopped gathering Americans' phone records. Does this mean we're now more vulnerable to terror? Senator Rand Paul, whose filibuster helped end the program, says no. He says, &quot;government investigated [the program], and found that no terrorist case has been thwarted through this.&quot;\r\n\r\nCIVIL LIBERTIES: France increased its security measures since the Paris attacks. Why wouldn't it? But Reason's Anthony Fisher says the French government went too far. Even climate activists were put under house arrest.\r\n\r\nHOME GROWN GOVERNMENT: Another way terror threatens our freedom? It causes government to grow. After 9/11, Bush created the Department of Homeland Security and the widely loathed TSA. DHS has already almost doubled its spending since its creation, and now both Democrats and Republicans say we need to give them more money! We don't. DHS already assigns itself tasks that have little to do with what most people consider &quot;homeland security.&quot; It polices movie piracy, counterfeit NBA merchandise, and teaches nightclub strippers about sex trafficking.\r\n\r\nREFUGEE CRISIS: Americans worried about past waves of refugees, majorities of Americans opposed admitting Vietnamese, Jews, Cubans, etc. and yet, those refugees did well here in America. We'll debate whether accepting refugees is still a good idea in the age of ISIS.\r\n\r\nMY TAKE: There will always be crazy people who do horrible things. But we are lucky to live in America where, despite the killings in California, we are safer than we once were. Even when we get scared, we should not give up our liberty &quot;for a false sense of security.&quot;\r\n\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2","torrent":{"xt":"urn:btih:b8206000bcae6d13ce417b5e6428a69b73900996","amp;dn":"Stossel.2015.12.11.Security.Vs.Liberty.720p.webrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8206000bcae6d13ce417b5e6428a69b73900996","infoHashBuffer":{"type":"Buffer","data":[184,32,96,0,188,174,109,19,206,65,123,94,100,40,166,155,115,144,9,150]},"announce":[],"urlList":[]}}