{"title":"Chick Carter, Detective (1946) Old Time Serial (OTS)","uid":13104867,"size":3566249984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9f82aa07a657d9d693931cb1eb3547433a7e8e4&amp;dn=Chick+Carter%2C+Detective+%281946%29+Old+Time+Serial+%28OTS%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MikeyMoMo","files":15,"time":1451275430,"description":"From 1946, in glorious Black and White comes Chick Carter, Detective.  This is another in the Old Time Serial collection with many more to come, IF YOU SEED THEM.  I do not have infinite bandwidth!!  Look for OTS to link to my other Old Time Serial posts.  Eventually, there will be a bunch.  I have 138 of them.  Some are already seeded (sometimes) and the ones I have will be seeded, possibly on a rotating basis.  If you want it, go ahead and start the download.  It will come around again if it is not out there.\r\n\r\nLyle Talbot is listed as Chick Carter but it seems like he was on vacation for most of the shooting.  He rarely makes an appearance. This made it difficult to follow so, if you care to watch this, watch the first couple of episodes carefully to figure out who the characters are since Lyle (Chick) isn't around much (unlike more detective mysteries).  Odd writing and/or direction.\r\n\r\nThe following lifted from IMDB.  Thanks to the author.\r\n\r\nDetective Chick Carter (Lyle Talbot)finds himself on his most exciting case when Sherry Martin (Julie Gibson), a singer at the Century Club, reports the robbery of the famous Blue Diamond, owned by Joe Carney (Charles King), the owner of the nightclub. Joe planned the theft in order to pay a debt to Nick Pollo (George Meeker)with the $100,000 insurance money he would collect. Sherry double-crossed Joe by wearing an imitation one, while she threw the real one, hidden in a cotton snowball, the Nick during the floor show. But Spud Warner (Eddie Acuff), a newspaper photographer, there with newspaper reporter Rusty Farrell (Douglas Fowley, takes a snowball from her basket and Nick receives an empty one. The Blue Diamond disappears. Aided by a private investigator, Ellen Dale(Pamela Blake), Chick finds himself pitted against the criminals searching for the missing Blue Diamond.\r\n- Written by Les Adams","torrent":{"xt":"urn:btih:b9f82aa07a657d9d693931cb1eb3547433a7e8e4","amp;dn":"Chick+Carter%2C+Detective+%281946%29+Old+Time+Serial+%28OTS%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f82aa07a657d9d693931cb1eb3547433a7e8e4","infoHashBuffer":{"type":"Buffer","data":[185,248,42,160,122,101,125,157,105,57,49,203,30,179,84,116,51,167,232,228]},"announce":[],"urlList":[]}}