{"title":"M. J. Arlidge - Bro bro breja - Svensk","uid":13350857,"size":224386723,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba48389a8c048d36851288eb14933be773504ded&amp;dn=M.+J.+Arlidge+-+Bro+bro+breja+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"totomas1","files":122,"time":1454086902,"description":"M. J. Arlidge - Bro bro breja\r\n\r\nEn död man som levt ett till synes skötsamt liv hittas i ett övergivet hus. Någon har skurit ut hans hjärta och lämnat det utanför familjens ytterdörr. Det är det första offret. Och kriminalkommissarie Helen Grace anar att det inte är det sista.\r\n\r\nI Southamptons slumkvarter frodas prostitution och droghandel. Varför har en lyckligt gift man rört sig i det området?\r\nNär ännu ett liknande fall dyker upp är det tydligt att det går en seriemördare lös. Ett tredje offer hittas. Vilken är den gemensamma nämnaren? Kan mördaren spåras vid den chattsida där ett antal män diskuterar och betygsätter prostituerade?\r\n\r\nHelen Grace har inte bara en krävande mordutredning på sitt bord. Hon försöker också återhämta sig efter systerns död samtidigt som hon måste navigera mellan blindskären på polisstationen, där inte alla vill ha henne kvar. Helen kan känna vreden bakom morden, men hon kan inte föreställa sig hur skickligt mördaren går tillväga, eller vad som väntar henne i slutet av jakten...\r\n\r\nM.J. Arlidge bor i England och har de senaste femton åren arbetat med tv-produktioner. Bro bro breja är Arlidges andra bok i serien om Helen Grace. På Lind &amp; Co utkom hösten 2015 första delen, Ole dole, som sålts till fler än tjugo länder och placerat sig på många topplistor.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Callin Öhrvall Delmar\r\n\r\nAll creds to original ripper","torrent":{"xt":"urn:btih:ba48389a8c048d36851288eb14933be773504ded","amp;dn":"M.+J.+Arlidge+-+Bro+bro+breja+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba48389a8c048d36851288eb14933be773504ded","infoHashBuffer":{"type":"Buffer","data":[186,72,56,154,140,4,141,54,133,18,136,235,20,147,59,231,115,80,77,237]},"announce":[],"urlList":[]}}