{"title":"Discontinuous Finite Elements in Fluid Dynamics and Heat Transfe","uid":15100522,"size":5613465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba4ad3d1b639956f777750f0cbad2d37a1285f1d&amp;dn=Discontinuous+Finite+Elements+in+Fluid+Dynamics+and+Heat+Transfe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1466952934,"description":"Discontinuous Finite Elements in Fluid Dynamics and Heat Transfer - Ben Q. Li (Springer, 2006).pdf\r\n\r\nISBN 978-1-85233-988-3\r\n\r\nOver the past several years, significant advances have been made in developing the discontinuous Galerkin finite element method for applications in fluid flow and heat transfer. Certain unique features of the method have made it attractive as an alternative for other popular methods such as finite volume and finite elements in thermal fluids engineering analyses. This book is written as an introductory textbook on the discontinuous finite element method for senior undergraduate and graduate students in the area of thermal science and fluid dynamics. It also can be used as a reference book for researchers and engineers who intend to use the method for research in computational fluid dynamics and heat transfer. A good portion of this book has been used in a course for computational fluid dynamics and heat transfer for senior undergraduate and first year graduate students. It also has been used by some graduate students for self-study of the basics of discontinuous finite elements. This monograph assumes that readers have a basic understanding of thermodynamics, fluid mechanics and heat transfer and some background in numerical analysis. Knowledge of continuous finite elements is not necessary but will be helpful. The book covers the application of the method for the simulation of both macroscopic and micro/nanoscale fluid flow and heat transfer phenomena","torrent":{"xt":"urn:btih:ba4ad3d1b639956f777750f0cbad2d37a1285f1d","amp;dn":"Discontinuous+Finite+Elements+in+Fluid+Dynamics+and+Heat+Transfe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4ad3d1b639956f777750f0cbad2d37a1285f1d","infoHashBuffer":{"type":"Buffer","data":[186,74,211,209,182,57,149,111,119,119,80,240,203,173,45,55,161,40,95,29]},"announce":[],"urlList":[]}}