{"title":"Canto di Natale di Topolino Film (1983) doppiaggio originale","uid":13175420,"size":1640572530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bca12e404b8c96760b237085b0b332bd3e6583e2&amp;dn=Canto+di+Natale+di+Topolino+Film+%281983%29+doppiaggio+originale&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":1,"time":1452281372,"description":"Canto di Natale di Topolino Film (1983), [BDmux 1080p - H264 - Ita Mp3 Ita Eng Ac3] Doppiaggio originale\r\n\r\nTRAMA\r\n\r\nNella vigilia di Natale del 1843, mentre tutta l'Inghilterra vittoriana è nello spirito allegro del Natale, Ebenezer Scrooge (Paperon de' Paperoni) pensa solo al denaro che ha guadagnato e a farne di più (a quanto pare, fa pagare alle persone l'80% di interesse, composto giornalmente). Mentre i pensieri egoisti di Scrooge frullano nella sua testa, Bob Cratchit (Topolino), esausto e sottopagato (la miseria di due scellini e mezzo penny al giorno), continua a lavorare a lungo e duramente per lui. Cratchit chiede a malincuore una &quot;mezza giornata&quot; libera per il Natale, per la quale Scrooge gli risponde che non verrà pagato. Fred (Paperino), l'allegro nipote di Scrooge, invita l'irascibile zio alla cena di Natale - tacchino ripieno di castagne, dolce di frutta con salsa di limone, frutta candita e dolcetti allo zenzero. Scrooge rifiuta, affermando di non poter mangiare quella roba. Quando i collettori Topus e Talpino, insieme ai mendicanti delle strade, gli chiedono gentilmente una semplice donazione, Scrooge risponde ai due che, se lo fa, i poveri non saranno più poveri, e così loro (i collettori) resteranno senza lavoro. Conclude dicendo &quot;non chiedetemi di farvi perdere il lavoro, non alla vigilia di Natale&quot;.\r\nPiù tardi, Scrooge viene visitato dal fantasma di Jacob Marley (Pippo), l'avido socio di Scrooge morto sette anni prima. A causa della sua crudeltà nella vita, egli è destinato a portare delle pesanti catene per l'eternità. Avverte Scrooge che un destino simile accadrà a lui a meno che non cambi, e che sarà visitato da tre spiriti. Poi Marley se ne va, cadendo giù per le scale dopo aver evitato di inciampare nuovamente sul bastone di Scrooge. Il primo spirito, lo Spirito del Natale Passato (Grillo Parlante), mostra a Scrooge il suo passato. La sua ossessione per il denaro lo aveva portato a spezzare il cuore della sua fidanzata Isabelle (Paperina), precludendole l'ipoteca sul cottage per la luna di miele.\r\nIl secondo spirito, lo Spirito del Natale Presente (Willie il gigante), arriva e mostra a Scrooge la povera famiglia dei Cratchit, che conservano ancora un atteggiamento di festa nella loro casa nonostante le loro difficoltà. Il giovane figlio di Bob, il piccolo Tim, si rivela essere malato, e Willie predice una tragedia se la vita sventurata della famiglia non cambierà. Tuttavia, proprio quando Scrooge è disperato di conoscere il destino di Tim, lo Spirito del Natale Presente e la casa scompare. Il terzo e ultimo spirito, lo Spirito del Natale Futuro (una figura incappucciata che si rivela essere Gambadilegno), porta Scrooge nel futuro in un cimitero. Quando vede Bob in lutto per la morte del piccolo Tim, Scrooge è sconvolto e chiede se questo futuro può essere cambiato.\r\nDue becchini (donnole da Le avventure di Ichabod e Mr. Toad) sono divertiti dal fatto che nessuno abbia partecipato al funerale di Scrooge mentre scavano la sua tomba. Dopo che le donnole se ne sono andate per una pausa, il fantasma rivela la tomba di Scrooge accendendo un fiammifero. Il fantasma lo spinge nella sua tomba chiamandolo &quot;l'uomo più ricco di tutto il cimitero&quot;. Nonostante giuri di cambiare, Scrooge cade in una bara vuota che si spalanca verso l'inferno.\r\nTuttavia, Scrooge si risveglia improvvisamente il giorno di Natale. Essendogli stata data un'altra possibilità, si mette la giacca sopra la camicia da notte, prende il suo bastone e il cappello a cilindro, e va a visitare i Cratchit, donando allegramente una generosa quantità di denaro lungo la strada (di cui 100 sovrane d'oro a Topus e Talpino, i collettori di beneficenza del giorno prima) e dicendo a Fred che verrà alla cena. Poi cerca di giocare uno scherzo a Bob, trascinando in casa un grosso sacco presumibilmente pieno di biancheria e annunciando burbero che ci saranno degli straordinari in futuro. Ma per la gioia dei Cratchit, il sacco è invece pieno di giocattoli e di un grande tacchino per la cena. Scrooge dà a Bob un aumento e lo fa suo socio nel suo ufficio contabile, e il piccolo Tim proclama &quot;Dio ci benedica, tutti quanti!&quot;. \r\n\r\nRELEASE ORIGINAL FOR MORE INFO","torrent":{"xt":"urn:btih:bca12e404b8c96760b237085b0b332bd3e6583e2","amp;dn":"Canto+di+Natale+di+Topolino+Film+%281983%29+doppiaggio+originale","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca12e404b8c96760b237085b0b332bd3e6583e2","infoHashBuffer":{"type":"Buffer","data":[188,161,46,64,75,140,150,118,11,35,112,133,176,179,50,189,62,101,131,226]},"announce":[],"urlList":[]}}