{"title":"Structural Health Monitoring (SHM) in Aerospace Structures","uid":14708246,"size":19161948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bca68765a28095f700b97d1197c784461650589a&amp;dn=Structural+Health+Monitoring+%28SHM%29+in+Aerospace+Structures&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1464387788,"description":"Structural Health Monitoring (SHM) in Aerospace Structures - Fuh-Gwo Yuan (WP, 2016).pdf\r\n\r\nISBN 978-0-08-100148-6\r\n\r\nStructural Health Monitoring (SHM) in Aerospace Structures provides readers with the spectacular progress that has taken place over the last twenty years with respect to the area of Structural Health Monitoring (SHM). The widespread adoption of SHM could both significantly improve safety and reduce maintenance and repair expenses that are estimated to be about a quarter of an aircraft fleet’s operating costs.\r\n\r\nThe SHM field encompasses transdisciplinary areas, including smart materials, sensors and actuators, damage diagnosis and prognosis, signal and image processing algorithms, wireless intelligent sensing, data fusion, and energy harvesting. This book focuses on how SHM techniques are applied to aircraft structures with particular emphasis on composite materials, and is divided into four main parts.\r\n\r\nPart One provides an overview of SHM technologies for damage detection, diagnosis, and prognosis in aerospace structures. Part Two moves on to analyze smart materials for SHM in aerospace structures, such as piezoelectric materials, optical fibers, and flexoelectricity. In addition, this also includes two vibration-based energy harvesting techniques for powering wireless sensors based on piezoelectric electromechanical coupling and diamagnetic levitation. Part Three explores innovative SHM technologies for damage diagnosis in aerospace structures. Chapters within this section include sparse array imaging techniques and phase array techniques for damage detection. The final section of the volume details innovative SHM technologies for damage prognosis in aerospace structures.\r\n\r\nThis book serves as a key reference for researchers working within this industry, academic, and government research agencies developing new systems for the SHM of aerospace structures and materials scientists.\r\n\r\n\r\nProvides key information on the potential of SHM in reducing maintenance and repair costs\r\nAnalyzes current SHM technologies and sensing systems, highlighting the innovation in each area\r\nEncompasses chapters on smart materials such as electroactive polymers and optical fibers","torrent":{"xt":"urn:btih:bca68765a28095f700b97d1197c784461650589a","amp;dn":"Structural+Health+Monitoring+%28SHM%29+in+Aerospace+Structures","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca68765a28095f700b97d1197c784461650589a","infoHashBuffer":{"type":"Buffer","data":[188,166,135,101,162,128,149,247,0,185,125,17,151,199,132,70,22,80,88,154]},"announce":[],"urlList":[]}}