{"title":"Assassin's Creed Chronicles India.2016.ENG.Complete Collection C","uid":13154867,"size":10082892735,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bcff2d8188da3b1d92c8e91233d8b57dbc44c9ba&amp;dn=Assassin%27s+Creed+Chronicles+India.2016.ENG.Complete+Collection+C&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pomixx7","files":28,"time":1452091191,"description":"Assassin’s Creed Chronicles: India is the second spin-off in the action-adventure game series whose main plot revolves around the conflict between Assassins and Templars. As always, the title employs a distinctive historical background; this time players visit the Indus Valley. Unlike most Assassin’s Creed games, this is a 2.5D platformer. PC / Windows version was developed by Ubisoft Montreal.\r\nStory\r\nThe game starts off in 1841 – when the strong at that time Sikh Empire is slowly getting pushed into defensive. The British long have been sharpening their teeth for the Empire’s territories, and after a series of assassination attempts aimed at members of the ruling dynasty it has became obvious that a conflict is about to erupt. On top of that, Assassins and Templars get involved in this already tense political situation. Playing as Arbaaz Mir – a young member of the Assassin Order – you have to struggle against the adverse circumstances and tend to the Order’s interests at the same time.\r\nGameplay\r\nIn terms of gameplay, Assassin’s Creed Chronicles: India for PC / Windows does not stray much from what we've seen in core Assassin’s Creed games. You get to perform amazing acrobatics, sneak past, elude or fight guards, and assassinate selected targets – all this conceptually sounds much like the original games, but the change of perspective means that each of these activities requires quite a different approach. It takes a bit different skills, but also better perception and more careful planning of your each step.\r\nTechnology\r\nMoving the game into 2.5D perspective, aside from affecting the gameplay, allowed for more interesting and detailed level designs to be implemented. Fewer objects to generate and a flat perspective mean the in-game city could be made more detailed, making it even easier to get the feel of the period. Developers not only captured the distinctive atmosphere in the city streets, but also took care of characteristic appearance of the people, as well as recreated the most iconic pieces of Indian architecture, such as the Taj Mahal","torrent":{"xt":"urn:btih:bcff2d8188da3b1d92c8e91233d8b57dbc44c9ba","amp;dn":"Assassin%27s+Creed+Chronicles+India.2016.ENG.Complete+Collection+C","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcff2d8188da3b1d92c8e91233d8b57dbc44c9ba","infoHashBuffer":{"type":"Buffer","data":[188,255,45,129,136,218,59,29,146,200,233,18,51,216,181,125,188,68,201,186]},"announce":[],"urlList":[]}}