{"title":"Gotham S01 FANEDIT Bruce Selina Ivy Complete 1080p 6ch x265 v2","uid":13174525,"size":2107615205,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bdd82dba4afdb080271010793b7db42679b98844&amp;dn=Gotham+S01+FANEDIT+Bruce+Selina+Ivy+Complete+1080p+6ch+x265+v2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bsg4you","files":5,"time":1452273736,"description":"Gotham.S01.FANEDIT.Bruce.Selina.Ivy.Complete.1080p.6ch.x265.HEVC.v2\r\n\r\nGotham.S01E13-E22.FANEDIT.Bruce.Selina.Ivy.Complete-Part2.1080p.6ch.x265.HEVC.v2.mkv\r\nGotham.S01E01-E12.FANEDIT.Bruce.Selina.Ivy.Complete-Part1.1080p.6ch.x265.HEVC.v2.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nTHIS IS A FANEDIT OF GOTHAM SEASON 1 SCENES WITH THE YOUNG ACTORS\r\nINCLUDING BRUCE WAYNE, SELINA KYLE, AND IVY PEPPER\r\n\r\nV2 HAS BETTER VIDEO QUALITY WITH CRF=23 THAN THE ORIGINAL TWO-PASS 1500Kbps\r\nNOTE: the Handbrake settings and final average video bitrates were:\r\nv1 two-pass 1500Kbps &gt;&gt; final p1-1497 p2-1463\r\nv2 crf=23 &gt;&gt; final p1-1433 p2-1221\r\nDespite the average video bitrates being 4% and 17% lower than the two-pass, the constant quality crf=23 looked *much* better. And some notably bad parts in the two-pass (just a few frames at a time usually) were gone with the crf=23 encode. While the bitrate is variable with two-pass, it's much more variable with crf which is probably why the hardest parts to encode look good with crf. Constant quality settings from 22 to 28 were tested, many for the whole fanedit, and the the best quality/size result was crf=23.\r\n\r\nGotham (2014) Season 1 FANEDIT Bruce Wayne - Selina Kyle - Ivy Pepper\r\nvideo: 1920x1080 HEVC crf=23 preset=medium\r\naudio: 6-channel surround sound HE-AAC 256Kbps\r\npart1: S01E01-E12 1h 36m 59s with 33 named chapters (video ~1433Kbps)\r\npart2: S01E13-E22 1h 18m 57s with 32 named chapters (video ~1221Kbps)\r\n\r\n* Are you a big fan of these characters and their actors?\r\nBruce Wayne aka Batman (David Mazouz)\r\nSelina Kyle aka Catwoman (Camren Bicondova)\r\nIvy Pepper aka Poison Ivy (Clare Foley)\r\n* Do you really like Gotham and you'd like to see a recut of the first season material with the young actors?\r\n* Do you love Gotham and want to watch any FANEDIT about it?\r\n\r\nIf you said yes to any of the questions above, you might like this FANEDIT that includes all the scenes of the young actors from season 1 in order. The material was broken into 2 parts with Part1 ending with Selina and Ivy squatting in Barbara's apartment and Part2 starting with Bruce looking for Selina. This is a nice break point since Bruce went out of town for a few weeks at this time and it marks the middle of the season.\r\n\r\nMost clips are complete except for extra intra-clip editing during the mob meltdown in episode 22 since long stretches had nothing to do with Selina. But the compacted edit of the showdown came out real nice. Plus, there's one clip of Jim Gordon calling Alfred that doesn't have a young actor in it but all they talked about was Selina and Bruce.\r\n\r\nPlease check out other releases of Gotham, MST3K, Rifftrax, Battlestar Galactica, DC Comics, documentaries, Star Trek Enterprise and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you\r\n\r\nPS - here's a list of the named chapters for both parts to give an idea of what's included:\r\nPART1\r\nCh01 e01 Bruce's Parents Are Killed As Selina Watches\r\nCh02 e01 &quot;However Dark And Scary The World Might Be Right Now There Will Be Light&quot;\r\nCh03 e01 The Pepper Family\r\nCh04 e01 The Wayne Funeral And Back To Ivy's\r\nCh05 e01 Gordon's Promise To Bruce\r\nCh06 e02 Confronting Pain\r\nCh07 e02 Selina Dodges The Snatchers Only To Be Captured By Juvi\r\nCh08 e02 Jane &quot;Cat&quot; Doe Escapes The Bus And Flexes Her Claws\r\nCh09 e02 Gordon Talks To Bruce About Talking\r\nCh10 e02 &quot;Go Get Him Or I'll Say You Touched Me&quot;\r\nCh11 e03 Selina Shows Gordon The Murder Scene\r\nCh12 e03 &quot;What So You're A Detective Now Are You?&quot;\r\nCh13 e04 The Arkham Plan\r\nCh14 e05 How Gotham Works\r\nCh15 e05 Selina At Work\r\nCh16 e05 Wayne Enterprises Charitable Luncheon\r\nCh17 e06 Research Continues\r\nCh18 e06 Selina Steals The Silver Box As Bruce Sleeps\r\nCh19 e07 Gordon Prepares Bruce For The Worst\r\nCh20 e08 Bruce Goes To School\r\nCh21 e08 &quot;Girl's Gotta Shop&quot;\r\nCh22 e08 Bruce Teaches Tommy A Timely Lesson\r\nCh23 e08 Selina Reunites With Gordon\r\nCh24 e08 &quot;Can You Teach Me How To Fight?&quot;\r\nCh25 e09 Selina And Gordon Visit Barbara's Apartment\r\nCh26 e09 Bruce And Selina At Wayne Manor\r\nCh27 e10 Selina And Bruce Run Away From Assassins\r\nCh28 e10 &quot;My World My Rules, You Do What I Say&quot;\r\nCh29 e10 The Flea With Ivy Pepper\r\nCh30 e10 Clyde The Fence Double Cross\r\nCh31 e10 The Kiss\r\nCh32 e11 Selina And Ivy Squat At Barbara's Apartment\r\nCh33 End Part 1 Of 2\r\nPART2\r\nCh01 e13 Looking For Selina, Finding Ivy\r\nCh02 e13 Selina Comes To Bruce, He Blows It\r\nCh03 e14 Selina Escapes Gordon (Again)\r\nCh04 e14 Bruce Releases Gordon From His Promise\r\nCh05 e15 The Wayne Father Son Hike\r\nCh06 e15 Bruce And Alfred At Sunrise\r\nCh07 e16 Crashing At The Manor And Barbara's Apartment\r\nCh08 e16 Preparing For The Board Meeting\r\nCh09 e16 Dressing Up To Win Jim Back\r\nCh10 e16 Throwing Down The Gauntlet At The Board Meeting\r\nCh11 e17 A Visitor From The Past Arrives At The Manor\r\nCh12 e17 &quot;Your Appearance Can Be A Weapon&quot;\r\nCh13 e17 Reggie And Alfred: Old Times\r\nCh14 e17 Reggie And Alfred: Aftermath\r\nCh15 e18 Alfred At The Hospital\r\nCh16 e18 Selina Supports Bruce\r\nCh17 e19 Alfred's Secret Mission\r\nCh18 e19 Looking For Reggie, Finding Selina\r\nCh19 e19 Bruce And Selina Confront Reggie\r\nCh20 e20 &quot;What Happened Tonight, You Tell No One&quot;\r\nCh21 e20 Bruce Tells Alfred About Going To The Ball\r\nCh22 e20 &quot;Selina, You Look Very Nice&quot;\r\nCh23 e20 The Wayne Enterprises Charity Ball\r\nCh24 e20 Gordon Looks For Barbara, Finds Selina\r\nCh25 e21 Sid Bunderslaw's Safe\r\nCh26 e21 Bruce Gives Up Selina To Alfred\r\nCh27 e22 Selina Meets A Returning Fish Mooney\r\nCh28 e22 Wayne Secrets\r\nCh29 e22 Selina Then Fish Review The Prisoners\r\nCh30 e22 Mob Meltdown\r\nCh31 e22 &quot;Don't You Dare Press That Bloody Button&quot;\r\nCh32 End Part 2 Of 2","torrent":{"xt":"urn:btih:bdd82dba4afdb080271010793b7db42679b98844","amp;dn":"Gotham+S01+FANEDIT+Bruce+Selina+Ivy+Complete+1080p+6ch+x265+v2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd82dba4afdb080271010793b7db42679b98844","infoHashBuffer":{"type":"Buffer","data":[189,216,45,186,74,253,176,128,39,16,16,121,59,125,180,38,121,185,136,68]},"announce":[],"urlList":[]}}