{"title":"Star Wars: Episode II - The Republic Divided (L8wrtr Fanedit)","uid":13149755,"size":21935365584,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:be54472e6d1ef4b7912b5e83e1d27b172f9a8d61&amp;dn=Star+Wars%3A+Episode+II+-+The+Republic+Divided+%28L8wrtr+Fanedit%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BmanInBed","files":90,"time":1452043343,"description":"Star Wars: Episode II - The Republic Divided (2011)\r\n\r\nFaneditor Name: L8wrtr\r\nTagline: You cannot escape your destiny\r\nOriginal Movie Title: Star Wars: Episode II - Attack of the Clones\r\nGenre: Science Fiction\r\nFranchise: Star Wars\r\nFanedit Type: FanFix\r\nOriginal Release Date: 2002\r\nOriginal Running Time: 142\r\nFanedit Release Date: June 2011\r\nFanedit Running Time: 96\r\nTime Cut: 49\r\n\r\nFanedit Information\r\n\r\nBrief Synopsis:\r\nThe Republic Divided continues the approach that L8wrtr established in his first edit, Shadow of the Sith. This fanedit radically improves the relationships between the key players of the Prequel, creating believable friendships and more importantly a love story which is no longer creepy and forced. The action sequences are drastically altered to improve pacing and keep the focus on story. This chapter is key in recreating a\r\n\r\nIntention:\r\nAttack of the Clones is a frustrating film. It looks and feels like a Star Wars film, but there are so many moments that just take me out of the film that I find it hard to watch. Whether it’s Mel’s Couuscant Diner, Obi-Wan’s feeble intellect, Anakin’s explosive whining, or the dumbfounding Droid Factory sequence, anything that is done well in this film is negated by a wave of inexplicable story-telling choices.\r\n\r\nAs with Shadow of the Sith my goal with The Republic Divided is to trim out the inexplicable story elements, improve the quality of the characters by relieving them of annoying and/or frustration dialog, and in general, improving the tone and pace of the film. When all of this clutter is removed, a respectable movie emerges, with Palpatine quietly setting all the pieces for his master-stroke which unfolds in Episode III.\r\n\r\nSpecial Thanks:\r\nBobGarcia rescued me by providing a short but critical special effect shot to allow the fix of Yoda and Dooku’s confrontation, a HUGE thank you Bob.\r\n\r\nAlso, Dwight Fry, Hebrides, Elbarto1, BionicBob and TV’s Frink provided invaluable feedback on the original release. THANK YOU.\r\n\r\nEveryone in the community who chimed in on the thread, thank you and I hope you enjoy the final product.\r\n\r\nLastly, thank you George. That I take the time to modify these films speaks to how deeply the Star Wars universe affected me growing up.\r\n\r\nSpecial thanks to Rogue-theX for his amazing cover, to Q2 for his assistance with HD editing, and NJVC for the sweet menus and hard work in making the HD remastered releases so slick.\r\n\r\nRelease Information\r\n* NTSC DVD-5\r\n* NTSC DVD-9\r\n* AVCHD (DVD-9)\r\n* Blu-Ray (BD-25)\r\n\r\nSpecial Features\r\n* 5.1 Audio (All Release Formats)\r\n* Audio Commentary (All Release Formats)\r\n* About this fanedit vignette (BD and Dual Layer DVD)\r\n* Deleted Scenes (BD and Dual Layer DVD)\r\n* Trailers (BD and Dual Layer DVD)\r\n \nhttp://fanedit.org/ifdb/component/content/article/79-fanedit-database/fanfix/82-trd","torrent":{"xt":"urn:btih:be54472e6d1ef4b7912b5e83e1d27b172f9a8d61","amp;dn":"Star+Wars%3A+Episode+II+-+The+Republic+Divided+%28L8wrtr+Fanedit%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be54472e6d1ef4b7912b5e83e1d27b172f9a8d61","infoHashBuffer":{"type":"Buffer","data":[190,84,71,46,109,30,244,183,145,43,94,131,225,210,123,23,47,154,141,97]},"announce":[],"urlList":[]}}