{"title":"Templar Battleforce RPG v1.2.15 APK","uid":13091289,"size":55411958,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c1389dfbd6c77570495e91684085911057143815&amp;dn=Templar+Battleforce+RPG+v1.2.15+APK&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1451046387,"description":"Templar Battleforce RPG v1.2.15 APK\r\n\r\nStep into a Leviathan mech and lead the Templar Knights in battle against fierce Xenos. Create your own unique Battleforce by recruiting an array of Templar specialists -- and invent distinct strategies for your fireteams. Deploy your forces in tactical scenarios that challenge both novice and veteran alike. Put your best strategies to the test and see if you can snatch victory from the jaws of defeat in this futuristic turn-based wargame.\r\n\r\nArmored in the Leviathan battle mechs, your mighty Templars will face hordes of terrifying Xenos, rogue human factions, and the ancient Narvidian threat. Slash and blast your way across a deep and deadly sci-fi universe -- waging war with cunning Scouts, righteous Soldiers, flamethrowing Hydras, specialized Engineers, deadly Sentry Turrets, and the indomitable Berserks.\r\n\r\nFeatures:\r\n\r\n* Command your Templars in turn-based tactical warfare across 45+ unique scenarios \r\n* Face diverse challenges in every deployment: corridor-to-corridor, open desert warfare, \r\n* Territory control (capturing tactical points), defensive last stands, scorched-earth retreats, \r\n* Infiltration deep behind enemy lines, and complex puzzles \r\n* Lead your squad in battle against immense and mighty bosses\r\n* Immerse yourself in a branching sci-fi storyline \r\n* Deploy specialist Templars and discover unique fireteam combinations with stealth, grenades, \r\n* Defensive overwatch, scorching flamethrowers, hindering attacks, and sentry turrets \r\n* Face 25+ diverse enemy units: the Xeno, the Narvidians, and rogue human factions \r\n* Build your unique battleforce with exacting precision, recruit and design every squad member \r\n* Customize the appearance, armor design, talents, and equipment of your veteran Templars\r\n* Endless combinations of squads, soldiery, and tactics will keep you coming back for more!\r\n\r\nBACKSTORY\r\n\r\nThe Templar Knights are a revered and storied martial order who were the elite forces for the Star Traders during their most challenging conflict: the Galactic War against the Guild.\r\n\r\nTheir unchallenged prowess derives from two key factors.\r\n\r\nFirst, they pilot 10 foot tall battle mechs known as Leviathan Battle Suits. Once designed for high-pressure environments and exploring gas giants and deep space, these mechs have been adapted for war.\r\n\r\nSecond, Templars descend from a Zendu bloodline -- a unique heritage that, with proper training and ritual, gives each Templar the ability to pass all of their memories, and those of their ancestors, to a newly born child. This memory gift is known as a Templar’s Lineage – and it is what gives Templars their immense advantage in combat, tactics, engineering, and the ability to drive the hulking Leviathan Battle Suits. The player takes on the role of a Templar Captain who hails from a storied Lineage reaching back over 87 generations of Templars -- enabling you to page back through the memories to help in coping with the dire situation at hand.\r\n\r\nWith the Great Exodus coming to an end, the Star Traders founded new colonies on the few remaining habitable worlds. The Templar Knights are called upon once again to defend the Star Traders and their new colonies from an ancient threat.[/color]\r\n\r\nWhat's in this version : (Updated : Dec 17, 2015)\r\n•\tImproved Performance\r\n•\tFixed Reported Crashes\r\n•\tFixed issues recording last-turn kills, last-turn secondary objectives\r\n•\tDisplay Talent Restriction Icons in Talent List\r\n•\tFixed Reported Issues\r\n•\tAdded 2 New character portraits to Templar Designer\r\n•\tBerserk Self-Buff Uncapped Fury gains small healing effect\r\n•\tBerserk Unbalancing Blows becomes AoE after level 3\r\n•\tAdded 2 New Berserk Axes (GL 5 and 9)\r\n•\tImproved speed of leveling Talents - less clicks, double-click enabled\r\n•\tLast viewed Requisition node stays highlighted\r\n•\tAdded color codes to the Requisition Tree\r\n\r\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:c1389dfbd6c77570495e91684085911057143815","amp;dn":"Templar+Battleforce+RPG+v1.2.15+APK","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1389dfbd6c77570495e91684085911057143815","infoHashBuffer":{"type":"Buffer","data":[193,56,157,251,214,199,117,112,73,94,145,104,64,133,145,16,87,20,56,21]},"announce":[],"urlList":[]}}