{"title":"Winterwatch-Ww.Unsprung-2016-BBC-w.subs-720p","uid":13366554,"size":5229164203,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c469dcc154ddaba4bbd4ac1dc984d072eded06f0&amp;dn=Winterwatch-Ww.Unsprung-2016-BBC-w.subs-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":11,"time":1454173577,"description":"\nWinterwatch &amp; Winterwatch Unsprung\r\n\r\nJanuary 2016\r\n\r\nBBC - 4 + 3 episodes\r\n\r\nSpringwatch, Autumnwatch and Winterwatch are annual BBC television series which chart the fortunes of British wildlife during the changing of the seasons in the United Kingdom. The programmes are broadcast live from locations around the country.\r\n \nhttp://www.bbc.co.uk/programmes/p012msk2 \nhttp://www.bbc.co.uk/programmes/b01q1pn9\r\n_______________________________________\r\n\r\n1280x720 resolution for Winterwatch - with subtitles\r\n832x468 resolution for Winterwatch Unsprung\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nEnjoy !!\r\n_______________________________________\r\n\r\nIn the order they were broadcast:\r\n\r\nWinterwatch, Series 4 Episode 1 of 4\r\nWinterwatch returns in the middle of one of the most extraordinary winters in living memory. So far this is the warmest and wettest winter on record - but what effect has this had on our wildlife?\r\nChris Packham, Michaela Strachan and Martin Hughes-Games are back live from the Scottish highlands with spectacular winter wildlife stories from around the country.\r\n\r\nWinterwatch, Series 4 Episode 2 of 4\r\nChris Packham, Martin Hughes-Games and Michaela Strachan are live from the Highlands of Scotland with the latest updates on how our wildlife is coping with this extraordinary winter. They are on the trail of the Scottish tiger.\r\nMartin attempts to spend the night on one of the UK's highest mountain ranges to see how animals are being affected in one of the harshest environments.\r\n\r\nWinterwatch Unsprung, 2016 Episode 1 of 3\r\nChris Packham returns to the Scottish Highlands. Joined by a studio audience Chris shares viewers' wildlife videos, pictures and comments from across the country. Chris is joined by social media reporter Lindsey Chapman, who has views and comments from the Unsprung audience.\r\n\r\nWinterwatch, Series 4 Episode 3 of 4\r\nMartin Hughes-Games and Michaela Strachan are live from the Highlands of Scotland with the latest updates on how our wildlife is coping with this extraordinary winter.\r\nWe find out how Martin got on during his night on the mountainside, while Iolo Williams is on the trail of water deer, an animal that looks like a sabre-tooth teddy bear and is being affected by our sensational weather.\r\n\r\nWinterwatch Unsprung, 2016 Episode 2 of 3\r\nAn extra portion of winter wildlife, featuring chat with wildlife experts and enthusiasts from the studio in the Cairngorms. Social media reporter Lindsey Chapman shares viewers' stories and photographs of this year's winter wildlife moments.\r\n\r\nWinterwatch, Series 4 Episode 4 of 4\r\nIn their last live report from the Highlands of Scotland, presenters Chris Packham, Michaela Strachan and Martin Hughes-Games reveal some of this winter's most unusual spectacles. Including reports on wildcats, golden eagles and the UK's most unusual deer.\r\n\r\nWinterwatch Unsprung, 2016 Episode 3 of 3\r\nChris Packham invites viewers to join him for another Winterwatch Unsprung - an evening of chat, humour and news, live from the Cairngorms. Chris challenges guests to share their wildlife stories and passions whilst Lindsey Chapman has all the wildlife news across the country from viewers with their own stories and pictures of the season","torrent":{"xt":"urn:btih:c469dcc154ddaba4bbd4ac1dc984d072eded06f0","amp;dn":"Winterwatch-Ww.Unsprung-2016-BBC-w.subs-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c469dcc154ddaba4bbd4ac1dc984d072eded06f0","infoHashBuffer":{"type":"Buffer","data":[196,105,220,193,84,221,171,164,187,212,172,29,201,132,208,114,237,237,6,240]},"announce":[],"urlList":[]}}