{"title":"Empire TV Tycoon version 1.2.0 [64 bit only] repack Mr DJ","uid":13077966,"size":51635037,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5af1764a67a805d76da01cdc272e1f61d77e510&amp;dn=Empire+TV+Tycoon+version+1.2.0+%5B64+bit+only%5D+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rock840","files":2,"time":1450871254,"description":"Title: Empire TV Tycoon v1.2.0\r\n Genre: Casual, Indie, Simulation, Strategy\r\n Developer: Dreamsite Games\r\n Publisher: Dreamsite Games \r\n Release Date: 20 Oct, 2015\r\n\r\n Languages : English and Espanol ;\r\n\r\n About This Game\r\n\r\n Empire TV Tycoon is a game for PC, Mac, and Linux in which you manage a TV channel and fight for audiences taking decisions that will project your channel to fame and fortune.You will decide the content of your channel, select advertisers, hire workers, make your own productions, hire actors, and engage in much more activities! It's inspired by games such as Mad TV, Mud TV, and other movie management games, with a modern approach on how to produce custom content such as movies or tv-shows.\r\n\r\n Empire TV is a big corporation having serious losses, and It can't afford to maintain three channels, but only one, any longer. You have been hired to lead one of the channels to achieve fame and be the one that remains.\r\n\r\n Cut Microsoft Redistributables files like dotnet and XNA , if u need it , geab them from my previous release which u already have\r\n\r\n System Requirements\r\n\r\n Minimum:\r\n OS: Windows XP\r\n Memory: 1024 MB RAM\r\n DirectX: Version 9.0\r\n Hard Drive: 200 MB available space \r\n\r\n Note: 64 bit windows supported only \r\n\r\n The Empire TV Tycoon 1.2.0 patch includes a new feature for the game, custom mode, among other minor improvements and bug fixes. \r\n\r\n The game is now fully translated to German thanks to Scocher24 and Kadele, with their MASSIVE HELP and work translating the different texts, movies, etc. This is the first of the planned translations, but not the only one, more translations will come. \r\n\r\n Custom mode \r\n One of our priorities with Empire TV Tycoon development has always been replayability. We want to give you the chance to experience different kind of games each time you play and with this patch we want to introduce you the Custom mode. \r\n\r\n With custom mode you now can fully customize lots of options for your game, some of them are: defining winning conditions like fame, audience or endless play, removing audience groups you don't like, change the number of audience bans you want for the game, defining various monetary options and the most important: you can randomize the likes of every audience group making every game feel like a fresh start as you discover what they like or dislike. \r\n\r\n Bugs fixes: \r\n - fixed a bug that displayed incorrect episode numbers on the management screen when the tv shows were larger than 1 block \r\n - fixed some tv shows which had an incorrect number of episodes \r\n - different minor bugs fixed \r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\n Open Empire TV Tycoon v 1.2.0.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\n Extarct it yourself using 'WinRAR'\r\n\r\n Open the game from 'EmpireTV.exe'\r\n\r\n Always open the game using run as administrator\r\n\r\nCheck out my Official page:\r\nMr DJ repacks","torrent":{"xt":"urn:btih:c5af1764a67a805d76da01cdc272e1f61d77e510","amp;dn":"Empire+TV+Tycoon+version+1.2.0+%5B64+bit+only%5D+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5af1764a67a805d76da01cdc272e1f61d77e510","infoHashBuffer":{"type":"Buffer","data":[197,175,23,100,166,122,128,93,118,218,1,205,194,114,225,246,29,119,229,16]},"announce":[],"urlList":[]}}