{"title":"The Great Christmas Light Fight S03E05-E06 FINALE HDTV.x264-NY2","uid":13077186,"size":1017283637,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c890194d9a95dbea560a53d6c7669c269c628fe0&amp;dn=The+Great+Christmas+Light+Fight+S03E05-E06+FINALE+HDTV.x264-NY2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TlanImass","files":1,"time":1450863511,"description":"The Great Christmas Light Fight - Season 3, Episode 5\r\n\r\nThe Great Christmas Light Fight festivities continue with four festive families from across the country showcasing their spectacular displays of Christmas magic, including the Nelson family's specially converted RGB &quot;star flakes,&quot; hand-built plasma icicles and thousands of lights that illuminate the sky in Elk Grove, CA; the Mish family's giant 15×15 Seahawks logo and innovative interior water and ice features in Kirkland, WA; the Hoag family's 30-foot platform of shooting stars and snowflakes and homemade carousel and Ferris wheel in Strongsville, OH; and the Finney family's star and angel, 50 feet in the air, four eight-foot Bibles, a 14-foot merry-go-round, two snow globes and a 16-foot snow slide in Crossett, AR.\r\n\r\n\r\nThe Great Christmas Light Fight - Season 3, Episode 6\r\n\r\nThe Great Christmas Light Fight festivities conclude with the final episode of the season. Meet the Ziemkowski family, whose handmade animatronics and &quot;Pix-Z-Tree&quot; – a tree that features pixels and handmade craftsmanship – plus thousands of lights and music with synced video in Sherman Oaks, CA; the Koosman family, whose synchronized fire works show set to music and 450,000 LED strobe lights draw thousands of visitors to their home in Willmar, MN; the Sokol family, whose display includes a &quot;Slammin’ Santa&quot; – Santa simulating a power dunk, and a jumping dolphin display with 2 projectors that simulate shimmering water and over 125,000 lights in Orlando, FL; and the Davis family of Longview, TX, whose display features over 1 million lights, a laser show, six dancing mega trees that are 45-feet high, and a handmade pond and river of blue lights.\r\n\r\n\r\nOriginal Air Date: 21-Dec-2015","torrent":{"xt":"urn:btih:c890194d9a95dbea560a53d6c7669c269c628fe0","amp;dn":"The+Great+Christmas+Light+Fight+S03E05-E06+FINALE+HDTV.x264-NY2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c890194d9a95dbea560a53d6c7669c269c628fe0","infoHashBuffer":{"type":"Buffer","data":[200,144,25,77,154,149,219,234,86,10,83,214,199,102,156,38,156,98,143,224]},"announce":[],"urlList":[]}}