{"title":"Rachel's Purposeful Availment technology is killing music","uid":13390268,"size":42884963,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c8b725b51c8a4afd56ecf5a14917a486e4fe69d6&amp;dn=Rachel%27s+Purposeful+Availment+technology+is+killing+music&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cactrot","files":2,"time":1454330067,"description":"1 track: Technology Is Killing Music \r\n\r\nRachel's is an American band formed in Louisville, Kentucky in 1991 by ex-Rodan guitarist Jason Noble. While Rachel's began as primarily a solo project for Noble he quickly began collaborating with now core members violist Christian Frederickson, and pianist Rachel Grimes. The group's work is strongly influenced by classical music, particularly inspired by the minimalist music of the late 20th century, and its composition reflects this. While the trio forms the core part of the band, the group's recordings and performances feature a varying ensemble of musicians, who play a range of string instruments (including viola and cello) in combination with piano, guitars, electric bass guitar, and a drum set that includes a large orchestral bass drum. A key influence on the music of Rachel's is the music of the English composer Michael Nyman, whose music the group's work resembles in both instrumentation and compositional style. They named the group Rachel's after Noble's Toyota Corolla, which has nothing to do with third new member, pianist Rachel Grimes. They debuted in 1995 with Handwriting, an album which mixed both dark classical sounds with film influenced experimental music. Rachel's released four albums after that, with 2003 Systems/Layers being the most recent one. In 2005 they released an EP consisting of a single track, titled Technology is Killing Music. The band is currently on hiatus and does not tour or record new albums. However, they have provided the score for a film by longtime collaborator Greg King, &quot;ROTATING MIRROR&quot;, a 50 minute document of life in NYC, Louisville, and in between. Discography * Handwriting (1995, Quarterstick Records) * Music for Egon Schiele (1996, Quarterstick) * The Sea and the Bells (1996, Quarterstick) * Selenography (1999, Quarterstick) * Full On Night Split Disc with Matmos (2000, Quarterstick) * Systems/Layers (2003, Quarterstick) * Technology is Killing Music EP (2005, Three Lobed Recordings) www.rachelsband.com Read more on Last.fm","torrent":{"xt":"urn:btih:c8b725b51c8a4afd56ecf5a14917a486e4fe69d6","amp;dn":"Rachel%27s+Purposeful+Availment+technology+is+killing+music","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b725b51c8a4afd56ecf5a14917a486e4fe69d6","infoHashBuffer":{"type":"Buffer","data":[200,183,37,181,28,138,74,253,86,236,245,161,73,23,164,134,228,254,105,214]},"announce":[],"urlList":[]}}