{"title":"Hamrick VueScan Pro v9.5.34","uid":13097279,"size":18000204,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ccfe90abba1a9f44a512016b393d049b6ec7d374&amp;dn=Hamrick+VueScan+Pro+v9.5.34&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZarkBit","files":2,"time":1451154891,"description":"Hamrick VueScan Pro v9.5.34\r\n\r\nWhat's new in version 9.5.34\r\n\r\n    Added support for new Brother scanners\r\n        DCP-1600\r\n        DCP-1608\r\n        DCP-1619\r\n        DCP-9015CDW\r\n        DCP-9017CDW\r\n        HL-3180CDW\r\n        MFC-1900\r\n        MFC-1906\r\n        MFC-1908\r\n        MFC-9335CDW \r\n    Fixed problem with some Fujitsu duplex scanners\r\n    Fixed problem with Canon MF-series scanners\r\n    Fixed problem with some Brother A3 document feeders\r\n    Fixed problem with some HP document feeders \r\n\r\n\r\nVueScan Features\r\nCompatible with over 2800 scanners\r\n\r\nVueScan is compatible with over 2800 different scanners on Windows, Mac OS X and Linux. The best way to see if your scanner works is to download VueScan (it only takes 60 seconds) You can also check this list of supported scanners.\r\nWhy buy new when you can upgrade instantly and for less?\r\n\r\nVueScan saves your scanner, saves you money and offers powerful new features you can’t find anywhere else - not even from the manufacturer. Use VueScan to keep your scanner from obsolescence (and from the landfill).\r\nVueScan Mobile for iOS and Android\r\n\r\nIf you have an iPad, iPhone or Android phone or tablet, you can use VueScan Mobile Free for scanning. This is a completely free program that works with the built-in camera and most networked HP, Canon, Epson, Brother and Samsung scanners.\r\nOutputs scans in a variety of formats\r\n\r\nVueScan can output scanned documents, photos, and film in PDF, JPEG and TIFF formats. It can also recognize text using OCR and create multi-page pdfs using both flatbed scanners and scanners with automatic document feeders\r\nGreat for beginner and pro users\r\n\r\nWe built VueScan so that two completely different types of users can use it. Beginners only need to run VueScan and press the 'Scan' button. Pro users can change to either the 'Standard' or 'Professional' options to unlock powerful features to have complete control over their scans.\r\nFlexible licensing\r\n\r\nYou can use VueScan on up to four different computers that you personally use, with any combination of operating systems, with any number of scanners, both x32 and x64, with a single license. Standard Edition has free upgrades for a year, Professional Edition has unlimited free upgrades","torrent":{"xt":"urn:btih:ccfe90abba1a9f44a512016b393d049b6ec7d374","amp;dn":"Hamrick+VueScan+Pro+v9.5.34","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccfe90abba1a9f44a512016b393d049b6ec7d374","infoHashBuffer":{"type":"Buffer","data":[204,254,144,171,186,26,159,68,165,18,1,107,57,61,4,155,110,199,211,116]},"announce":[],"urlList":[]}}