{"title":"The Upperfloor--tUF-40017 Dolly Leigh, Juliette March and Mickey","uid":14708410,"size":3966628404,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cda89aad8ff7741c81180aacac4fc998a5441467&amp;dn=The+Upperfloor--tUF-40017+Dolly+Leigh%2C+Juliette+March+and+Mickey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":2,"time":1464389827,"description":"Virginal Pussy Slave Fucked For First Time on Camera\r\n\r\nMay 27, 2016 - Performers: Mickey Mod ,  Juliette March  and  Dolly Leigh \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nFresh new virginal scream queen Dolly Leigh arrives on The Upper Floor an inexperienced fuck slave dressed in white and leaves a proper sexual service slave dressed in black. When she applied to join our cadre of service sluts we discover she has never serviced cock in the castle before, leaving her training goals clear: get her wet pussy and mouth filled with hard dick before a party of BDSM swingers. \r\n\r\nTo guide her we have the hungriest slut among our senior slaves. Juliette March arrives on the scene ready to fluff Mickey Mod with her bouncy ass and open throat, but she isn't prepared for how wild and untrained her charge is. Dolly squirms and screams every time her sensitive young cunt is stimulated or punished, creating quite the scene. Can Juliette be clever and control Dolly's cries while also keeping the cock hard? The Steward digs in with electro torment, floggers, and a sybian to further push the training. \r\n\r\nBoth slaves have their asses beaten red until Dolly can take her pain and pleasure with composure. Gagged with a dildo harness, her reward is an up close view of Juliette's gorgeous ass as she rides Mickey with her pussy and get her anal warm up on Dolly's pretty face. Seeing how a good service slut takes her anal pounding, Dolly gets tied tightly in a difficult partial rope suspension and begs for cock until Mickey is satisfied and gives Dolly her first boy girl fucking on camera ever. It was well worth the wait, and she cries and almost seems to suffer from the extreme pleasure of being mercilessly fucked and made to cum over and over again. Released from bondage Juliette shows her how to take a fucking like a slave, reverse cowgirl until she is bathed in sweat and exhausted from so many orgasms. She comes in chaste and leaves gorgeously fucked out with her training rights. Well done Dolly.\r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=40017\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:cda89aad8ff7741c81180aacac4fc998a5441467","amp;dn":"The+Upperfloor--tUF-40017+Dolly+Leigh%2C+Juliette+March+and+Mickey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda89aad8ff7741c81180aacac4fc998a5441467","infoHashBuffer":{"type":"Buffer","data":[205,168,154,173,143,247,116,28,129,24,10,172,172,79,201,152,165,68,20,103]},"announce":[],"urlList":[]}}