{"title":"TMS - Giants of Irish Literature - Wilde, Yeats, Joyce, Beckett","uid":14699374,"size":126728607,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ceef562a94bfe02bf88b4a3b7c5734711a9db658&amp;dn=TMS+-+Giants+of+Irish+Literature+-+Wilde%2C+Yeats%2C+Joyce%2C+Beckett&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"heliiaruy","files":144,"time":1464287864,"description":"Written by George O'Brien\r\nRead by George O'Brien\r\nFormat: m4a\r\nUnabridged\r\n\r\nListening Length: 8 hours and 17 minutes\r\n\r\nOscar Wilde, W.B. Yeats, James Joyce, and Samuel Beckett: These four masters of Irish literature created works of startling innovation and unparalleled literary merit. They defied popular expectations and confounded critics with unique masterpieces that one might think of as puzzles, the solution of which lies at the heart of the modern age. Understanding the works of these greats, all associated to some degree with the Irish Literary Revival, is fundamental not only to a richer appreciation of Irish literature, but to a better comprehension of modern literature in all its manifestations, for these authors struggled with the idea of modernity and all it entailed, and the fruits of their struggle stand as monuments to the remarkable capacity of literary imagination.\r\n\r\nRenowned professor George O'Brien of Georgetown University provides the biographical background of these authors and an in-depth analysis of their greatest works. In the course of these lectures, O'Brien discusses the very qualities that set these works apart and the &quot;Irishness&quot; that characterizes each of them.\r\n\r\nThis is a correctly organized and compressed copy of another user's upload. The m4a compression isn't detectable, but is quarter the size. foobar2000, neroaac plugin, and maybe mkvtoolnix and handbrake are great programs, the first two being specifically handy for this task(thanks sup3rman) as it is great for saving space","torrent":{"xt":"urn:btih:ceef562a94bfe02bf88b4a3b7c5734711a9db658","amp;dn":"TMS+-+Giants+of+Irish+Literature+-+Wilde%2C+Yeats%2C+Joyce%2C+Beckett","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceef562a94bfe02bf88b4a3b7c5734711a9db658","infoHashBuffer":{"type":"Buffer","data":[206,239,86,42,148,191,224,43,248,139,74,59,124,87,52,113,26,157,182,88]},"announce":[],"urlList":[]}}