{"title":"Star Trek:Voyager The complete DVD collection","uid":13075198,"size":385915315302,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cfa800b04e4b54e9dd8acbe8f8d2be1b606e7e42&amp;dn=Star+Trek%3AVoyager+The+complete+DVD+collection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"hellshacker","files":96,"time":1450835171,"description":"Plot:\r\n\r\nStar Trek: Voyager is the fourth live-action Star Trek series. It was created by Rick Berman, Michael Piller and Jeri Taylor, and ran on UPN (as UPN's first ever series) for seven seasons in the USA, from 1995 to 2001. In some areas without local access to UPN, it was offered to independent stations through Paramount Pictures (for its first six seasons). The series is best known for its familial crew, science fiction based plots, engaging action sequences and light humor. The writers often noted that many episodes had underlying themes and messages or were metaphors for current social issues. This is the first Star Trek series to feature a female captain in the main cast. Additionally, the show gained in popularity for its storylines which frequently featured the Borg. Voyager follows the events of Star Trek: The Next Generation and ran alongside Star Trek: Deep Space Nine during its first five seasons.\r\n\r\n\r\nINFO:\r\n\r\n\r\nGenre: Action | Adventure | Sci Fi\r\nYear: 1995-2001\r\nSource: Original Retail Disc\r\nFormat: ISO\r\nVideo: PAL DVD9\r\nBitrate: Untouched\r\nMenus: Untouched\r\nExtras: Untouched\r\nAudio: DD 5.1 English, German | DD 2.0 Spanish, French, Italian\r\nSubtitles: Danish, German, English, Spanish, French, Italian, Dutch, Norwegian, Swedish\r\n\r\n\r\nSpecial features: Very many,for example:\r\n\r\nBraving the Unknown: Season One\r\nA 10 minute look at the early development of the series and the challenges the series faced, featuring interviews with the series creators Rick Berman, Michael Piller, and Jeri Taylor (1994).\r\nVoyager Time Capsule: Kathryn Janeway\r\nA 15 minute look at the history of Kate Mulgrew (interviews from 1994, 2001, and 2003), outtakes, rehearsals, and a discussion of the character's arc over the course of the show. This special feature also includes behind-the-scenes material from Ethan Phillips and Rick Kolbe.\r\nThe First Captain: Bujold\r\n8 minutes of footage shot while Geneviève Bujold played the part of Janeway, including an interview with Rick Berman.\r\nCast Reflections: Season One\r\nAn 8 minute look at the cast members' reflections on joining the Star Trek universe, including interviews with Kate Mulgrew (1994), Roxann Dawson (2001), Robert Beltran (2001), Tim Russ (2001), Ethan Phillips (2001), Jennifer Lien (1994), Robert Picardo (2001), Robert Duncan McNeill (2001), Garrett Wang (2001), and Armin Shimerman (2003).\r\nRed Alert: Visual Effects Season One\r\nA 10 minute piece covering some of the special effects and shooting tricks during the season, including challenges during the pilot, the miniature ship used, and the &quot;Caretaker&quot; character. Interviewees: Dan Curry (segments from 1994 and 2003) and David Stipes (1994).\r\nReal Science with André Bormanis\r\nA 9 minute piece discussing time travel, wormholes, and radiation in the real world.\r\nLaunching Voyager on the Web\r\nA 6 minute look at how Voyager used the web during its initial launch and how the webpage grew over the course of the show. The feature includes an interview with formersupervising producer Marc Wade.\r\nOn location with the Kazons\r\n5 minutes in the desert, showing how a Star Trek show is shot, including interviews with David Livingston and Winrich Kolbe.\r\nStar Trek: The Experience\r\nA 16 minute introduction of the locations, the staff, and the events of the attraction, located at the Las Vegas Hilton.\r\nPhoto gallery\r\nStar Trek: Deep Space Nine DVD Trailer\r\nStar Trek: The Next Generation DVD Trailer\r\nEaster Eggs\r\nAbout 5 minutes worth of interviews are &quot;hidden&quot; on the special features menu screens. With interviews of Vaughn Armstrong about his role as Telek R'Mor, Brannon Braga about &quot;Phage&quot;, Michael Piller about Janeway's hairstyle, and Kate Mulgrew about her role in &quot;Caretaker&quot;.\r\nBonus Episodes\r\nIn the original Region 2 UK release with the red plastic casing, an extra 6th disc is included that contains two episodes from Star Trek: The Original Series, &quot;Arena&quot; and &quot;The City on the Edge of Forever&quot;. This disc was also included in The Full Journey UK release.\r\n\r\n\r\nNotice: I will seed this torrent from 12:00 till 2:00 (Moscow time)","torrent":{"xt":"urn:btih:cfa800b04e4b54e9dd8acbe8f8d2be1b606e7e42","amp;dn":"Star+Trek%3AVoyager+The+complete+DVD+collection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfa800b04e4b54e9dd8acbe8f8d2be1b606e7e42","infoHashBuffer":{"type":"Buffer","data":[207,168,0,176,78,75,84,233,221,138,203,232,248,210,190,27,96,110,126,66]},"announce":[],"urlList":[]}}