{"title":"Rigmar Radio Karaoke Collection 27400","uid":13191533,"size":2127772587,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d05ff13902c370e9a74f43e9139bc17e39a3a1f3&amp;dn=Rigmar+Radio+Karaoke+Collection+27400&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":601,"time":1452443546,"description":"OK Gang, No serious down-loaders left on the RE Seeds so moving on with a further 300 Songs from the Rigmar Radio commercial Karaoke collection.  Note this half of the collection has not as yet been optomised for multi label selections on the more popular tracks, as it is a very time consuming thing having to re rip the physical media of yesteryear again.\r\n\r\nAs a result errors and duplications may be slightly higher than normal as we make our weary way towards X, Y and Z.\r\n\r\nAfter 12 hours I will stop seeding this new torrent and go back to re seeding torrents 13700 to 16400.  Priority will be given to those peers who can actually torrent and max out my upload speeds.\r\n\r\nThose peers who have no idea how to torrent, or suffer from overloaded clients and blocked router ports (and at my end that is at least 40% of ALL Micro Torrent users sigh... and attempt to join this or any other swarm I am seeding will be ignored.\r\n\r\nTo grab this entire collection you will have to download over 100,000 files and 300 Gigabytes of DATA and you simply can not do that at dial up speeds.  \r\n\r\nDownloading at dialup speeds of below 100 Kilobite per second is NOT FAIR to those who are seeding and have to stay seeding just for you to take 3 weeks to download 300 songs.  YOU ARE KILLING BIT TORRENT.   END OF RANT&gt;&gt;&gt;","torrent":{"xt":"urn:btih:d05ff13902c370e9a74f43e9139bc17e39a3a1f3","amp;dn":"Rigmar+Radio+Karaoke+Collection+27400","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d05ff13902c370e9a74f43e9139bc17e39a3a1f3","infoHashBuffer":{"type":"Buffer","data":[208,95,241,57,2,195,112,233,167,79,67,233,19,155,193,126,57,163,161,243]},"announce":[],"urlList":[]}}