{"title":"Ted Saves The World Series - Bryan Cohen","uid":13347784,"size":3067896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d075602bdb5288e9cf41aa97ad3b49608b96b5d2&amp;dn=Ted+Saves+The+World+Series+-+Bryan+Cohen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":12,"time":1454066226,"description":"01. Ted Saves the World [Ted Saves the World, #1] - Bryan Cohen\r\n\r\n\r\n\r\nTed Finley was your typical, wise-cracking teenager ...until an otherworldly force gave him abilities beyond his wildest dreams. After an unintended public display of his powers, Ted has become an instant celebrity and the target of a gang of undead thugs. Sixteen-year-old Erica LaPlante was six-feet-under when a blast of blue light brought her body back to life. Armed with the consciousness of a fierce warrior, Erica must keep her teenage urges at bay to protect the newfound hero. When sparks fly between Ted and Erica, Erica wants nothing more than to hide who she really is and the dangerous mission they must face. But when their school comes under attack, Ted and Erica must use everything at their disposal to save their friends, the town and... well, the world. Ted Saves the World is a YA sci-fi/fantasy novel that features fast-paced action, terrifying horror, side-splitting comedy and a touch of romance. Author Bryan Cohen has watched every episode of Buffy the Vampire Slayer and it shows in the first book of his new series.\r\n\r\n\r\n\r\n02. Mind Over Easy [Ted Saves the World, #2] - Bryan Cohen\r\n\r\n\r\nTed Finley thought being a teenage superhero would make life easier…\r\n\r\n…until friends and foes began taking sides in an escalating war.\r\n\r\nBetween fighting crime, ignoring the growing Go Home Alien movement and fielding recruitment offers from the federal government, Ted's world is growing more complicated by the day. His one saving grace is his budding romance with Erica LaPlante, a light soul from another world in the form of his dream girl.\r\n\r\nErica is falling for Ted too, but she's also keeping secrets from him to preserve her mission. As Ted, Erica and the rest of the team cope with the fallout from their battle against the dark souls, a new evil ascends on the town with the ability to control what they think, see and feel.\r\n\r\nErica's secrets may hold the key to winning the battle but revealing them could sacrifice the war.\r\n\r\nMind Over Easy is the second novel in a YA sci-fi/fantasy series that features breathtaking action, frightening horror, laugh-out-loud humor and a hint of romance. Author Bryan Cohen continues to adapt his love for Buffy the Vampire Slayer and all things Joss Whedon in the second book of the Ted Saves the World Series.\r\n\r\n\r\n\r\n03. Portal Combat [Ted Saves the World, #3] - Bryan Cohen\r\n\r\n\r\n\r\nAs the barriers between worlds start to crumble…\r\n\r\n*…superhero Ted Finley must battle his greatest enemy yet. *\r\n\r\nAfter a summer spent protecting the vulnerable from natural disasters, Ted couldn't be more excited to return home for his senior year of high school. While he dreams of training with and dating his protector, Erica LaPlante, life as a teenage superhero continues to get harder. A cunning presidential candidate, a disgruntled gatekeeper between realms, and two familiar villains threaten to end Ted and Erica's mission, as well as the world.\r\n\r\nWhen a new and powerful enemy emerges, Ted and Erica must choose their allies wisely to keep a deadly army at bay. If they fail, the people they know and love will find themselves on a planet-wide battlefield.\r\n\r\nPortal Combat is the third novel in a YA sci-fi/fantasy series that features action-packed fight scenes, terrifying villains, witty banter, and a pinch of heart. Author Bryan Cohen's Ted Saves the World Series continues to grow in scope and excitement in his third installment.\r\n\r\n\r\n\r\n04. The Light, The Dark and The Ugly - [Ted Saves the World, #4] - Bryan Cohen\r\n\r\n\r\nAfter passing through the portal to another realm…\r\n\r\n…Ted Finley must put his trust in unlikely allies to survive.\r\n\r\nThe Realm of Souls is a war zone, and Ted and Natalie are behind enemy lines. Badly injured and powerless, the two strangers to a new world must rely on a mysterious woman and her village to live to see another day.\r\n\r\nErica LaPlante is down to her second-to-last option. Only a coordinated effort from Jennifer, Dhiraj, Travis and the rest of the gang will keep Erica from her last resort: death and regeneration. But fugitives at large can't hide forever, and some of them won't live long enough to clear their names.\r\n\r\nThe Light, the Dark and the Ugly is the fourth novel in a YA Sci-Fi Fantasy series that features exhilarating combat, deadly foes, sharp humor, and a little romance. Author Bryan Cohen's Ted Saves the World series breaks darker ground in a chilling, action-packed fourth installment","torrent":{"xt":"urn:btih:d075602bdb5288e9cf41aa97ad3b49608b96b5d2","amp;dn":"Ted+Saves+The+World+Series+-+Bryan+Cohen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d075602bdb5288e9cf41aa97ad3b49608b96b5d2","infoHashBuffer":{"type":"Buffer","data":[208,117,96,43,219,82,136,233,207,65,170,151,173,59,73,96,139,150,181,210]},"announce":[],"urlList":[]}}