{"title":"John Batchelor Paranoid Style Egyptian Politics.mp3","uid":14698904,"size":5254290,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d1e5d158319ccfa236f179ef86f7de104084cd3a&amp;dn=John+Batchelor+Paranoid+Style+Egyptian+Politics.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1464279361,"description":"The Paranoid Style in Egyptian Politics. After Bibi. @erictrager18. @stephenswsj.\r\n\r\nThe original crackdown on NGOs began under the military junta that governed for the sixteen months following President Hosni Mubarak's February 2011 ouster. At the time, officials claimed that foreign-funded organizations were working to divide and destabilize Egypt; by December, security forces were raiding the offices of the National Democratic Institute, the International Republican Institute, Freedom House, and the Konrad Adenauer Foundation. Forty-three employees of these NGOs were indicted in February 2012, including sixteen Americans. In response, the Obama administration threatened to cut military aid and then posted approximately $5 million in bail that March, enabling the indicted Americans to leave the country safely. Fifteen months later, an Egyptian court convicted all forty-three employees, some in absentia. The issue went more or less dormant shortly afterward, as the July 2013 toppling of Egypt's first elected president, Muslim Brotherhood leader Mohamed Morsi, brought other human rights concerns to the fore. Yet U.S. officials have quietly prodded Cairo ever since to pardon the convicted workers and put the issue to rest.\r\n\r\nGiven the opacity of Egypt's current government under President Abdul Fattah al-Sisi, it is difficult to know why these investigations are being reopened now, including against many nonpolitical NGOs. The decision may have come from one of Egypt's many (sometimes competing) security services, or from the very top. Either way, the investigations are consistent with Cairo's long-running narrative that the political tumult of the past five years is a foreign conspiracy. Indeed, officials at every level -- including the president -- claim that foreigners are waging &quot;fourth-generation warfare&quot; against Egypt, with external powers deploying domestic actors to weaken and destroy the state from the inside &quot;without firing a single bullet,&quot; as a recent column in the state-run daily al-Ahram described it. Foreign-funded NGOs are depicted as key weapons in this supposed &quot;war.&quot;\r\n \nhttp://www.washingtoninstitute.org/policy-analysis/view/egypt-renews-its-crackdown-on-ngos\r\n \nhttp://www.wsj.com/articles/netanyahu-against-the-generals-1464045651?tesla=y\r\n\r\nThe John Batchelor Show\t \nhttp://johnbatchelorshow.com/","torrent":{"xt":"urn:btih:d1e5d158319ccfa236f179ef86f7de104084cd3a","amp;dn":"John+Batchelor+Paranoid+Style+Egyptian+Politics.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e5d158319ccfa236f179ef86f7de104084cd3a","infoHashBuffer":{"type":"Buffer","data":[209,229,209,88,49,156,207,162,54,241,121,239,134,247,222,16,64,132,205,58]},"announce":[],"urlList":[]}}