{"title":"WinUtilities.Pro.Edition.12.5","uid":14727958,"size":6469613,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d55222710a8ab18cfa52eb8dc5a4e12498879d51&amp;dn=WinUtilities.Pro.Edition.12.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"roflcopter2110","files":4,"time":1464567379,"description":"https://extraimago.com/images/2016/05/29/WinUtilities-PRO-Hit2k.jpg\r\n\r\nWinUtilities.Pro.Edition.12.5\r\n\r\nWinUtilities Pro – is a multi-functional system performance and optimization suite for Microsoft Windows. This collection of tools lets you supercharge your PC’s performance, enhance its security,\r\ntweak and optimize its settings, customize and personalize your screens. WinUtilities Pro provides automated and all-in-one PC care service with Process Security, Registry Fix, Privacy Protection, Performance Tune-up, and System Cleaning capabilities. It also creates superior and safer online experience with the latest Surfing Protection and Internet Boost technology, ensuring you top online security and maximum PC performance. This system tweaking suite includes more than 20 tools to improve and tweak your PC’s performance. WinUtilities Pro offers an attractive and easy to use interface that organizes all tasks into categories and provides graphical statistics whenever possible.\r\n\r\nThe tools include Junk File Cleaner, Registry Cleaner, Memory Optimizer, System Information, Registry Backup, File Encryption, Safe Uninstaller, Duplicate File Finder, File Shredder and much more. WinUtilities Pro also includes an Internet Tracks Eraser with Cookie Manager and Secure Deletion. Overall, a great bundle that offers a wide range of system tools with extra benefits which are not easy to find.\r\n\r\nFeatures\r\n• Disk Defrag – Defragment your disks and improve computer performance and stability\r\n• File Undelete – Recovers deleted files on NTFS and FAT volumes.\r\n• Disk Cleaner – Cleans disks from information that clogs your system and reduces the performance of your computer.\r\n• Registry Cleaner – Scans the Windows registry and finds incorrect or obsolete information in the Windows Registry.\r\n• Startup Cleaner – Helps you to easily manage program execution at windows startup.\r\n• History Cleaner – Erases all traces of activity on your computer, save spaces and protect your privacy.\r\n• File Splitter – Splits any type of file into smaller pieces and rejoin them to the original file.\r\n• File Shredder – Erases files and make sure that no data thief can get his hands on your sensitive data.\r\n• File Lock &amp; EXE Protector – Protects any Windows executable file with a secure password.\r\n• Memory Optimizer – Optimizes the Memory Management of Windows. No special configuration is needed, Memory Optimizer will auto configure itself.\r\n• Duplicate Files Finder – Helps you to free disk space by finding and removing duplicate files from your system.\r\n• Shortcuts Fixer – Provides you with an easy way to address the invalid shortcuts and reports back to you so that you can remove it from your system.\r\n• Process Manager – Allows you to check your system’s performance and manage the running processes.\r\n• Uninstall Manager – Manages the programs installed on your system and uninstall unneeded software.\r\n• System Information – Shows you the detailed information for your computer hardware and software.\r\n• Registry Backup&amp;Restore – Back up and restore the Windows Registry.\r\n• Registry Search – Searchs the Windows Registry by a specific wildcard. then you can delete or export them.\r\n• BHO Remover – Manages the BHOs that are currently installed.\r\n• Auto Shutdown – Schedules your computer for log off, stand by, hibernate, or shutdown at a specific time.\r\n• Windows Tools – Provides you an easy way to launch the utilities build in Windows.\r\n• System Control – Organizes and manage your Windows Settings\r\n• Task Scheduler – Configures the cleaning tasks that take place automatically","torrent":{"xt":"urn:btih:d55222710a8ab18cfa52eb8dc5a4e12498879d51","amp;dn":"WinUtilities.Pro.Edition.12.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d55222710a8ab18cfa52eb8dc5a4e12498879d51","infoHashBuffer":{"type":"Buffer","data":[213,82,34,113,10,138,177,140,250,82,235,141,197,164,225,36,152,135,157,81]},"announce":[],"urlList":[]}}