{"title":"Hercules &amp; Xena - La battaglia del monte Olimpo","uid":13181549,"size":1624864004,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d69c685bccee68cf9a98aefcb791b1895cf617fc&amp;dn=+Hercules+%26amp%3B+Xena+-+La+battaglia+del+monte+Olimpo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":1,"time":1452338655,"description":"Hercules &amp; Xena - La battaglia del monte Olimpo, [Mux - H264 - Ita Esp Eng Ac3] DVDmux . The Seven Stars' Team\r\n\r\nTRAMA\r\n\r\nIl film ha inizio con le ninfe che cantano una canzone che descrive il tempo degli dei poi si vede Hercules combattere contro un mostro marino e dopo averlo ucciso viene osannato dai pescatori del villaggio che poi gli danno un enorme pesce in dono. Poi con l'amico Lolau i due fanno ritorno a casa della madre di Hercules e lungo il cammino devono dare una lezione a dei briganti.\r\nIntanto in una taverna Xena e Olimpia devono vedersela con dei brutti ceffi e ricevono la visita di Marte che dice a Xena di tenere lontano Hercules dalla casa di sua madre. Xena commenta &quot;se Marte non vuole che Hercules vada a casa di sua madre probabilmente è il miglior posto in cui può stare&quot;.\r\nHercules e Iolau stanno intanto arando i campi e in quel momento Giove arriva dal cielo e rapisce la madre di Hercules portandola sull'Olimpo. Hercules allora li segue con il fidato Iolau e mentre i due scalano l'Olimpo di sopra Giunone ruba la pietra di Crono e libera quattro titani dall'Averno (fuoco, acqua, terra e vento) nel tentativo di prendere il comando e scacciare figli e marito dall'Olimpo. Giove custodisce la sua amata in un castello in miniatura (una sorta di soprammobile).\r\nMentre i titani tornano in libertà e si avviano verso l'Olimpo causano un terremoto e fanno dei feriti. Xena con l'aiuto di Olimpia li cura, ma Diana (dea della caccia) per aiutare Marte trasforma l'aedo in un'enorme aquila. Xena dopo l'iniziale disperazione sale in groppa all'uccello e sale sull'Olimpo dove si trova coinvolta nella prima battaglia contro i titani al fianco degli dei. Hercules invece si limita a prendere sua madre e non aiuta gli altri i quali alla fine sono costretti a lasciare la montagna e scendere sulla terra a casa di Hercules. Come se non bastasse Giunone li trasforma in animali: Giove-topo, Ares-capra, Venere-mucca, Diana-coniglio.\r\n\r\nQuando arriva Xena pretende che Diana la riporti come prima ma la dea non può farlo perchè ha perso i suoi poteri. Xena canta una canzone a Olimpia mentre Hercules la ascolta e decide di aiutare gli dei a ristabilire l'ordine.\r\nSull'Olimpo intanto, i titani hanno distrutto tutto e Giunone prevedendo l'attacco ne accresce i poteri ma ne perde il controllo. Ora la pietra di Kronos è sulla fronte del titano della terra (il più forte).\r\nDopo un'estenuante battaglia i titani sono sconfitti, gli dei e Olimpia riacquistano la loro forma e Hercules apprende che sua madre non era stata rapita ma ha lasciato la terra di sua volontà perchè è malata e sta invecchiando mentre sull'Olimpo avrebbe l'immortalità. La madre allora ritorna con Giove e ai nostri eroi non resta che salutarsi alla prossima avventura.\r\n[Fonte http://www.xandrella.com/battagliaolimpo.htm]\r\n\r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=486258","torrent":{"xt":"urn:btih:d69c685bccee68cf9a98aefcb791b1895cf617fc","amp;dn":"+Hercules+%26amp%3B+Xena+-+La+battaglia+del+monte+Olimpo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d69c685bccee68cf9a98aefcb791b1895cf617fc","infoHashBuffer":{"type":"Buffer","data":[214,156,104,91,204,238,104,207,154,152,174,252,183,145,177,137,92,246,23,252]},"announce":[],"urlList":[]}}