{"title":"Rhoda","uid":13429196,"size":9896992301,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d7577d5e19c54adeb8f0fa1cb09a2ab862ccc54a&amp;dn=Rhoda&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7436746","files":73,"time":1454619060,"description":"http://www.imdb.com/title/tt0071040/\r\n\r\nAfter spending several years in her young adult life in Minneapolis but with her brash Bronx Jewish upbringing in tow and with its associated sarcasm, artistically inclined Rhoda Morgenstern returns to her hometown of New York City to begin life anew. She continues her navigation of searching for true love, initially with Joe Girard, the owner of his own wrecking company, he being the original reason she decided to move back to New York to begin with. Her relationships with Joe and with other men are an evolution to often being the pursued from what was a self-perception of being the overweight ugly duckling always doing the pursuing and mostly of undesirable men who she felt were the only people she could pursue. She also tries to find her place in the working world, doing something using her artistic abilities honed in art school such as the window dressing work she did in Minneapolis. Through it all, she reestablishes a day-to-day relationship with her family: her overbearing and diminutive mother, Ida; her often over-supportive father, Martin; and her baby sister Brenda, whose evolution as a human almost mirrors Rhoda's own when Rhoda was Brenda's age.\r\n- Written by Huggo","torrent":{"xt":"urn:btih:d7577d5e19c54adeb8f0fa1cb09a2ab862ccc54a","amp;dn":"Rhoda","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7577d5e19c54adeb8f0fa1cb09a2ab862ccc54a","infoHashBuffer":{"type":"Buffer","data":[215,87,125,94,25,197,74,222,184,240,250,28,176,154,42,184,98,204,197,74]},"announce":[],"urlList":[]}}