{"title":"The Upperfloor--tUF-39466 Fallon West, Roxanne Rae, Marco Bander","uid":13353922,"size":4017328855,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d9e78c55a0d862fb874bd7d6decee4444184e4d1&amp;dn=The+Upperfloor--tUF-39466+Fallon+West%2C+Roxanne+Rae%2C+Marco+Bander&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":93,"time":1454108659,"description":"Anal Sluts Serve Wild BDSM Brunch\r\n\r\nJan 29, 2016 - Performers: Marco Banderas ,  Roxanne Rae  and  Fallon West \r\n\r\n\r\nMed, Hi and HD MP4 + Pics.\r\n\r\n\r\nFallon West smiles meekly with her face trapped in a strict posture collar. Her senior slave, kinky anal whore slave Roxanne Rae stands by nervously. The slave to be initiated called in sick, and we had to basically snatch this no nothing newbie slut off the short list and throw her into the middle of our wildest brunch crowd. Beautiful slutty women can barely wait until brunch is eaten before they are fucking each other on the table and cumming in each others' faces. Meanwhile, all we expect Fallon to do is pour some champagne, but distracted with a hitachi she can't manage to do so without spilling everywhere. We allow one of the female guests to punish her tits, while Roxanne is busy sucking cock and having her nipples tormented with multiple pair of harsh metal clamps. Both girls enjoy some painful punishment orgasms and a hot load on their faces before they are sent to the lounge to enjoy more anal punishment. \r\n\r\nSomeone in the crowd has a fucking machine, and quickly goes to work drilling all the pussies in the room into screaming orgasms, while other women hang from the air in tight rope suspension having their cunts licked. Caning, paddling, fucking, and begging, the room is alight with the sounds of masochists and sadists having a time of it. Roxanne is bound in a very difficult partial suspension and begs for her tight ass to get pounded while Fallon lean red to beg and clean up her seniors ass juice with her mouth. Next up, Fallon appears to not be able to control her orgasms while she is getting pounded in the ass. Roxanna has her perky tits and pink pussy tortured with clamps and a vibrator, her bouncy ass made bright red and marked with a paddle and spanking until Fallon can get it right. Well fucked and with beaten asses, our slaves beg for the cum as the crowd toasts to an afternoon well spent. \r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=39466\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:d9e78c55a0d862fb874bd7d6decee4444184e4d1","amp;dn":"The+Upperfloor--tUF-39466+Fallon+West%2C+Roxanne+Rae%2C+Marco+Bander","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e78c55a0d862fb874bd7d6decee4444184e4d1","infoHashBuffer":{"type":"Buffer","data":[217,231,140,85,160,216,98,251,135,75,215,214,222,206,228,68,65,132,228,209]},"announce":[],"urlList":[]}}