{"title":"Lucinda Williams - Blessed (2011) [2CD] [EAC-FLAC]","uid":13163588,"size":636644410,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc12f3d40bcff9672199c77e1559216aafd5cf80&amp;dn=Lucinda+Williams+-+Blessed+%282011%29+%5B2CD%5D+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pucholoco","files":45,"time":1452182142,"description":"Lucinda Williams - Blessed (2011) [2CD] (Deluxe Edition)\r\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 606 Mb \r\n                       Full Artwork @ 300 dpi (jpg) -&gt; 31 Mb\r\n\r\n\r\nBlessed, the stunning new album from three-time Grammy Award-winner Lucinda Williams is set for release on March 1st 2011 by Lost Highway. Considered by many to be one of America's greatest living songwriters, Williams lives up to that and more by delivering 12 new songs that cover an even wider emotional spectrum than her previous work, without moving too far in any one direction. \r\n\r\nBlessed opens with the gritty kiss-off &quot;Buttercup&quot; then moves seamlessly into the sultry blues of &quot;Born To Be Loved&quot;. Williams delves into a heavier subject as she questions the motives for a suicide on the hard-driving &quot;Seeing Black&quot;, which features blistering guitar from Elvis Costello. The thoughtful title track slowly builds to a melodic climax as it offers an eye-opening look at what's right in front of us, but too often unnoticed.\r\n\r\nThe poignant and powerful &quot;Soldier's Song&quot; simultaneously tells a tragic story of the soldier overseas and his wife and child back home. On the gorgeous &quot;Kiss Like Your Kiss&quot;, Williams lays down one of the most beautiful and fragile vocals she has ever recorded.\r\n\r\nThe original version of &quot;Kiss Like Your Kiss&quot; appeared on the True Blood: Music From The HBO Original Series - Volume 2 and was just nominated for a Grammy Award for Best Song written for motion picture, television or other visual media. It's nothing new to see Williams tug at the heartstrings and stimulate the mind with her songs, but there is a vibe throughout Blessed that is unique to this album in-particular. It's the sound of the wisdom and experience Williams has gained through her years as an uncompromising talent. \r\n\r\nCombine that with Grammy Award-winning producer Don Was at the helm, and something special is born. Was co-produced Blessed with Eric Liljestrand and Tom Overby, who co-produced Williams highly-praised Little Honey (2008). Blessed features special guests Rami Jaffe on keyboards, Matthew Sweet on vocals Greg Leisz and Elvis Costello on guitar.\r\n\r\n\r\nThe Deluxe Edition comes with a bonus disc called 'The Kitchen Tapes'. These are the demos Lucinda recorded of the songs that became Blessed right as they were born at her kitchen table, where she does most of her writing. To further enhance Lucinda's vision, The Deluxe Edition is available with 8 different album cover images randomly distributed through the manufacturing process. \r\nThe one cover you get may not be the one you see here, but we're sure you'll agree it's an equally powerful image and another facet of this incredible album.\r\n\r\n\r\nDisc 1\r\n01 - Buttercup\r\n02 - I Don't Know How You're Livin'\r\n03 - Copenhagen\r\n04 - Born to Be Loved\r\n05 - Seeing Black\r\n06 - Soldier's Song\r\n07 - Blessed\r\n08 - Sweet Love\r\n09 - Ugly Truth\r\n10 - Convince Me\r\n11 - Awakening\r\n12 - Kiss Like Your Kiss\r\n\r\n\r\nDisc 2 (Kitchen Tapes)\r\n01 - Buttercup\r\n02 - I Don't Know How You're Livin'\r\n03 - Copenhagen\r\n04 - Born to Be Loved\r\n05 - Seeing Black\r\n06 - Soldier's Song\r\n07 - Blessed\r\n08 - Sweet Love\r\n09 - Ugly Truth\r\n10 - Convince Me\r\n11 - Awakening\r\n12 - Kiss Like Your Kiss\r\n\r\n*2011 Lost Highway Records / Universal | B0015240-02\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:dc12f3d40bcff9672199c77e1559216aafd5cf80","amp;dn":"Lucinda+Williams+-+Blessed+%282011%29+%5B2CD%5D+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc12f3d40bcff9672199c77e1559216aafd5cf80","infoHashBuffer":{"type":"Buffer","data":[220,18,243,212,11,207,249,103,33,153,199,126,21,89,33,106,175,213,207,128]},"announce":[],"urlList":[]}}