{"title":"Secret Societies - 01- Devil in The Vatican","uid":13261016,"size":3541846531,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ddca4b40c8c4a6dec2691cca8e8eea0c0b0496f4&amp;dn=Secret+Societies+-+01-+Devil+in+The+Vatican&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":93,"time":1453277156,"description":"Secret Societies - 01- Devil in The Vatican (Size: 3.3 GB)\r\n \t\tTorrent downloaded from Demonoid.ooo.txt\t48 bytes\r\n \t\r\nDevil in Vatican\r\n \t\r\nMp3\r\n \t\r\nSigns of the Times\r\n \t\r\nSIN-ister Clips\r\n \t\r\nThe Holy Spirit\r\nDescription\r\nDescription\r\n\r\n\r\nReturn to Home Page\r\n\r\n‘The devil is at work inside the Vatican’, says the chief Roman Catholic exorcist\r\n\r\nIt was reported by various news agencies on 11 March that the great number of sex abuse scandals in the Catholic Church can be attributed to the fact that ‘the devil is working in the Vatican’. This is according to the 85 year-old priest Fr Gabriele Amorth who has been the chief exorcist of the Vatican for the last 25 years. In the past the exorcist also stated the obvious - that both Stalin and Hitler had been possessed by the Devil.\r\n\r\n‘When one speaks of ‘the smoke of Satan’ in the holy rooms (a phrase coined by Pope Paul VI in 1972), it is all true, including the latest cases of violence and pedophilia’, he said in an interview reported in the Times of London. The priest who has, in his own words, carried out 70,000 exorcisms affirmed that ‘cardinals who do not believe in Jesus and bishops who are linked to the Demon’ are not a rarity in today’s Vatican.\r\n\r\nHe also claimed that another example of satanic behaviour was the Vatican cover-up of the deaths in 1998 of Alois Estermann, the then commander of the Swiss Guard, his wife and Corporal Cedric Tornay, a Swiss Guard, who were all found shot dead. ‘They covered up everything immediately’, he said. ‘Here one sees the rot’. Reports claim that the affair, which involved a still unknown fourth person, had a homosexual background.\r\n\r\nFr Gabriele, who recently published ‘The Memoirs of an Exorcist’ in the form of a series of interviews, also explained the attempt on the life of Pope John Paul II in 1981 and the attack last Christmas of a mentally deranged woman on Pope Benedict XVI as due to the interference of satanic powers.\r\n\r\nAt present the Roman Catholic world is struggling to come to terms with huge numbers of recently-revealed cases of physical and sexual abuse in Germany, Austria and Holland. These follow the scandals in Ireland and the bankruptcy of Roman Catholic dioceses in the USA following pedophilia payouts. The Pope’s brother, Fr George Ratzinger has admitted to physical abuse of boys up until 1980. In Germany, the liberal Catholic philosopher, Hans Kung, has called on Roman Catholics to return to the married priesthood, the norm before the late eleventh century.\r\nRelated Torrents","torrent":{"xt":"urn:btih:ddca4b40c8c4a6dec2691cca8e8eea0c0b0496f4","amp;dn":"Secret+Societies+-+01-+Devil+in+The+Vatican","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddca4b40c8c4a6dec2691cca8e8eea0c0b0496f4","infoHashBuffer":{"type":"Buffer","data":[221,202,75,64,200,196,166,222,194,105,28,202,142,142,234,12,11,4,150,244]},"announce":[],"urlList":[]}}