{"title":"Scream 3 TRUEFRENCH DVDRiP 2000","uid":13257255,"size":734181294,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de7c294ce161ff041716ffcf23cb3b8a2871e01f&amp;dn=Scream+3+TRUEFRENCH+DVDRiP+2000&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"annuaireweb","files":1,"time":1453228638,"description":"Cotton Weary, l'un des survivants de la tuerie de la fac de Windsor, rentre tranquillement chez lui après avoir terminé le tournage de l'émission quotidienne qu'il anime. Le téléphone sonne. Au bout du fil, une fan... qui s'avère être un dangereux tueur, prêt à tout pour retrouver la trace de Sydney Prescott.La jeune femme reste terrée dans une maison surprotégée, afin d'effacer les souvenirs traumatisants dont elle a été précédemment l'héroïne malheureuse lors des massacres perpétrés à Woodsboroo et à Windsor. Le sujet semble quant à lui à la mode, puisque John Milton a décidé de produire un troisième film , &quot;Stab 3&quot;, relatant les agissements du mystérieux tueur masqué.Mais la réalité rattrape à nouveau la fiction lorsque l'une des actrices principales est sauvagement assassiné sur le plateau. L'inspecteur Kincaid décide de faire appel aux survivants des premiers évènements, l'ex policier Dewey Riley, devenu consultant sur &quot;Stab 3&quot;, la journaliste Gale Weathers et Sydney. Mais bientôt la vague de meurtres continue. Qui s'acharne à vouloir détruire Sydney ? La clé du mystère ne remonte-t-elle pas aux origines de toute cette histoire ?","torrent":{"xt":"urn:btih:de7c294ce161ff041716ffcf23cb3b8a2871e01f","amp;dn":"Scream+3+TRUEFRENCH+DVDRiP+2000","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7c294ce161ff041716ffcf23cb3b8a2871e01f","infoHashBuffer":{"type":"Buffer","data":[222,124,41,76,225,97,255,4,23,22,255,207,35,203,59,138,40,113,224,31]},"announce":[],"urlList":[]}}