{"title":"Darkest Dungeon Build 12331","uid":13070523,"size":1085034855,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1ba1256bc43ca9b10bd2a5f0b5325e6ccab6970&amp;dn=Darkest+Dungeon+Build+12331&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"monosoul","files":2,"time":1450792261,"description":"Title: Darkest Dungeon\r\nGenre: Indie, RPG, Strategy, Early Access\r\nDeveloper: Red Hook Studios \r\nPublisher: Red Hook Studios\t\r\nRelease Date: 3 Feb, 2015\r\nCrack:3DM\r\n\r\n\r\nHOTFIX 12331: Fixed bug with graphical display of Options tooltips \r\n\r\nGame Options \r\nMore game options have been added! \r\nOptions are sorted into categories \r\nGameplay Options are now controlled by a master &quot;Darkest Dungeon Config&quot; option. In order to toggle individual gameplay options off, you must first change &quot;Darkest Dungeon Config&quot; to OFF. &quot;Darkest Dungeon Mode&quot; is the default configuration as designed. \r\nIf you previously had Corpses turned OFF, you will need to turn Darkest Dungeon Config OFF and then turn Corpses OFF again. \r\nRemoved the option to disable Heart Attacks. Heart Attacks were changed substantially in the Inhuman Bondage update (they no longer kill you instantly) and the stress mechanics of the game require you to play with the revised Heart Attacks \r\nNew Game Option: Disable Combat Delay Penalties \r\nNew Game Option: Reduce strength of enemy crits \r\nNew Game Option: Eliminate lasting mortality debuffs from Death's Door and Heart Attacks \r\nNew Game Option: Make Combat Retreats always succeed (except when blocked by Affliction)\r\n\r\nInterface Improvements \r\nTown Quicknav Buttons - Upon entering a town building, you can quickjump to another building by clicking the buttons on the left side of the screen. This reduces the clicks necessary to get around town and attend to your heroes. \r\nEmbark Memory - Upon returning to the Hamlet, the party slots will remain occupied by the previous party. Roster sort by activity should also include sorting by who is in current party. \r\nTrap Disarm Tray Icon - Upon approaching a scouted trap, a tray icon will pop for the hero(s) to show their chances of disarming it. \r\nTAB to switch between Map and Inventory panels. \r\nRight panel will no longer automatically swap to map from inventory when the party starts moving. Manually do it with TAB or (M). \r\nCLICK on torch meter at top of screen to quickly use a torch from inventory. \r\nAdded &quot;actions remaining&quot; to the health/stress bar tooltips to indicate what the tickmark means (hero or monster still has another action this combat round) \r\nAdded tutorial event for selling trinkets. \r\nMisc town UI icon polish \r\nTrinket selling confirm now has an &quot;always&quot; button, to reduce popups on repeated trinket selling \r\nIf embarking on a quest of Veteran or Champion difficulty and you don't have any trinkets equipped, a warning box will pop up to remind you. \r\nCurio disease resists will say &quot;Resist!&quot; to give a better idea of what happened \r\nTrinket alphabetical secondary sort so that identical trinkets end up beside one another after a class/rarity sort.\r\n\r\nGameplay Adjustments \r\nAfflictions: if trying to heal, move or buff an afflicted hero and they resist, this will no longer consume the originating hero's turn. That hero can try to do another action. (e.g. You try to heal your paranoid Crusader with a Vestal. If the Crusader refuses, you still get to use the Vestal to do something else that turn.) \r\nIncreased ACC of many hero skills, with particular emphasis to make status skills (debuffs, stuns, etc.) more accurate overall. This shifts more burden onto resist rolls for those skills.\r\nHighwayman - Tracking Shot now procs the buff even on a miss \r\nSanitarium - increased chance of curing all diseases at once during a disease treatment \r\nMonsters - some veteran and champion HP increases to partially account for overall increased hero accuracy \r\nMonsters - review of resistances (bleed, blight, stun, move, debuff), mostly resulting in reductions \r\nMonsters - some speed tweaks to emphasize roles \r\nMonsters - dodge tweaks (some up, some down) to still reflect intent of dodgy monsters, given increased hero accuracy \r\nMadman - reduced stress output at apprentice level so he isn't quite so bad of a new party landmine \r\nFungal Bloat - reduced dmg, crit, and marked target dmg (he was a bit too over-damaging, contributing to high Weald death rates)\r\n\r\nMiscellaneous Fixes \r\nFix to padlock stress buff not applying on transform stress. \r\nAbomination stance fixes. \r\nFix to abomination not reseting to idle when fighting in battle that has no loot. \r\nRestricted hero class can swap out eachother in quest select when no other restrictions will take place. \r\nClamp stress when pending affliction to avoid heart attack before affliction is applied. \r\nRemoved the ability to use items when screen is not idle. \r\nFix to instant skill buffs carying over when transforming because of affliction and selected skill being set","torrent":{"xt":"urn:btih:e1ba1256bc43ca9b10bd2a5f0b5325e6ccab6970","amp;dn":"Darkest+Dungeon+Build+12331","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ba1256bc43ca9b10bd2a5f0b5325e6ccab6970","infoHashBuffer":{"type":"Buffer","data":[225,186,18,86,188,67,202,155,16,189,42,95,11,83,37,230,204,171,105,112]},"announce":[],"urlList":[]}}