{"title":"Clipdiary v3.6 Multilanguage+Portable","uid":13099301,"size":8315892,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1dc2055373fb4e3cd1f6eca47c1b07a7a54e100&amp;dn=Clipdiary+v3.6+Multilanguage%2BPortable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edmacri","files":5,"time":1451201056,"description":"Clipdiary v3.6\r\n\r\nTake full control over your clipboard history\r\n\r\nSave and reuse your Clipboard history\r\n\r\nClipdiary is a powerful clipboard manager, which records every piece of data that goes to the Windows clipboard, meaning that you can easily retrieve any information that was once copied to the clipboard.\r\n\r\nMain features\r\n\r\nClipdiary monitors the clipboard and automatically saves its contents to the clipboard history\r\nSupports text, links, images, files, and all other clipboard formats\r\nThe clipboard history remains between reboots\r\nYou can retrieve the data stored in the clipboard history whenever you need to, even after many years\r\n+Portable version\r\nMultilanguage: Español, English, Russian, Polish, German, French, Danish.\r\n\r\n\r\nClipdiary es un programa para conservar el historial del portapapeles\r\n\r\nCuando usted utiliza el ordenador, constantemente echa mano del portapapeles. Pero no puede almacenar sus datos durante mucho tiempo: apaga el ordenador, o simplemente copia otro texto... y los datos anteriores se pierden.\r\n\r\nEn muchas ocasiones, esto no significa ningún contratiempo, pero ha necesitado alguna vez el texto que copio hace 30 minutos o una hora? no le ha ocurrido que su ordenador 'se queda colgado', y el programa no había guardado los datos? A veces ocurre que usted ha copiado alguna informacion interesante desde una pagina web, pero ha olvidado colocarla donde le interesa? Puede que usted simplemente quiera recordar o recuperar algo que trabajo hace semanas o meses. Como son muchas las situaciones en las que se necesita recuperar contenidos utilizados en el portapapeles, nosotros podemos ofrecerle una herramienta que solucione a este problema.\r\n\r\nInstale nuestro programa de uso libre Clipdiary, para que nunca pierda datos que haya copiado una sola vez. El programa se activa al iniciar Windows, y guarda en una base de datos todo lo que usted coloque en el portapapeles. En cualquier momento se puede ojear el historial del portapapeles, copiar de nuevo los elementos en la memoria cache, y siempre copiarlos en cualquier aplicación o programa. Todo lo que tiene que hacer es pulsar las teclas &quot;Ctrl+D&quot;, o hacer clic en el icono del programa de la bandeja del sistema.\r\n\r\nClipdiary puede registrar el historial del portapapeles y guardar datos de diversos formatos: texto ordinario (txt), texto enriquecido (RTF - Rich Text Format) e imágenes en formato BMP. Es capaz de guardar partes del texto. Puede utilizarse para realizar con sencillez una serie de capturas de las pantallas (screenshots) de sus juegos preferidos, y ClipDiary los guarda por usted.\r\n\r\n---------------------------------------------------\r\n\r\nInstallation:\r\n\r\n1. Run and install &quot;setup_clipdiary_3.6.exe&quot;.\r\n2. When you finish the installation, do not open the program, keep closed.\r\n3. Copy the patch &quot;clipdiary.3.6-patch.exe&quot; inside the folder where the program is installed and run it as an administrator, then you give click &quot;patch&quot;.\r\n4. You can now open the program and use it !!\r\n\r\nPortable:\r\nAlready patched.\r\n\r\n----------------------------------------------------\r\n\r\nInstalacion:\r\n\r\n1. Ejecuta e instala &quot;setup_clipdiary_3.6.exe&quot;.\r\n2. Cuando termines la instalacion, no abras el programa, mantenlo cerrado.\r\n3. Copia el patch &quot;clipdiary.3.6-patch.exe&quot; dentro de la carpeta donde se instalo el programa y ejecutalo como administrador, luego le das clic en &quot;patch&quot;.\r\n4. Ahora puedes abrir el programa y usarlo!!\r\n\r\nPortable:\r\nYa esta parchado","torrent":{"xt":"urn:btih:e1dc2055373fb4e3cd1f6eca47c1b07a7a54e100","amp;dn":"Clipdiary+v3.6+Multilanguage%2BPortable","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dc2055373fb4e3cd1f6eca47c1b07a7a54e100","infoHashBuffer":{"type":"Buffer","data":[225,220,32,85,55,63,180,227,205,31,110,202,71,193,176,122,122,84,225,0]},"announce":[],"urlList":[]}}