{"title":"Chris Isaak - 2016-01-30 - San Francisco","uid":13395021,"size":487832195,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2a806d51426225318cbd07e44cdcc0d5312bd46&amp;dn=Chris+Isaak+-+2016-01-30+-+San+Francisco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GRNS3","files":25,"time":1454368715,"description":"Here is a very recent performance. Check my account for more bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\n\r\nChris Isaak\r\nSuper Bowl City\r\nSan Francisco, Ca\r\nJanuary 30,2016\r\n\r\nRecorded by Daspyknows\r\n\r\nHalf way between stage and soundboard-dead center \r\n  \r\nSchoeps MK41/NBox Platinum Tascam DR-2D 24 Bit 48K \r\n\r\nProcessed using Soundforge 11, resample, to 16bit 44.1K\r\nTLH to convert to Flac\r\n\r\nMaster 2016.07\r\n\r\n\r\nNo setlist has been posted.  I did the recording, I'll let someone else do the setlist.\r\n \r\n\r\nI orginially planned to see Steel Pulse but the tour was cancelled due to David Hinds hospitalized\r\nwith pneumonia.  With that and the passing of Paul Kantner I knew I needed to see some music rather\r\nthan stay home.  With the weather looking OK I figured I would fight the masses and check out Chris\r\nIsaak at Superbowl City in SF.  I took BART in and expected crowds.  The first thing that I thought\r\nwas how lucky I was not to be working in SF through all of this.  Walkthrough metal detectors and \r\nlots of security.  I soon realixed it was all for showand had no problem getting in.  I was able to \r\nget the perfect spot and it was crowded but not crazy at the music stage.  I arrived to some opening\r\nband and went to find a spot to put on the gear.  Ended up setting up while waiting on line at a \r\nrestaurant while grabbing food.  Got back for the soundcheck.  This was followed by annoying radio\r\npersonalities and a dj who played good music put enjoying ruining it.  After standing for 90 minutes\r\nof that the Bay Bridge lights were turned back on which was cool.  Next was a fireworks display.  \r\nOnce the fireworks concluded Chris Isaak came on.  Solid show and good sound.  Aside from some talkers\r\nit is a good recording.  Weather permitrting I will go back for the Alicia Keys set. \r\n  \r\n\r\nJust the basic taper requests here and please no vitriol:\r\nDon't be an ass by selling this or using it in a video that is sold\r\nDon't modify the info file\r\nDon't remaster and/or post on other sites that are not 100% free \r\nIf shared keep info file intact but create a second file with any changes\r\nDon't convert to lossy formats except for personal use\r\nDo support the artists","torrent":{"xt":"urn:btih:e2a806d51426225318cbd07e44cdcc0d5312bd46","amp;dn":"Chris+Isaak+-+2016-01-30+-+San+Francisco","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2a806d51426225318cbd07e44cdcc0d5312bd46","infoHashBuffer":{"type":"Buffer","data":[226,168,6,213,20,38,34,83,24,203,208,126,68,205,204,13,83,18,189,70]},"announce":[],"urlList":[]}}