{"title":"RapidWeaver 6.3.6 [MAC OS X]","uid":13416824,"size":322982931,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e49abf49690d283c9b5a69526560ab36c4116201&amp;dn=RapidWeaver+6.3.6+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iAlexander","files":1,"time":1454505119,"description":"MADE IN UKRAINE\r\n\r\nRapidWeaver 6.3.6 + Great templates (themes) inside this package – Create template-based websites rapidly.\r\n\r\nRapidWeaver is a next-generation Web design application to help you easily create professional-looking Web sites in minutes. No knowledge of complex code is required, RapidWeaver will take care of all that for you. RapidWeaver produces valid XHTML &amp; CSS based websites.\r\nOne of the perks about using RapidWeaver is that it has a strong custom theme community. You can download themes and edit them from within RapidWeaver and the result is a pretty slick looking website that takes very little effort.\r\nRapidWeaver also has a lot of custom plug-ins. Some of them make it easier to edit images directly in RapidWeaver. Others make creating a site map a matter of a few clicks. The supportive community that surrounds RapidWeaver is really what makes this great app superior to other WYSIWYG website creation tools. Be sure to check out YourHead.com for some little tools to help spice up your website in RapidWeaver.\r\n\r\nWhat's new in version 6.3.6:\r\nImproves performance when navigating and modifying large project files.\r\n- Fixes a problem where dragging sidebar items between documents could cause RapidWeaver to crash.\r\n- Fixes a problem that prevented publishing to some SFTP servers.\r\n- Fixes a problem where RapidWeaver would insert site-wide metatags as page-specific metatags when creating a new page, causing duplicate metatags.\r\n- Fixes a problem where RapidWeaver could crash when installing add-ons.\r\n- Works around a problem where RapidWeaver could crash when a blog page's categories could not be fully read.\r\n- Fixes a problem where blog pages would be fully re-published when marked as changed.\r\n- Fixes a problem where blank site thumbnails would be generated when saving a RapidWeaver project.\r\n- Fixes a problem where site-wide CSS and Javascript would be incorrectly referenced (and fail to load) when using the Page List contextual menu's &quot;Preview in Safari&quot; option.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:e49abf49690d283c9b5a69526560ab36c4116201","amp;dn":"RapidWeaver+6.3.6+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e49abf49690d283c9b5a69526560ab36c4116201","infoHashBuffer":{"type":"Buffer","data":[228,154,191,73,105,13,40,60,155,90,105,82,101,96,171,54,196,17,98,1]},"announce":[],"urlList":[]}}