{"title":"Thundercats S01e01-07, [Mux - XviD - Ita Mp3] serie classica","uid":13175407,"size":1276680192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e52846c7a9301c787bb6b984eec0fd6bdf4d3b29&amp;dn=Thundercats+S01e01-07%2C+%5BMux+-+XviD+-+Ita+Mp3%5D+serie+classica&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"foll01","files":7,"time":1452280780,"description":"Thundercats S01e01-07, [Mux - XviD - Ita Mp3] -serie classica- rarita'\r\n\r\nTRAMA\r\n\r\nThunderCats segue le avventure dell'omonimo gruppo di eroi, degli alieni dalla forma di felini antropomorfi provenienti dal pianeta Thundera. La serie inizia proprio con la distruzione del pianeta Thundera, che costringe i ThunderCats (una sorta di nobiltà thunderiana) ad abbandonare la propria patria. Tuttavia la flotta viene attaccata dai nemici dei Thunderiani, i mutanti di Plun-Darr, che distruggono la maggior parte delle astronavi della flotta, ma non riescono a colpire la nave ammiraglia, a bordo della quale sospettano ci sia la leggendaria spada mistica dei presagi. La spada contiene l'occhio di Thundera, la fonte del potere dei ThunderCats, che è incorporata nel manico. Anche se i Mutanti danneggiano la nave ammiraglia, il potere dell'occhio di Thundera riesce comunque a respingerli. Tuttavia i danni all'astronave impediscono ai ThuderCats di raggiungere la loro originaria destinazione, e li costringe a ripiegare verso la &quot;Terza Terra&quot;; che richiederà molto più tempo del previsto. L'anziano dei ThunderCats, Jaga, si offre volontariamente di guidare l'astronave mentre gli altri rimarranno addormentati a lungo all'interno di capsule. Jaga però muore di vecchiaia negli anni successivi, ma non prima di aver assicurato che i ThunderCats a bordo raggiungano la destinazione sani e salvi. All'interno dell'astronave ci sono Lion-O, giovane signore dei ThunderCats, oltre che Cheetara, Panthro, Tygra, WilyKit e WilyKat e Snarf.\r\nQuando i ThunderCats si risvegliano dal loro lungo sonno sulla Terza Terra scoprono che la capsula di sospensione che conteneva Lion-O era rimasta danneggiata e che quindi ha solo rallentano (e non fermato) la sua crescita, rendendolo così un bambino nel corpo di un giovane adulto. Insieme, i ThunderCats e i nativi della Terza Terra costruiscono la &quot;tana del gatto&quot;, la loro nuova casa e nuovo quartier generale, ma ben presto, i Mutanti li rintracciano anche sulla Terza Terra. L'intrusione di queste due razze aliene al mondo non passa inosservata, tuttavia - il demoniaco, stregone mummificato, Mumm-Ra, recluta i mutanti per aiutarlo nella sua campagna per conquistare l'Occhio di Thundera e distruggere i Thundercats in modo che il suo male possa continuare a dominare sulla Terza Terra.[5]\r\nSecondo quanto scritto nel primo capitolo dei fumetti pubblicati dalla Wildstorm Thundercats Origins: Heroes and Villains, la Terza Terra è in realtà proprio la Terra in un futuro alternativo. Mumm-Ra proviene dall'antico Egitto, dove secoli prima si rese schiavo degli antichi spiriti del male per ottenere il suo tremendo potere e la conoscenza dell'universo. Mumm-ra è apparentemente anche il responsabile della distruzione della razza umana, avvenuta dopo essere stato involontariamente liberato dalla camera funeraria della piramide Onyx, dove il figlio di un faraone l'aveva imprigionato. \r\n\r\nRELEASE ORIGINAL FOR MORE INFO\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=417129","torrent":{"xt":"urn:btih:e52846c7a9301c787bb6b984eec0fd6bdf4d3b29","amp;dn":"Thundercats+S01e01-07%2C+%5BMux+-+XviD+-+Ita+Mp3%5D+serie+classica","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e52846c7a9301c787bb6b984eec0fd6bdf4d3b29","infoHashBuffer":{"type":"Buffer","data":[229,40,70,199,169,48,28,120,123,182,185,132,238,192,253,107,223,77,59,41]},"announce":[],"urlList":[]}}