{"title":"Colorants for Non-Textile Applications","uid":14698627,"size":31117705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e57e121d3e6adc1110081d2cc61a4022233c8e9e&amp;dn=Colorants+for+Non-Textile+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1464275684,"description":"Colorants for Non-Textile Applications - H.S. Freeman and A.T. Peters (Elsevier, 2000).pdf\r\n\r\nISBN 0-444-82888-5\r\n\r\nThis volume examines the chemistry of natural and synthetic dyes produced for non-textile markets, where much new basic research in color chemistry is now taking place.\r\nThe first group of chapters covers the design, synthesis, properties and application technology pertaining to dyes for digital printing and photography. The reader will be pleased with the breadth and depth of information presented in each case. Of particular interest is the discussion of strategies for the design of dyes in these categories, with emphasis on enhancing technical properties. In view of certain new developments, the ink-jet chapter includes results from studies pertaining to dyes for textiles.\r\nThe three chapters comprising Section II of this volume cover the broad subject of dyes for food, drug and cosmetic applications and then provide an in-depth look at dyes for biomedical applications and molecular recognition. The chapter on dyes for molecular recognition places emphasis on applications in the biological sciences, including sensory materials and artificial receptors. While the former two topics have been covered elsewhere in the past, the present chapters are unequalled in scope.\r\nSection III provides an in-depth review of the design of laser dyes and dye-based functional materials. In the first of the two chapters, the major principles of laser operation are summarized. This is followed by a discussion of spectroscopic properties, such as activation and deactivation of absorbed light by laser dyes. Approaches to the development of new laser dyes are presented. The second chapter pertains to the synthesis of dicyanopyrazine-based multifunctional dyes. The visible and fluorescence spectra of these dyes in solution and the solid state are correlated with their three-dimensional molecular structures. Molecular stacking behavior and solid state properties of these &quot;multifunctional&quot; dye materials are presented.\r\nThe final group of chapters pertains to natural dyes and dyes for natural substrates. In recent years, the impression among certain consumers that &quot;natural&quot; is better/safer has generated much interest in the use of natural dyes rather than synthetics. This has led to a few short discussion papers in which the environmental advantages to using natural dyes have been questioned. The initial chapter in this group provides both a historical look at natural dyes and a comprehensive compilation of natural dye structures and their sources. Though natural dyes are of interest as colorants for textiles, selected ones are used primarily in food and cosmetics.\r\nChapter ten provides an update on the author's previous reviews of structure-color-relationships among precursors employed in the coloration of hair. Chemical constitutions characterizing hair dye structures are presented, along with a summary of available precursors and their environmental properties. Similarly, the chapter on leather dyes covers constitutions and nomenclature, in addition to providing interesting perspectives on the origin and use of leather, the dyeing of leather, and key environmental issues.\r\nThis volume is concluded with another look at colors in nature. In this case, rather than revisiting colors in plant life, an interesting chapter dealing with color in the absence of colorants is presented. Chapter twelve covers basic concepts of color science and illustrates how 3-D assemblies leading to a plethora of colors are handled in nature. It is our hope that this atypical &quot;color chemistry&quot; chapter will invoke ideas that lead to the design of useful colorants.\r\nThe chapters presented in this volume demonstrate that color chemistry still has much to offer individuals with inquiring minds who are searching for a career path. This work highlights the creativity of today's color chemists and the wide variety of interesting non-textile areas from which a career can be launched","torrent":{"xt":"urn:btih:e57e121d3e6adc1110081d2cc61a4022233c8e9e","amp;dn":"Colorants+for+Non-Textile+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e57e121d3e6adc1110081d2cc61a4022233c8e9e","infoHashBuffer":{"type":"Buffer","data":[229,126,18,29,62,106,220,17,16,8,29,44,198,26,64,34,35,60,142,158]},"announce":[],"urlList":[]}}