{"title":"Rush Limbaugh - June 21, 2016 Full Podcast.mp3","uid":15031843,"size":97625592,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e772e4d0167aaf042bc7be5123e8284fff4dc2d7&amp;dn=Rush+Limbaugh+-+June+21%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1466554244,"description":"Rush Limbaugh - June 21, 2016 Full Podcast\r\n\r\nThe Best Explanation of Brexit You'll Get\r\n\r\nRUSH:  You know, we haven't talked about it on this program, the Brexit vote which is coming up Thursday.  This is a vote in Great Britain to exit the European Union.  And, folks, this thing is a microcosm for things happening in this country.  The people of Great Britain across party lines want out of the European Union, and the elites in Great Britain and the elites in the European Union do not. \r\n\r\nDemocrats and Drive-Bys Are Concerned About the Closeness of This Race\r\n\r\nRUSH: There's a degree of panic and concern on the Democrat side about Trump versus Hillary.  And I have the telltale signs to back that up.  They've got this CNN poll out there, and they're not happy about it.  Now, the Drive-Bys are trying to present it as though it is just wonderful news for Hillary, but it isn't. When you factor everything in, it is not good news... Then they go to the Republican side and they see that there's a near mutiny in there at the convention. They're still plotting ways to overthrow Trump.  Given that, Hillary ought to be up 70-30, and she's barely up above the margin of error -- and, in certain areas of the CNN/ORC poll, Trump is cleaning her clock.  This poll is not satisfying.  It is not uplifting.  It is not pleasing to the Democrats\r\n\r\nHillary's Outrageous Anti-Trump Economic Speech Is Easily Rebuked\r\n\r\nRUSH: Hillary Clinton ought to be the equivalent of a sitting duck in this campaign.  If anybody on the Republican/Trump side would just go into this with a little confidence instead of being afraid of her.... She's a walking contradiction.  She's not a good campaigner.  She's not a good candidate...  Trump has been tweeting all during the Hillary speech.  Trump is his own rapid response team.  He doesn't need a campaign manager to do this stuff.  Well, I say that; I'm looking at some of these tweets and they're okay, but they could be better.  They could be better.  Somebody should have been tweeting what I was saying.  \r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:e772e4d0167aaf042bc7be5123e8284fff4dc2d7","amp;dn":"Rush+Limbaugh+-+June+21%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e772e4d0167aaf042bc7be5123e8284fff4dc2d7","infoHashBuffer":{"type":"Buffer","data":[231,114,228,208,22,122,175,4,43,199,190,81,35,232,40,79,255,77,194,215]},"announce":[],"urlList":[]}}