{"title":"Final Fantasy IX v1.0.5","uid":14722605,"size":1835141296,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:e96e8c793564957d1ee1dbd0c6b6f7425e99679f&amp;dn=Final+Fantasy+IX+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Novacchi","files":3,"time":1464523232,"description":"Final Fantasy For Android IX v1.0.5 \r\nRequirements: 4.1+\r\nOverview: Due to the size of the application, the download may take a considerable amount of time to complete. The app uses 3.2GB of space. When downloading the game for the first time, you must have more than 4GB of space available on your device. Version updates for the app will use more than 4GB of space. Please ensure that there is plenty of space available on your device before downloading.\r\n\r\nSelling over five million copies since its release in 2000, Final Fantasy IX proudly returns on Android!\r\nNow you can relive the adventures of Zidane and his crew in the palm of your hands!\r\n\r\nEnjoy this classic Final Fantasy experience with no additional fees or purchases.\r\n\r\n■Story\r\nZidane and the Tantalus Theater Troupe have kidnapped Princess Garnet, the heir of Alexandria. \r\nTo their surprise, however, the princess herself yearned to escape the castle. \r\nThrough a series of unusual circumstances, she and her personal guard, Steiner, fall in with Zidane and set out on an incredible journey.\r\nMeeting unforgettable characters like Vivi and Quina along the way, they learn about themselves, the secrets of the Crystal, and a malevolent force that threatens to destroy their world.\r\n\r\n■Gameplay Features\r\n・Abilities\r\nLearn new abilities by equipping items. \r\nWhen fully mastered, these abilities can be used even without equipping items, allowing for nearly endless customization options.\r\n\r\n・Trance\r\nFill your Trance gauge as you sustain hits in battle. \r\nWhen fully charged, your characters will enter Trance mode, granting them powerful new skills!\r\n\r\n・Synthesis\r\nNever let items go to waste. Combine two items or pieces of equipment together and make better, stronger items!\r\n\r\n・Minigames\r\nWhether it's Chocobo Hot and Cold, Jump Rope, or Tetra Master, there are plenty of minigames to enjoy when you're not off saving the world. \r\nYou can even earn special item rewards!\r\n\r\n■Additional Features\r\n・Achievements\r\n・7 game boosters including high speed and no encounter modes.\r\n・Autosave\r\n・High-definition movies and character models.\r\n\r\n■Operating System\r\n\r\nAndroid 4.1 or later\r\n\r\nWHAT'S NEW\r\n- Bug where certain options cause the Magic Stone stat growth bonus to be reset now fixed.\r\n- Bug where the max level Magic Stone booster induces no stat growth bonus now fixed. (Equipment bonuses do not apply.)\r\n- Virtual game pad now responds beyond the in-game screen.\r\n- Now playable on Zenfone 2 devices.\r\n- Other bugs fixed","torrent":{"xt":"urn:btih:e96e8c793564957d1ee1dbd0c6b6f7425e99679f","amp;dn":"Final+Fantasy+IX+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e96e8c793564957d1ee1dbd0c6b6f7425e99679f","infoHashBuffer":{"type":"Buffer","data":[233,110,140,121,53,100,149,125,30,225,219,208,198,182,247,66,94,153,103,159]},"announce":[],"urlList":[]}}