{"title":"Flocksdale Files Series - Carissa Ann Lynch","uid":13142257,"size":1449154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb39f284059c6db60417b94428a2680cb706ab3c&amp;dn=Flocksdale+Files+Series+-+Carissa+Ann+Lynch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1451995439,"description":"01. Have You Seen This Girl [Flocksdale Files, #01] - Carissa Ann Lynch\r\n\r\n\r\n\r\nWendi Wise is a troubled young woman who snorts her breakfast through a straw and spends more time in rehab than in the real world…\r\n\r\nHer life is seemingly out of control.\r\n\r\nBut now she has a plan.\r\n\r\nThat plan involves a sharp set of butcher knives.\r\n\r\nShe's going back to where all of her troubles began…\r\n\r\nFlocksdale.\r\n\r\nWendi was lured away from a local skating rink, at the age of thirteen, and held captive in a place she calls 'The House of Horrors.' Dumped off blindfolded on the side of a dirt road, Wendi soon discovered that she was addicted to the drugs they fed her while she was captive.\r\n\r\nToo scared to go home, and having a new habit to deal with, she hopped on a bus, vanishing from the family she loved.\r\n\r\nVanishing from Flocksdale…\r\n\r\nThe town of Flocksdale is littered with fliers with a grainy image of young Wendi, and the words 'Have You Seen This Girl?' written below.\r\n\r\nNow, eight years later, she's on a mission—a mission to find the mysterious house from her youth and the monsters who dwell inside it.\r\n\r\n\r\n\r\n02. House of the Lost Girls [Flocksdale Files, #02] - Carissa Ann Lynch\r\n\r\n\r\n\r\nSeventeen-year-old Marianna Bertagnoli is miserable…\r\n\r\nNot only did her father abandon her five years ago, now she’s being uprooted and forced to move with her mother and new stepdad to a creepy Victorian house they inherited in the even creepier town of Flocksdale.\r\n\r\nFlocksdale has an evil, ugly past—and history has a way of repeating itself…\r\n\r\nMarianna notices some strange qualities about her new home, and soon realizes she’s living in none other than the infamous House of Horrors. That’s right, the very house where the demented Garrett family ran a drug ring, leading to the kidnappings and murders of forty young girls.\r\n\r\nThe dark energy of the town begins to rise again…\r\n\r\nWithin a week of moving in, Marianna’s mother disappears, one of her small group of new friends is found murdered, and she’s attacked by a man wearing a hideous clown mask. As she searches for answers, Marianna wonders if the malevolence still lingers, somehow alive…and how her stepdad came to own the House of Horrors.\r\n\r\nUnsure who to trust, Marianna turns to Wendi Wise, a survivor of the Garretts’ crimes…\r\n\r\nCaught up in twisted family ties and surrounded by deceit, Marianna is targeted by a new generation of evil. Doubly imprisoned—in her own body and in the real house of the lost girls—Marianna needs Wendi’s help to unravel the bizarre history of Flocksdale.\r\n\r\nBut will Marianna survive long enough to bring the evil to light?\r\n\r\nOr will she be trapped in the house of the lost girls forever?","torrent":{"xt":"urn:btih:eb39f284059c6db60417b94428a2680cb706ab3c","amp;dn":"Flocksdale+Files+Series+-+Carissa+Ann+Lynch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb39f284059c6db60417b94428a2680cb706ab3c","infoHashBuffer":{"type":"Buffer","data":[235,57,242,132,5,156,109,182,4,23,185,68,40,162,104,12,183,6,171,60]},"announce":[],"urlList":[]}}