{"title":"Need for Speed™ No Limits v1.2.6 (tegra) apk + data","uid":13260844,"size":893977031,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ecd44af7cf72858e4a8bbb70f2b4c42833715d82&amp;dn=Need+for+Speed%26trade%3B+No+Limits+v1.2.6+%28tegra%29+apk+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":3,"time":1453272701,"description":"Race for dominance in the first white-knuckle edition of Need for Speed made just for mobile – from the developer that brought you Real Racing 3. Build your dream ride with an unbelievable range of cars and customizations. Launch yourself between chaos and control as you hit the loud pedal and roll into underground car culture. Win races, up your rep, then kick into more races, more customizations, and more cars. Make your choices and never look back. Tonight we ride!\r\nThis app offers in app purchases. You may disable in app purchases using your device settings.\r\n\r\nCUSTOMIZE EXTREME RIDES\r\nPick up the real-world cars you’ve always wanted, from the Subaru BRZ to the BMW M4, McLaren 650s, Porsche 911, and more. Then trick them out with the hottest customization system on mobile, from spots like the Mod Shop and the Black Market, giving you over 2.5 million custom combos to play with. Your rides are waiting – take them to the stages or streets to go head-to-head versus the competition and prove yourself.\r\n\r\nDRIVE FAST – AND FEARLESS\r\nSteer onto the streets of Blackridge, driving reckless and juiced as sparks fly. Accelerate over jumps and around debris, into traffic, against walls, and through high-speed Nitro Zones. Flip on the nitrous and thrust yourself into another level of adrenaline-fueled driving and drifting. Around every corner is a fresh race as you clash with local crews and local cops. It’s a world full of wannabe drivers – can you stay in front and earn respect?\r\n\r\nRACE TO WIN\r\nNever back down as you race anyone crazy enough to take you on, leave them gapped, and increase your rep. Dig, drift, drag, and roll your ride to wins with police on your tail, hitting each inch of the map hard by the time you reach the big end. Burn rubber in over 1,000 challenging races – and that’s just the starting line. Be notorious, own the streets, and score the world’s best cars. Because one ride is never enough!\r\n\r\nWhat’s new:\r\nGet your garage ready! The latest update will have you tuning, upgrading and competing to build the ultimate rides for your collection.\r\n• Tuner Trials – Earn Materials and Conversion Kits for specific parts with this new daily competition! Build up your garage to gain access to guaranteed Rare and Legendary Materials.\r\n• New Tournament Car – Dodge Charger R/T 1969\r\n• Bonus Gold – Receive bonus gold for first time purchases!\r\n\r\nThis app: requires a persistent Internet connection (network fees may apply)\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequirements: Android 4.0.3+","torrent":{"xt":"urn:btih:ecd44af7cf72858e4a8bbb70f2b4c42833715d82","amp;dn":"Need+for+Speed%26trade%3B+No+Limits+v1.2.6+%28tegra%29+apk+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd44af7cf72858e4a8bbb70f2b4c42833715d82","infoHashBuffer":{"type":"Buffer","data":[236,212,74,247,207,114,133,142,74,139,187,112,242,180,196,40,51,113,93,130]},"announce":[],"urlList":[]}}