{"title":"All Guns On Deck v0.4.250","uid":13097296,"size":160242336,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1477267c8e8dd75401a5b0b08e756eb6c566bd9&amp;dn=All+Guns+On+Deck+v0.4.250&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1451155976,"description":"The vast horizons are full of pirates, vagabonds with no claim to the ground their feet tread. Amongst the bandits scattered across the oceans, four factions dominate the worlds main landmasses. Eutopia's conquest will be the force that rids the world of its calamity. Making way for a new era of prosperity, with all continents under one banner.\r\n\r\nIn a world where sea battles are the punch line of jokes uttered by historians, the generals of Eutopia focus their efforts on reviving the lost art of ship building to aid in the campaign against aerially superior foes. Hiring small bands of mercenaries to take to the seas and launch a global attack on all fronts from beneath the skies. Though, as men once again set sail, the ocean reminds why the depths were abandoned all those years ago.\r\n\r\nAll Guns On Deck is a strategy, real time tactics action rpg, naval combat game with a unique battle system and unforgiving world to conquer. Players find themselves in the boots of a naive young sea captain, eager to take to the waves in support of the war effort of his great nation","torrent":{"xt":"urn:btih:f1477267c8e8dd75401a5b0b08e756eb6c566bd9","amp;dn":"All+Guns+On+Deck+v0.4.250","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1477267c8e8dd75401a5b0b08e756eb6c566bd9","infoHashBuffer":{"type":"Buffer","data":[241,71,114,103,200,232,221,117,64,26,91,11,8,231,86,235,108,86,107,217]},"announce":[],"urlList":[]}}