{"title":"The Reason You Walk - Wab Kinew","uid":13389478,"size":1284637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f22ee62a018cd0e5848a79a37aaf433c9697a691&amp;dn=The+Reason+You+Walk+-+Wab+Kinew&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"i41agree","files":1,"time":1454322759,"description":"The Reason You Walk: A Memoir\r\nWab Kinew\r\nSeptember 29, 2015\r\nPenguin\r\nISBN\r\n9780143193562\r\n\r\nGenres\r\nBiographies &amp; Memoirs\r\nEntertainment &amp; Performing Arts\r\nGeneral\r\nNative Americans\r\nPersonal Memoirs\r\nBiography &amp; Autobiography / Entertainment &amp; Performing Arts\r\nBiography &amp; Autobiography / General\r\nBiography &amp; Autobiography / Native Americans\r\nBiography &amp; Autobiography / Personal Memoirs\r\n\r\n\r\nA moving story of father-son reconciliation told by a charismatic aboriginal star\r\n\r\nWhen his father was given a diagnosis of terminal cancer, Winnipeg broadcaster and musician Wab Kinew decided to spend a year reconnecting with the accomplished but distant aboriginal man who’d raised him. The Reason You Walk spans that 2012 year, chronicling painful moments in the past and celebrating renewed hopes and dreams for the future.  As Kinew revisits his own childhood in Winnipeg and on a reserve in Northern Ontario, he learns more about his father's traumatic childhood at residential school. \r\n\r\nAn intriguing doubleness marks The Reason You Walk, itself a reference to an Anishinaabe ceremonial song.  Born to an Anishinaabe father and a non-native mother, he has a foot in both cultures. He is a Sundancer, an academic, a former rapper, a hereditary chief and an urban activist. His father, Tobasonakwut, was both a beloved traditional chief and a respected elected leader who engaged directly with Ottawa. Internally divided, his father embraced both traditional native religion and Catholicism, the religion that was inculcated into him at the residential school where he was physically and sexually abused. In a grand gesture of reconciliation, Kinew's father invited the Roman Catholic bishop of Winnipeg to a Sundance ceremony in which he adopted him as his brother. \r\n\r\nKinew writes affectingly of his own struggles in his twenties to find the right path, eventually giving up a self-destructive lifestyle to passionately pursue music and martial arts. From his unique vantage point, he offers an inside view of what it means to be an educated aboriginal living in a country that is just beginning to wake up to its aboriginal history and living presence. \r\n\r\nInvoking hope, healing and forgiveness, The Reason You Walk is a poignant story of a towering but damaged father and his son as they embark on a journey to repair their family bond. By turns lighthearted and solemn, Kinew gives us an inspiring vision for family and cross-cultural reconciliation, and for a wider conversation about the future of aboriginal peoples","torrent":{"xt":"urn:btih:f22ee62a018cd0e5848a79a37aaf433c9697a691","amp;dn":"The+Reason+You+Walk+-+Wab+Kinew","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f22ee62a018cd0e5848a79a37aaf433c9697a691","infoHashBuffer":{"type":"Buffer","data":[242,46,230,42,1,140,208,229,132,138,121,163,122,175,67,60,150,151,166,145]},"announce":[],"urlList":[]}}