{"title":"RedJack - Revenge of the Brethren [1998][PC]","uid":13209635,"size":1862908674,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2687bf17369e2c9dab9207f0f387a318966cd32&amp;dn=RedJack+-+Revenge+of+the+Brethren+%5B1998%5D%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Iznogoud9","files":10,"time":1452631839,"description":"RedJack: Revenge of the Brethren (1998) [PC]\r\n\r\nRedjack: Revenge of the Brethren is an action-adventure video \r\ngame developed by Cyberflix and GTE Entertainment, and released \r\nby THQ in 1998.\r\n\r\nRedjack had several different engines implemented into the game, \r\nthe main engine was rotatory 3D engine, used for the main exploration \r\nand adventure. When the character gets into a fight, the game loads \r\na new engine for fighting characters, generally one-on-one. There are \r\nalso different screens, such as when concocting a volatile drink, \r\nshooting from a canon on a speeding cart on tracks, figuring out a color \r\nsystem to make a pair of doors open, and several others.\r\n\r\nYou play a young blond-haired man named Nicholas Dove who inhabits Lizard \r\nPoint. You are being pressured by many people who are close to you to make \r\nsomething of yourself and you decide to join a pirate crew in order to make \r\nyour living. You meet a pirate named Lyle who tells you that the captain is \r\nhiring men because he lost some in an &quot;accident&quot;, Lyle also saves you from \r\nsome cutthroat assassins. Captain Justice only hires those that are generally \r\nbrave enough to form his crew and dares you to kill a shark and it is a must \r\nto be able to fight. After killing the shark and finding a sword and learning \r\nto fight from the drunken pirate Lyle, you may return to him and join the crew.\r\n\r\nSo.... arrrrr, pirate mateys! You be wantin' to go on some piratey\r\nadventure? Then you be needin' to download this game an' play it!\r\n\r\nRequirements:\r\n\r\nWindows 95: Pentium 133 or better (P200 recommended), 16MB RAM (32MB recommended), \r\n70MB hard drive space (250MB recommended), 4x or better CD-ROM drive, DirectDraw \r\ncompatible graphics.\r\n\r\nMacintosh: 601-604 processor (G3 recommended), Sys 7.1 and up, 24MB of RAM \r\n(32MB recommended), 70MB hard drive space (250MB recommended), 4x or better \r\nCD-ROM drive.\r\n\r\nIMPORTANT NOTES:\r\n\r\n* This game is from a time when practically nobody had a cd burner. There is \r\nno copy protection, so there's no need for a crack. You can either make physical \r\ncopies of the disc images or mount them on a virtual drive for installing and \r\nplaying.\r\n\r\n* To install the game, go to the folder 'Install' on Disc 1 and run 'SETUP.EXE'\r\n\r\n* To run the game, run Redjack.exe from the installation directory\r\n\r\n* Run the game in a compatibility mode for Windows 95 or Windows 98/ME - otherwise \r\nit will crash when trying to save game.\r\n\r\n* The game reads its data directly from discs (it's not copied to the hard drive \r\nduring the installation). When you start the game, you must have a disc in a drive or \r\na disc image mounted. I sort of tested that the game is playable from a mounted disc \r\nimage, but I didn't test what happens when you need to swap discs later in the game. \r\nI would assume that alt-tabbing out of the game and mounting the next image, then \r\nalt-tabbing back to the game should work.\r\n\r\n* Tested on a Windows 7 64 bit computer. I honestly don't know whether it would work \r\non Windows 8/Windows 10. \r\n\r\n* The game is supposedly playable on MAC OS as well, but I don't know if that includes \r\nmodern MACs as well","torrent":{"xt":"urn:btih:f2687bf17369e2c9dab9207f0f387a318966cd32","amp;dn":"RedJack+-+Revenge+of+the+Brethren+%5B1998%5D%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2687bf17369e2c9dab9207f0f387a318966cd32","infoHashBuffer":{"type":"Buffer","data":[242,104,123,241,115,105,226,201,218,185,32,127,15,56,122,49,137,102,205,50]},"announce":[],"urlList":[]}}