{"title":"Rush Limbaugh - June 13, 2016 Full Podcast.mp3","uid":14914642,"size":270412414,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f3126ebe3d0a04e3af4266fe068e007d0bd2ba66&amp;dn=Rush+Limbaugh+-+June+13%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1465877528,"description":"Rush Limbaugh - June 13, 2016 Full Podcast \r\nMark Steyn filled in for Rush on Monday. Check out Mark's Stack for links, audio clips and more. \r\n\r\nThe Party at the End of the World\r\n\r\nOn Monday I started the week guest-hosting for Rush on America's Number One radio show. The slaughter in Orlando dominated the three hours, although I did find room to relate it to Mitt Romney's Blofeld routine at the GOP Spectre board meeting in Utah this weekend. I started with the good news:\r\n\r\n    So far there's been no sign of that self-promoting opportunist twerp who drags his piano to the scenes of jihadist slaughter in Europe and plays 'Imagine'. And so far, as far as I'm aware, Barack Obama, Hillary Clinton and John Kerry have not actually insisted, unlike on previous occasions, that that big pile of corpses is 'nothing to do with Islam'.\r\n\r\nOther than that, the consolations are few:\r\n \nhttp://www.steynonline.com/7543/the-party-at-the-end-of-the-world\r\n\r\n    A Muslim of Afghan heritage guns down 49 gays in a nightclub, and the ACLU tells us it's the fault of the Christian right. We are being told up is down, the sky is the earth, black is white...\r\n\r\nI began by noting some of the differences between the international headlines (heavy on ISIS and terror) and the US headlines (heavy on &quot;hate&quot; and &quot;domestic extremism&quot;). As Chris Pandolfo reported at Conservative Review:\r\n\r\n    Mark Steyn... said that the &quot;official lie&quot; of the Left is that gun-toting &quot;right&quot; wing extremists are responsible for the shooting and radical Islamic terrorism is not... The Left doesn't know how to cope with the &quot;internal contradictions of the rainbow coalition.&quot;\r\n\r\n\r\n\r\n&quot;A Muslim of Afghan heritage guns down 49 gays in a nightclub, and the ACLU tells us it's the fault of the Christian right. We are being told up is down, the sky is the earth, black is white. If this shooting in Orlando can be the fault of the Christian right, then there is no reality.&quot; -Mark Steyn\r\n\r\nMark Steyn is a Canadian author, writer, journalist, and conservative political commentator. He has written five books, including America Alone: The End of the World As We Know It, a New York Times bestseller. Wikipedia\r\nBorn: December 8, 1959 (age 56), Toronto, Canada\r\nEducation: King Edward's School, Birmingham\r\n \nhttp://www.rushlimbaugh.com/","torrent":{"xt":"urn:btih:f3126ebe3d0a04e3af4266fe068e007d0bd2ba66","amp;dn":"Rush+Limbaugh+-+June+13%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3126ebe3d0a04e3af4266fe068e007d0bd2ba66","infoHashBuffer":{"type":"Buffer","data":[243,18,110,190,61,10,4,227,175,66,102,254,6,142,0,125,11,210,186,102]},"announce":[],"urlList":[]}}