{"title":"My.Kitchen.Rules.s07e03.WS.PDTV.x264.BF1.mkv","uid":13416592,"size":805712223,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f3811228538bd6afc3ad8d3aaa25f21822cb9806&amp;dn=My.Kitchen.Rules.s07e03.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigfish5","files":1,"time":1454502111,"description":"My Kitchen Rules 2016 Season 7 Episode 03\r\n\r\nThe teams have high expectations for Brisbane's cougar and cub, Cheryl and Matt. Will this odd couple be able to laugh their way through the pressure of the instant restaurant?\r\nCheryl and Matt QLD\r\nWe can laugh at any situation! \r\nHailing from Brisbane, sales/marketing manager Cheryl and student Matt are used to people misinterpreting their relationship. Mum-of-one Cheryl, 50, has been happily dating 26 year-old Matt for the past 18 months and says he won her over with his chicken Caesar salad.\r\nWhat do you think about being a ‘cougar’ Cheryl?\r\nWe want to say to everyone out there that age doesn’t matter. Why should a number make a difference about who you’re with, who you enjoy your time with and how you go through life. Society shouldn’t dictate that.\r\nMatt: Yeah it might seem weird but there’s 50 year-old men going out with 18 year-old women and that’s not frowned upon in society. What we’re doing is something that is showing that females have a right to do whatever they want and if we enjoy each other’s company, then it doesn’t matter.\r\nWhat’s your vibe like in the kitchen?\r\nMatt: When we’re 100 percent in sync we’re pretty good. I’m usually naked though!\r\nCheryl: We’re usually having a few drinks and listening to some music. Matt is pretty good at grabbing whatever is in the fridge and putting it all together. Being a student (he is studying HR), and having to make ends meet, he’s really good like that. He makes it taste so good and look so good. We laugh a lot.\r\nIs there a head chef?\r\nCheryl: Usually Matt is the head chef with all the savoury stuff, unless I’m in control mode.\r\nMatt: Then there’s no point in telling her what to do because she’ll do it her way anyway.\r\nMost used ingredients?\r\nMatt: Whatever is in season - there’s no point buying things out of season as it’s just not viable.\r\nHow do you cope under pressure?\r\nMatt: Usually we cope well if we’ve planned things out properly. I like to have an idea of how things are going to unfold.\r\nCheryl: He’s the calming influence on me. I don’t stress but I panic a little bit; I get a bit anxious. He’ll do something crazy like dance with me or say something stupid. Laughter always works for us; it gets us back on track.\r\nMatt: If I see she’s under pressure I always try to bring her out of it, then she forgets what happened.\r\nWhat are your hobbies other than cooking?\r\nCheryl: I go to the gym and play tennis and do a bit of gardening. We have a great veggie patch. We mainly have herbs but also beautiful tomatoes, shallots, kale and spinach. Matt’s dad has a veggie patch and he brings back sweet potato and turmeric when we cook.\r\nMatt: I like looking at the financial market and being up to date with what’s going on in the world.\r\nWhat do you see as your biggest strength in the competition?\r\nCheryl: We can laugh at any situation and think about it as a ‘glass half full’ opportunity and the two of us together are stronger than singly.\r\nWhat about your biggest weakness?\r\nMatt: It might be our laughter as well because sometimes we don’t seem to take things seriously. Because we have this front of being idiots, people look at us and think we’re not serious.\r\nAre you competitive people?\r\nCheryl: Both of us have swum competitively, but I was never at the level Matt was (he was the fastest breaststroker in Queensland as a teenager). But we are competitive people, even with each other.\r\nMatt: Yeah even if we’re driving separate cars we’ll try to beat each other back to the house","torrent":{"xt":"urn:btih:f3811228538bd6afc3ad8d3aaa25f21822cb9806","amp;dn":"My.Kitchen.Rules.s07e03.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3811228538bd6afc3ad8d3aaa25f21822cb9806","infoHashBuffer":{"type":"Buffer","data":[243,129,18,40,83,139,214,175,195,173,141,58,170,37,242,24,34,203,152,6]},"announce":[],"urlList":[]}}