{"title":"Jake Bible - Z-Burbia 2,4,5,6 Series bks","uid":13097896,"size":696383846,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f46282427a114eaa4ebfc3d974eadc3308ff2992&amp;dn=Jake+Bible+-+Z-Burbia+2%2C4%2C5%2C6+Series+bks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twocows","files":7,"time":1451163817,"description":"Parkway To Hell (Z-Burbia #2)\r\n\r\nThe Grove Park Inn. From the early 1900s right up to Z-Day, the Grove Park Inn was the place for the affluent to stay when vacationing in Asheville, NC. Everyone from F. Scott Fitzgerald to President Barak Obama stayed at the Grove Park. Artists, actors, diplomats, masters of industry, all called it a temporary home at one point or another. But that was before the zombie a.........\r\n\r\nCannibal Road (Z-Burbia #4)\r\n\r\nForced from their home of Asheville, North Carolina, Jace Stanford’s family, along with a convoy of suburbanites, misfits, criminals, and soldiers, must battle their way through the I-40 corridor of Eastern Tennessee.\r\nWhen they are separated from their friends and allies in Knoxville, the Stanfords have to rely on their skills as post-apocalyptic survivors to fight off the...........\r\n\r\nThe Bleeding Heartland (Z-Burbia #5)\r\n\r\nThe American Midwest- a bucolic ideal that hasn’t quite translated to the zombie apocalypse. Instead of open arms and welcoming faces, there are now open mouths and ravenous Zs. The blue collar drive to work hard is now a red-mouthed hunger for flesh.\r\nJace Stanford, as well as the remnants of the survivors of Whispering Pines, and the rag tag bunch of private military cont ...\r\n\r\nRocky Mountain Die (Z-Burbia, #6)\r\n\r\nFrom Asheville to Knoxville, Cannibal Road to the Tomb, Jace Stanford and the Whispering Pines survivors have been on the run and fighting for their lives non-stop.\r\nNow, with the plains to their backs, the crew are just steps from their destination: The Stronghold of Boulder, CO. All they have to do is make it through the nightmare that is Denver, CO. While running from th","torrent":{"xt":"urn:btih:f46282427a114eaa4ebfc3d974eadc3308ff2992","amp;dn":"Jake+Bible+-+Z-Burbia+2%2C4%2C5%2C6+Series+bks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46282427a114eaa4ebfc3d974eadc3308ff2992","infoHashBuffer":{"type":"Buffer","data":[244,98,130,66,122,17,78,170,78,191,195,217,116,234,220,51,8,255,41,146]},"announce":[],"urlList":[]}}