{"title":"Eternal Fighter Zero -Memorial-","uid":13070719,"size":284175265,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f4fd3535cb9f059db1878085b090ca8a598f5d5a&amp;dn=Eternal+Fighter+Zero+-Memorial-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"R-Hunter","files":1,"time":1450795792,"description":"Eternal Fighter ZERO (EFZ) is a fan-made 2D fighting game developed by Twilight Frontier(Tasofro). It uses characters originally created by the &quot;visual novel&quot; studio Key, including characters created while Key was still part of its parent company Tactics. Due to the popularity of the original material, the quality of the sprite work, and the sillyness of the concept, EFZ has gained a relatively large fan following. With every release came detailed feedback concerning bugs, balancing issues, and suggestions, which they would then then address in the next patch. Eternal Fighter ZERO -Memorial- is the last and final version in its long history of evolution. Behind the cute and wacky graphics lies an incredibly solid fighting engine and a well-balanced character roster that was born out of the efforts of the entire fan community.\r\nIn Eternal Fighter ZERO, there is no overlying storyline or reason for fighting; it is simply a dream battle between Key's most beloved female characters. The backgrounds are faithful renditions of important locations within the original games, and the entire soundtrack is based on remixed BGMs from the original games. As much as EFZ is based off characters from visual novels, many of the characters' moves and abilities are parodies from other fighting games, like Guilty Gear, Street Fighter, and The King of Fighters.\r\n\r\nGame Poster: \nhttp://imgur.com/sVeV5qH\r\n\r\nScreenshots: \nhttp://imgur.com/AvZNVzb - Select Screen \nhttp://imgur.com/diA8ygR - Gameplay\r\n\r\n\r\nOfficial Website: \nhttp://www.tasofro.net/ - Seems to be offline","torrent":{"xt":"urn:btih:f4fd3535cb9f059db1878085b090ca8a598f5d5a","amp;dn":"Eternal+Fighter+Zero+-Memorial-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4fd3535cb9f059db1878085b090ca8a598f5d5a","infoHashBuffer":{"type":"Buffer","data":[244,253,53,53,203,159,5,157,177,135,128,133,176,144,202,138,89,143,93,90]},"announce":[],"urlList":[]}}