{"title":"XenoShyft v1.6 (Expansions Unlocked)","uid":13175707,"size":400430822,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f57adf6736e4dedf5c3a130d5bb98216c2f7e792&amp;dn=XenoShyft+v1.6+%28Expansions+Unlocked%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1452285675,"description":"XenoShyft v1.6 Expansions Unlocked\r\n\r\nDefend against waves of horrific Hive beasts in this beautifully illustrated, base defense, deck-building game for 1 to 4 players!\r\n\r\nIn XenoShyft Onslaught players take on the role of a commander in the NorTec Corporation. You're tasked with defending your division of the NorTec base as wave after wave of horrific Hive beasts attempt to destroy the base and end NorTec's strip mining operation.\r\n\r\nGameplay Features\r\n\r\n1 - 4 players - Single player compatible, fully cooperative gameplay.\r\n\r\nStrong focus on coordination and strategic planning - to overcome the game's intense difficulty players will need to work together.\r\n\r\nBase-Defense with deck-building elements\r\n\r\nIncredible art - Illustrated by three amazing artists, XenoShyft features beautiful and consistent art. All of which creates one cohesive and frightening universe.\r\n\r\nInventive and exciting armor and weapon upgrade cards - You'll need to outfit your troops with the best equipment if you hope to survive.\r\n\r\nXenoshyft is a game for 1-4 players, with each player controlling one of the divisions of the Nortec military: The Science Labs, Med Bay, Armory, Weapon's Research, Barracks and Command Center. Each of these divisions represents one part of the overall Nortec base, and it is your job as Commander of these divisions to protect the base while its field operations are completed.\r\n\r\nYou and your teammates will have to work together to survive the continuous onslaught of horrors – the goal of the mission is not to wipe out these threats, it is merely to outlast them!\r\n\r\nSurvive through nine rounds of combat with these horrors and the base will have succeeded in its mission, and you and your allies will have survived to fight another day!\r\n\r\nThe hit Kickstarter boardgame, now available on mobile!\r\n\r\n&quot;One of the most fun co-op games I have played in a long time!&quot; - Tom Vasel (The Dice Tower)\r\n\r\n&quot;The enemies are just monstrous and difficult!&quot; - Rodney Smith (Watch it Played)\r\n\r\nWhat’s new:\r\nNEW CAMERA MODE\r\nYou can now turn on &quot;Static Camera&quot; in the Options menu to get a simplified mode of board navigation, nice for small screens!\r\nNEW FEATURES:\r\nStatic Camera mode\r\nYou can now review the board state after a game ends\r\nNew hints added to the loading screen\r\nMultiple instances of simultaneous damage should now be visible on cards\r\nFull patch notes always available here: \nhttp://www.coolminiornot.com/forums/forumdisplay.php?80-Xenoshyft-APP\r\n\r\nPlace data folder in SDCard/Android/Obb/ then Install APK (to pass validation) and play.\r\nRequires Android 4.0 and up","torrent":{"xt":"urn:btih:f57adf6736e4dedf5c3a130d5bb98216c2f7e792","amp;dn":"XenoShyft+v1.6+%28Expansions+Unlocked%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57adf6736e4dedf5c3a130d5bb98216c2f7e792","infoHashBuffer":{"type":"Buffer","data":[245,122,223,103,54,228,222,223,92,58,19,13,91,185,130,22,194,247,231,146]},"announce":[],"urlList":[]}}