{"title":"Food Biology Series [Updated at 2015.12.30]","uid":13263340,"size":29610107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6a7b5f82a5a0607133f9e861ec7faff8af583fc&amp;dn=Food+Biology+Series+%5BUpdated+at+2015.12.30%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":3,"time":1453310722,"description":"Series Editor: Ramesh C. Ray\r\nPublisher: CRC Press/Taylor &amp; Francis Group\r\n\r\nAbout the Series\r\n\r\nFood is the essential source of nutrients such as carbohydrates, proteins, fats, vitamins, and minerals, that provides energy for all living organisms to sustain life. A large part of the daily human efforts is concentrated on food production, processing, packaging and marketing, product development, preservation, storage, and ensuring food safety and quality. It is obvious therefore, our food supply chain can contain microorganisms that interact with the food, thereby interfering in the ecology of food substrates. The microbe- food interaction is mostly benefi cial (as in the case of many fermented foods such as cheese, butter, sausage, etc.), but in some cases it is detrimental (spoilage of food, mycotoxin, etc.). The series Food Biology aims at bringing all these aspects of microbe-food interactions in form of topical volumes, covering food microbiology, biochemistry, microbial ecology, food biotechnology, new food product developments with microbial interventions, mycology, food authenticity, food origin traceability, and food science and technology. Special emphasis is placed on including new molecular techniques in food biology research or on monitoring and assessing food safety and quality, as well as new interventions in biotechnological applications in food processing and development. The key topics include food fermentation, food safety and hygiene, microbial interventions in food processing and food additive development, molecular diagnostic methods in detecting food borne pathogens and food policy, etc. Leading international authorities with background in academia, research, industry and government will contribute or have contributed to the series either as authors or as editors. The series will be a useful reference resource base in food microbiology, biochemistry, biotechnology, food science and technology for researchers, teachers, students and food science and technology practitioners","torrent":{"xt":"urn:btih:f6a7b5f82a5a0607133f9e861ec7faff8af583fc","amp;dn":"Food+Biology+Series+%5BUpdated+at+2015.12.30%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a7b5f82a5a0607133f9e861ec7faff8af583fc","infoHashBuffer":{"type":"Buffer","data":[246,167,181,248,42,90,6,7,19,63,158,134,30,199,250,255,138,245,131,252]},"announce":[],"urlList":[]}}