{"title":"FemaleAgent - Alexis Crystal (Massage ending with sticky facial)","uid":13158969,"size":655844899,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f7f8962a2e6aa76fecf8dbf5ab6fc0d43a61b5b5&amp;dn=FemaleAgent+-+Alexis+Crystal+%28Massage+ending+with+sticky+facial%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SudoSu","files":1,"time":1452127518,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/tfSfo \nhttp://imgkiss.com/image/tfby0\r\n\r\nWhen this tall stud walked into my office I felt my pussy tingle as my eyes drank in his figure. What a handsome stud, this guy was not leaving the office until I had every inch of his cock inside me. We began the casting interview and he told me that he currently worked as a masseuse and I immediately saw my opportunity of how I was going to get this studs cock into my mouth. I feigned that I had some shoulder pain and would he be willing to give me a massage. He agreed and I unbuttoned my blouse top so he could have easy access to my bare skin. I squirmed with delight in my seat as his strong arms caressed and kneaded my shoulders. I ran my arms up his, complimenting him on how manly he was. I turned to him and told him that he had made me horny and he replied that he was too. I wasted no time in getting his cock out and stuffing it into my hot mouth. His length grew inside my mouth and we were both outrageously turned on. I had to have him now.\r\n\r\nHe began to fuck me from behind and his cock felt amazing. I wanted to see if he could lick pussy as good as he fucked and I sat on his face, engulfing his mouth with my pussy. I had an amazing orgasm as I ground down onto his face and I was weak with pleasure after it. Then, to my disappointment, I noticed his erection had gone. I wasn't having that and sensing it was my cameraman's presence that was putting him off I told him to leave the room. That did the trick and we continued to fuck in several positions, his stamina was amazing. Because I fancied him so much I had no problems cumming several time and in the end I was spent. I licked his balls from underneath, coaxing his cum out. It wasn't long before he shot thick ribbons of salty semen all over my face and tits. What a sticky facial I had just received, I always feel so naughty when a man cums on my face. \r\n\r\nMore exclusive porn at:  https://thepiratebay.ms/user/SudoSu/","torrent":{"xt":"urn:btih:f7f8962a2e6aa76fecf8dbf5ab6fc0d43a61b5b5","amp;dn":"FemaleAgent+-+Alexis+Crystal+%28Massage+ending+with+sticky+facial%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f8962a2e6aa76fecf8dbf5ab6fc0d43a61b5b5","infoHashBuffer":{"type":"Buffer","data":[247,248,150,42,46,106,167,111,236,248,219,245,171,111,192,212,58,97,181,181]},"announce":[],"urlList":[]}}