{"title":"Comprehensive Inorganic Chemistry [I &amp; II]","uid":13416601,"size":1510503241,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8a9a89a6cb58da62d73b1439f9e22d5ddcfe201&amp;dn=Comprehensive+Inorganic+Chemistry+%5BI+%26amp%3B+II%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":7,"time":1454502341,"description":"(description from\nComprehensive Inorganic Chemistry II reviews and examines topics of relevance to today’s inorganic chemists. Covering more interdisciplinary and high impact areas, Comprehensive Inorganic Chemistry II includes biological inorganic chemistry, solid state chemistry, materials chemistry, and nanoscience. The work is designed to follow on, with a different viewpoint and format, from our 1973 work, Comprehensive Inorganic Chemistry, edited by Bailar, Emeléus, Nyholm, and Trotman-Dickenson, which has received over 2,000 citations. The new work will also complement other recent Elsevier works in this area, Comprehensive Coordination Chemistry and Comprehensive Organometallic Chemistry, to form a trio of works covering the whole of modern inorganic chemistry. Chapters are designed to provide a valuable, long-standing scientific resource for both advanced students new to an area and researchers who need further background or answers to a particular problem on the elements, their compounds, or applications. Chapters are written by teams of leading experts, under the guidance of the Volume Editors and the Editors-in-Chief. The articles are written at a level that allows undergraduate students to understand the material, while providing active researchers with a ready reference resource for information in the field. The chapters will not provide basic data on the elements, which is available from many sources (and the original work), but instead concentrate on applications of the elements and their compounds.\r\nProvides a comprehensive review which serves to put many advances in perspective and allows the reader to make connections to related fields, such as: biological inorganic chemistry, materials chemistry, solid state chemistry and nanoscience.\r\nInorganic chemistry is rapidly developing, which brings about the need for a reference resource such as this that summarise recent developments and simultaneously provide background information.\r\nForms the new definitive source for researchers interested in elements and their applications; completely replacing the highly cited first edition, which published in 1973","torrent":{"xt":"urn:btih:f8a9a89a6cb58da62d73b1439f9e22d5ddcfe201","amp;dn":"Comprehensive+Inorganic+Chemistry+%5BI+%26amp%3B+II%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a9a89a6cb58da62d73b1439f9e22d5ddcfe201","infoHashBuffer":{"type":"Buffer","data":[248,169,168,154,108,181,141,166,45,115,177,67,159,158,34,213,221,207,226,1]},"announce":[],"urlList":[]}}