{"title":"Introductory Mass Spectrometry 2nd ed - Stephen Shrader","uid":15059366,"size":8971824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9034466ded1cab62f92d0f3a68dd0822d0d4012&amp;dn=Introductory+Mass+Spectrometry+2nd+ed+-+Stephen+Shrader&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1466749337,"description":"Introductory Mass Spectrometry 2nd ed - Stephen Shrader (CRC, 2014).pdf\r\n\r\nISBN 978-1-4665-9585-9\r\n\r\nMass spectrometry has played an integral part in the study of organic molecular structures for more than 50 years, offering significant information from small amounts of sample. The mass spectrum produced by electron impact ionization presents a pattern of peaks that can often give definitive structural information about an unknown compound. Introductory Mass Spectrometry, Second Edition guides readers in the understanding and recognition of those patterns, discussing mass spectra in terms that are familiar to chemists. It provides a basis for chemists to interpret mass spectra to solve particular structural problems.\r\n\r\nThe Second Edition has been updated with modern techniques and data handling. Beginning with an introduction to the principles and instrumentation, it then sequentially explains the processes that occur in the mass spectrometer following ionization. The book is unique in the large number of mass spectra presented and provides examples of mass spectra from a wide variety of organic chemicals, concentrating on the relationships between fragmentation patterns, common chemical reactions, and chemical structures. The book also discusses mass spectra obtained with softer ionization techniques, which provide definitive information regarding molecular weights.\r\n\r\nThe text describes mass spectra produced by electron ionization, discussing how the spectral peak pattern relates to molecular structure. It details the use of high-resolution and accurate mass measurement to determine elemental composition of ions in order to identify unknown substances. The book also introduces some of the recent techniques that can be employed to extend the usefulness of mass spectrometry to high molecular weight substances and more polar substances. It includes examples and problems representing a cross section of organic chemistry to help readers integrate the principles presented","torrent":{"xt":"urn:btih:f9034466ded1cab62f92d0f3a68dd0822d0d4012","amp;dn":"Introductory+Mass+Spectrometry+2nd+ed+-+Stephen+Shrader","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9034466ded1cab62f92d0f3a68dd0822d0d4012","infoHashBuffer":{"type":"Buffer","data":[249,3,68,102,222,209,202,182,47,146,208,243,166,141,208,130,45,13,64,18]},"announce":[],"urlList":[]}}