{"title":"BBC Later Live with Jools Holland S48E06 1080i HDTV h264-NX","uid":14686817,"size":1365098644,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fad0620ed92323993f8a6703ced5138b7c0887e3&amp;dn=BBC+Later+Live+with+Jools+Holland+S48E06+1080i+HDTV+h264-NX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BasilBrush","files":1,"time":1464142019,"description":"BBC Later Live with Jools Holland S48E06 1080i HDTV h264-NX.ts\r\n\r\nBroadcast date: 24th May 2016\r\n\r\nJoining Jools on the sixth show are the Last Shadow Puppets. They perform tracks from their second LP in eight years, the chart-topping Everything You've Come to Expect, whilst no doubt working a sharp suit or two.\r\n\r\nBonnie Raitt returns to the show to run through some of the songs from her recently released twentieth album Dig in Deep. In addition to originals, Raitt has recorded material by some of her favourite working songwriters, and a couple of knock-out covers. Dig in Deep features a healthy dose of the signature slide work from the woman Rolling Stone named one of the 100 greatest guitarists of all time.\r\n\r\nMalian kora player Ballake Sissoko and French cellist Vincent Segal have pulled two seemingly incompatible instruments together, melding Sissoko's traditional playing with Segal's trip hop-infused approach to the classical cello to great effect on their second album together.\r\n\r\nNAO makes her TV debut with her neo-soul, electro and R&amp;B sound that has already seen her nominated for a MOBO award. Another act making their debut on the show are Dinosaur Jr. They earned themselves a reputation as one of the formative influences on US alt-rock in the 80s and early 90s before splitting in 1997. A reunion followed in 2005 and now the original line-up are making the trip to Maidstone, Kent, to play some new songs.\r\n\r\nCompleting the line-up is Zucchero, who in a career spanning more than three decades has sold over 50 million records around the world and is credited as the 'father of the Italian blues'. He performs a track at the piano from his recently released twelfth album Black Cat, his first full-length studio album in six years which sees him collaborate with producers such as T-Bone Burnett, Brendan O'Brien and Don Was.\r\n\r\nTechnical Spec\r\nVideo Codec: h264 CABAC   \r\nVideo Bitrate: 5566Kbps (Q~21)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 50i/MBAFF\r\nAudio Codec: AC3\r\nAudio Bitrate: 192Kbps CBR 48KHz\r\nAudio Channels: 2\r\nRun-Time: 30 mins\r\nNumber Of Parts: 1\r\nPart Size: 1.27 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:fad0620ed92323993f8a6703ced5138b7c0887e3","amp;dn":"BBC+Later+Live+with+Jools+Holland+S48E06+1080i+HDTV+h264-NX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fad0620ed92323993f8a6703ced5138b7c0887e3","infoHashBuffer":{"type":"Buffer","data":[250,208,98,14,217,35,35,153,63,138,103,3,206,213,19,139,124,8,135,227]},"announce":[],"urlList":[]}}