{"title":"Stars edited by Janis Ian, Mike Resnick","uid":13437365,"size":594603679,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb9e134e082f446eb7886f6d79f7aaf0936d66d2&amp;dn=Stars+edited+by+Janis+Ian%2C+Mike+Resnick&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cybotage","files":83,"time":1454668320,"description":"Original Stories Based on the Songs of Janis Ian\r\n\r\nStars is a huge anthology in both volume and talent. Each story, available only here, is based on a Janis Ian song that meant something special to the author, who then wrote the story expressly for Stars, creating a meld of jazz, prose, and science fiction found nowhere else.\r\n\r\nIan, who won the Grammy Award for spoken-word entertainment for Society's Child, joins the cast of this unique audiobook to narrate portions of Stars and also to perform the music that inspired each story.\r\n\r\nThis edition of Stars also features an original new story by Michael Swanwick, &quot;For I Have Lain Me Down on the Stone of Loneliness and I'll Not Be Back Again&quot;, based on &quot;Mary's Eyes&quot;, a Janis Ian song that has always moved him to tears.\r\n\r\nStars was compiled and edited by Mike Resnick and Janis Ian and includes stories by Nebula winners and such science fiction greats as Joe Haldeman, Jane Yolen, Gregory Benford, Orson Scott Card, and more. It also includes Ian's first original story, &quot;Prayerville&quot;.\r\n\r\nComplete list of writers: Kage Baker, Stephen Baxter, Terry Bisson, Gregory Benford, Orson Scott Card, Susan Casper, Diane Duane, Daid Gerrold, Joe Haldeman, Janis Ian, Kay Kenyon, Nancy Kress, Mercedes Lackey, Tanith Lee, Sharon Lee &amp; Steve Miller, Barry Malzberg, Susan Matthews, Mike Resnick, Kristine Katheryn Rusch, Robert J. Sawyer, Robert Sheckley, Dean Wesley Smith, Judith Tarr, Harry Turtledove, John Varley, Howard Waldrop, Tad Williams, Jane Yolen\r\n\r\n&quot;This dazzling, highly original anthology, ignited by the meeting of songwriter Ian and a host of SF writers affected by her music at the 2001 Worldcon, showcases 30 mostly superior stories, each based on one of her songs. Some contributors take Ian at her word that science fiction is 'the jazz of prose,' responding to many of society's sharpest wounds with bittersweet improvisatory descants, like Terry Bisson in 'Come Dance with Me,' David Gerrold in 'Riding Janis' and Orson Scott Card in 'Inventing Lovers on the Phone,' tales that probe the angst of adolescence… The entire anthology seems to vibrate with the death throes of one world passing away, while far stranger ones struggle to be born. Their commonality, Ian tells us in her introduction, is that 'They have heart. They have life. They have truth.' No artist - nor any reader - could ask for more.&quot; - Publisher's Weekly\r\n\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged\r\n\r\nEdited by Janis Ian and Mike Resnick","torrent":{"xt":"urn:btih:fb9e134e082f446eb7886f6d79f7aaf0936d66d2","amp;dn":"Stars+edited+by+Janis+Ian%2C+Mike+Resnick","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb9e134e082f446eb7886f6d79f7aaf0936d66d2","infoHashBuffer":{"type":"Buffer","data":[251,158,19,78,8,47,68,110,183,136,111,109,121,247,170,240,147,109,102,210]},"announce":[],"urlList":[]}}