{"title":"British &amp; Irish Literature part B - After 1950","uid":13266599,"size":69608494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff033b37a683b6a82a185d53ec0c45f20372d7ae&amp;dn=British+%26amp%3B+Irish+Literature+part+B+-+After+1950&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"whitecat2010","files":463,"time":1453342655,"description":"English (British) and Irish literature part B: from 1950 to our days\r\n====================================================================\r\n\r\nAbout the collection\r\n\r\nThis is my collection of English (British) and Irish literature (so no American authors and no foreign, translated authors)\r\nIt is divided into three sections: \r\nA: Past (from Medieval till the first decades of the 20th century)Basically the classics. It's here: https://thepiratebay.se/torrent/13266393 \r\nB (this one):Present (from 1950 onwards) and a separate section for \r\nC: Science Fiction, Fantasy and the like (you'll find Wells, Tolkien, Diana Wynne Jones, Neil Gaiman and J.K.Rowling there). \r\n\r\nThe books are mainly in .epub and .pdf, because I don't own a Kindle and I dislike the very idea of a proprietary format and ereader which binds you as its slave, in exchange for the low price. I usually go for ereaders which support the greatest number of formats. \r\n\r\nMy naming convention is different than found in collections that come from Calibre. I hate it when the books are by book title and not by author, because I want the books by the same author to be shown together even when they are not grouped in a folder.\r\n\r\nSources\r\n=======\r\n\r\nThese are not my own scans or OCR. They have been collected over many years from the web, either from huge messy book torrents containing a bit of everything or one by one from free download sites such as gutenberg, archive org and such; a bunch of them came with my various e-readers. \r\nMy only merit, then, is collecting and organizing them, but I assure you that it was quite a bit of work. I picked those which belong to this category from the chaos of most book torrents, or downloaded the free books one by one. Then I renamed them consistently to prune out doubles and make search easy. I’ve taken out meaningless folder numbers , deleted .opf and other useless files. In many cases I’ve added a .txt file with info about authors, added author’s year of birth and death, or found a book cover when there wasn’t any. \r\n\r\nYou might find some books twice: usually because one is a scan of a regular book and the other one with the blown-up font used for e-readers, or sometimes one will include a cover and the other won’t. .. things like that. The collection is not compressed, so if these things don’t matter to you, feel free to skip downloading one of the two. \r\n\r\n\r\nYou might also enjoy:\r\nWriting manuals collection - 42 books on the art of writing https://thepiratebay.se/torrent/13266319","torrent":{"xt":"urn:btih:ff033b37a683b6a82a185d53ec0c45f20372d7ae","amp;dn":"British+%26amp%3B+Irish+Literature+part+B+-+After+1950","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff033b37a683b6a82a185d53ec0c45f20372d7ae","infoHashBuffer":{"type":"Buffer","data":[255,3,59,55,166,131,182,168,42,24,93,83,236,12,69,242,3,114,215,174]},"announce":[],"urlList":[]}}