{"title":"BratPrincess - Rewire Sissy to Love Big Black Cock Part 1-3 720p","uid":13271948,"size":1375179840,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ff0fbe863609f9403a18a3890ed642d20d34382c&amp;dn=BratPrincess+-+Rewire+Sissy+to+Love+Big+Black+Cock+Part+1-3+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":3,"time":1453408905,"description":"\nJennifer Kendall and Sara - Rewire Sissy to Love Big Black Cock Part 1-3 Complete\r\n\r\nStarring: Empress Jennifer, Princess Kendall, Sara Luvv\r\n\r\n \r\n3x 720p WMVs.\r\n\r\n\r\nPart 1\r\n\r\nJennifer, Kendall and Sara Luvv decide to make danni into a girl. Hes a terrible boy, but a passable girl. It even has cleavage once you put a bra on it. Sara brushes some sparkly powder onto dannis face as the trio giggles. Jennifer gives danni a dramatic cat eye with some black eyeliner. Its going to look so different after the makeover. Itll need a new name. The Princesses name the newly made sissy, danielle. Kendall adds red lipstick to their living doll. Jennifer and Sara each claim an eye and apply mascara. Sissy danielle struggles with the instruction to keep just one eye open. You look like a messy whore, Jennifer says as she fixes the sissys lipstick with a paper towel. Three Princess palms slap powder onto the sissys ugly forehead. They make plans to pierce the sissys ears. Itll be so cute to see it wear earrings! The Princesses manhandle the sissy whores tits. It better get used to it, now that it will be living the life of a lowly slut. The Girls apply a blonde wig to complete the sissys total transformation. A chorus of delighted squeals erupts. It looks so cute! For the finishing touch, the Princesses stuff its big feet into a pair of shiny shoes. Its going to have to be sure to walk with all the grace it can muster. The sissy does a somewhat passable girl walk. Jennifer asks, So danni, do you like sucking big black cock? No, danni answers. Im a boy. The Princesses point out that danni looks more like a girl. Hes already most of the way towards learning to love Worshiping big black cock. The Girls begin the sluts training. Danni is restrained on a table, completely immobilized. A tray with a monitor is positioned in front of dannis face. The screen flashes images of big black cocks with suggestive messages. Think big black cock, crave big black cock, Worship big black cock. Footage of dannis ass getting fucked pulses across the screen. He is going to be so completely and thoroughly brain rewired. (10:33 long)\r\n\r\n\r\nScreens \nhttp://s28.postimg.org/jgzhtsnzx/Rewire_sissy_to_Love_Big_Black_Cock_Part_1_wmv_t.jpg \nhttp://s28.postimg.org/tfp1u0mt9/Rewire_sissy_to_Love_Big_Black_Cock_Part_2_wmv_t.jpg \nhttp://s28.postimg.org/zdy9qige5/Rewire_sissy_to_Love_Big_Black_Cock_Part_3_wmv_t.jpg\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n20 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:ff0fbe863609f9403a18a3890ed642d20d34382c","amp;dn":"BratPrincess+-+Rewire+Sissy+to+Love+Big+Black+Cock+Part+1-3+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0fbe863609f9403a18a3890ed642d20d34382c","infoHashBuffer":{"type":"Buffer","data":[255,15,190,134,54,9,249,64,58,24,163,137,14,214,66,210,13,52,56,44]},"announce":[],"urlList":[]}}